[{"title":"Algorithms","author":"Robert Sedgewick, Kevin Wayne","image_url":"http://books.google.com/books/content?id=idUdqdDXqnAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"C:\\Users\\daniel.heaney\\Documents\\ebooks\\Algorithms-4th--RobertSedgewick- KevinWayne.pdf","publisher":"Addison-Wesley Professional","copywrite":"2011-02-21","description":"This fourth edition of Robert Sedgewick and Kevin Wayne’s Algorithms is the leading textbook on algorithms today and is widely used in colleges and universities worldwide. This book surveys the most important computer algorithms currently in use and provides a full treatment of data structures and algorithms for sorting, searching, graph processing, and string processing--including fifty algorithms every programmer should know. In this edition, new Java implementations are written in an accessible modular programming style, where all of the code is exposed to the reader and ready to use. The algorithms in this book represent a body of knowledge developed over the last 50 years that has become indispensable, not just for professional programmers and computer science students but for any student with interests in science, mathematics, and engineering, not to mention students who use computation in the liberal arts. The companion web site, algs4.cs.princeton.edu, contains An online synopsis Full Java implementations Test data Exercises and answers Dynamic visualizations Lecture slides Programming assignments with checklists Links to related material The MOOC related to this book is accessible via the \"Online Course\" link at algs4.cs.princeton.edu. The course offers more than 100 video lecture segments that are integrated with the text, extensive online assessments, and the large-scale discussion forums that have proven so valuable. Offered each fall and spring, this course regularly attracts tens of thousands of registrants. Robert Sedgewick and Kevin Wayne are developing a modern approach to disseminating knowledge that fully embraces technology, enabling people all around the world to discover new ways of learning and teaching. By integrating their textbook, online content, and MOOC, all at the state of the art, they have built a unique resource that greatly expands the breadth and depth of the educational experience."},{"title":"AngularJS Directives Cookbook","author":"Fernando Monteiro","image_url":"http://books.google.com/books/content?id=RvOoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"C:\\Users\\daniel.heaney\\Documents\\ebooks\\AngularJS Directives Cookbook - Fernando Monteiro.pdf","publisher":"Packt Publishing Ltd","copywrite":"2015-11-30","description":"Extend the capabilities of AngularJS and build dynamic web applications by creating customized directives with this selection of more than 30 recipes About This Book Learn how to extend HTML templates in new ways to build even better web applications with exceptional interface components Build reusable directives for large-scale AngularJS applications Create even sophisticated and impressive modern web apps with ease Who This Book Is For This book is for developers with AngularJS experience who want to extend their knowledge to create or customize directives in any type of AngularJS application. Some experience of modern tools such as Yeoman and Bower would be helpful, but is not a requirement. What You Will Learn Build and customize external HTML templates, and create simple, effective directives for common interface components Learn how to use Controller function and any Bootstrap UI directives to manipulate the DOM and how to transform any UI library into AngularJS directives Construct an AngularJS application to use shared components and validate your HTML5 Discover how to use jQuery events and manipulate the DOM using jQuery UI inside AngularJS applications Create custom directives for ongoing projects using Yeoman generators, and find out how to implement standalone directives Build reusable directives for Large AngularJS applications and extend directives to use dynamic templates Write unit test for directives using the Karma runner and Jasmine's behavior-driven development framework In Detail AngularJS directives are at the center of what makes it such an exciting – and important - web development framework. With directives, you can take greater control over HTML elements on your web pages – they 'direct' Angular's HTML compiler to behave in the way you want it to. It makes building modern web applications a much more expressive experience, and allows you to focus more closely on improving the way that user interaction impacts the DOM and the way your app manages data. If you're already using Angular, you probably recognize the power of directives to transform the way you understand and build your projects – but customizing and creating your own directives to harness AngularJS to its full potential can be more challenging. This cookbook shows you how to do just that – it's a valuable resource that demonstrates how to use directives at every stage in the workflow. Packed with an extensive range of solutions and tips that AngularJS developers shouldn't do without, you'll find out how to make the most of directives. You'll find recipes demonstrating how to build a number of different user interface components with directives, so you can take complete control over how users interact with your application. You'll also learn how directives can simplify the way you work by creating reusable directives – by customizing them with Yeoman you can be confident that you're application has the robust architecture that forms the bedrock of the best user experiences. You'll also find recipes that will help you learn how to unit test directives, so you can be confident in the reliability and performance of your application. Whether you're looking for guidance to dive deeper into AngularJS directives, or you want a reliable resource, relevant to today's web development challenges, AngularJS Directives Cookbook delivers everything you need in an easily accessible way. Style and approach This book easy-to-follow guide is packed with hands-on recipes to help you build modular AngularJS applications with custom directives. It presents tips on using the best tools and various ways to use these tools for front-end development."},{"title":"AngularJS: Novice to Ninja","author":"Sandeep Panda","image_url":"http://books.google.com/books/content?id=37CjBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"C:\\Users\\daniel.heaney\\Documents\\ebooks\\angularjs_novice_to_ninja.pdf","publisher":"SitePoint","copywrite":"2014-09-29","description":"AngularJS: Novice to Ninja is your fast track route to mastering AngularJS, the superheroic JavaScript framework. AngularJS provides the fastest, most efficient way to build single page web applications. What will I learn? In this practical and fun-to-read book, you'll learn the fundamentals of AngularJS, such as scopes, modules and controllers. You'll then move on to more sophisticated techniques, including using directives, filters and expressions to build a full single page web application. Discover the power of AngularJS's two-way data binding Using AngularJS and TDD Get to grips with modules, scopes, and controllers Enhance your HTML with directives Build a complete working single page blog application as you learn And much more"}]