[{"title":"10 Crucial Features to Use in Your Wireless Router Setup at Home","author":"MakeUseOf","image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"10 Crucial Features to Use in Your Wireless Router Setup at Home {KornBolt}.pdf","description":"A wireless router is a simple device that shares Internet access to your home without the need for cables. For the most part, it just works. Once you’ve turned it on, you don’t really need to touch it ever again.\n\nBut if you do that, you’re likely missing out on a lot of extra features — ones that could make your network perform more smoothly, improve your gaming experience, and enable you to control who is on your network and when.\n\nIn this guide, we’ll take a look at ten extra features your router may offer to see what makes them useful and how you could benefit by using them.","publisher":"MakeUseOf","copywrite":"2014"},{"title":"Web Developer's Reference Guide","author":"Joshua Johanan, Talha Khan, Ricardo Zea","image_url":"http://books.google.com/books/content?id=Fp3jCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"1783552131 Web Developer's Reference Guide.pdf","publisher":"Packt Publishing Ltd","copywrite":"2016-03-28","description":"A one-stop guide to the essentials of web development including popular frameworks such as jQuery, Bootstrap, AngularJS, and Node.js About This Book Understand the essential elements of HTML, CSS, and JavaScript, including how and when to use them Walk through three of the best and most popular web development frameworks – jQuery, Bootstrap, and AngularJS References for any function you will need in your day-to-day web development Who This Book Is For This book is perfect for beginners but more advanced web developers will also benefit. Laid out so you can refer to as much or as little as you need to, with this book you can exhaustively explore essential concepts for modern web developers. What You Will Learn Explore detailed explanations of all the major HTML elements and attributes, illustrated with examples Take a deep dive into CSS properties and functions and master their usage Find clear, concise descriptions of JavaScript syntax and expressions Recognize various JavaScript design patterns and learn the basics of JavaScript object-orientated programming Implement the latest ECMAScript 6 for client-side scripting in your web applications Discover new ways to develop your website's front end quickly and easily using Bootstrap Write JavaScript extensibly using jQuery-JavaScript's feature-rich library Delve into the key Node.js modules used in JavaScript server-side programming Access AngularJS 's important modules, controllers, directives, and services quickly In Detail This comprehensive reference guide takes you through each topic in web development and highlights the most popular and important elements of each area. Starting with HTML, you will learn key elements and attributes and how they relate to each other. Next, you will explore CSS pseudo-classes and pseudo-elements, followed by CSS properties and functions. This will introduce you to many powerful and new selectors. You will then move on to JavaScript. This section will not just introduce functions, but will provide you with an entire reference for the language and paradigms. You will discover more about three of the most popular frameworks today—Bootstrap, which builds on CSS, jQuery which builds on JavaScript, and AngularJS, which also builds on JavaScript. Finally, you will take a walk-through Node.js, which is a server-side framework that allows you to write programs in JavaScript. Style and approach This book is an easy-to-follow, comprehensive reference guide. Each topic, function, or element is listed methodically along with parameters, return values, and descriptions. Examples are also included to help you put the concepts to use quickly in the real world.","tag_list":"jQuery, Bootstrap, AngularJS"},{"title":"Android Application Development Cookbook","author":"Wei-Meng Lee","image_url":"http://books.google.com/books/content?id=iO5pX6WoK8YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Android Application Development Cookbook - Second Edition 2016 {PRG}.pdf","publisher":"John Wiley & Sons","copywrite":"2012-12-27","description":"A must-have collection of ready-to-use Android recipes! The popularity of Google Android devices is seemingly unstoppable and the Android 4 release offers, for the first time, a single OS solution for building both phone and tablet applications. With that exciting information in mind, veteran author Wei-Meng Lee presents you with 100 unique recipes that you can apply today in order to discover solutions to some of the most commonly encountered problems that exist in Android programming. Covering the scope of multiple Android releases up through Android 4, this reference features a task description, followed by the solution(s) available, and a standalone project file that illustrates the use of the recipe. Formatting each recipe to be standalone, Wei-Meng Lee allows you to jump into the relevant recipe to find a solution to specific challenges. Identifies and describes a programming task, provides a step-by-step solution, and presents a full-code solution ready for download Covers multiple Android releases Addresses such topics as user interfaces, telephony and messaging, networking, Google maps, location-based services, persisting data, leveraging hardware features, and more Android Application Development Cookbook is your solution to discovering...solutions!"},{"title":"Android Studio Cookbook","author":"Mike van Drongelen","image_url":"http://books.google.com/books/content?id=0fx_CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Android Studio Cookbook.pdf","publisher":"Packt Publishing Ltd","copywrite":"2015-10-30","description":"Design, test, and debug your apps using Android Studio About This Book See what Material design is about and how to apply it your apps Explore the possibilities to develop apps that works on any type of device A step-by-step practical guide that will help you build improved applications, change their look, and debug them Who This Book Is For This book is for developers that are already familiar with programming concepts and have already started creating apps for the Android platform, for example, by using the Eclipse IDE. It is for developers who intend to use Android Studio as their primary IDE or want to use Android Studio more efficiently. What You Will Learn Develop Android Studio applications using Genymotion Apply the concepts of Material design to your applications Use memory monitoring tools to tweak performance Build applications for Android Wearable Capture images, video, or audio within your Android app Use content providers to display data Build apps with a cloud-based backend Create media-related apps that will run on phones, phablets, tablets, and TVs In Detail This book starts with an introduction of Android Studio and why you should use this IDE rather than Eclipse. Moving ahead, it teaches you to build a simple app that requires no backend setup but uses Google Cloud or Parse instead. After that, you will learn how to create an Android app that can send and receive text and images using Google Cloud or Parse as a backend. It explains the concepts of Material design and how to apply them to an Android app. Also, it shows you how to build an app that runs on an Android wear device. Later, it explains how to build an app that takes advantage of the latest Android SDK while still supporting older Android versions. It also demonstrates how the performance of an app can be improved and how memory management tools that come with the Android Studio IDE can help you achieve this. By the end of the book, you will be able to develop high quality apps with a minimum amount of effort using the Android Studio IDE. Style and approach This is a practical guide full of challenges and many real-world examples that demonstrate interesting development concepts. Besides smartphones and tablets, it also covers Android wearable devices and Android TV. Although strongly recommended, it is not necessary to own any Android device yourself."},{"title":"Angularjs 2.0: Easy Guide on Web Application Development","author":"Henry Rowland","image_url":"https://books.google.com/books/content?id=LXnIjgEACAAJ&printsec=frontcover&img=1&zoom=1&imgtk=AFLRE71tIWVL8l-zpAxqhpcOPZQjmCQCLkY6ExTf9HNVHZPxnH6_HzNO8_3vrsS__J4reJNYzuzXk8rU5XChJzdpcPqWisucQOcCIqsuPEsIJ0R79XuOu18wem06uqxWAXZbRVwLJIcg","type_id":1,"url":"AngularJS Easy Guide on Web Application Development by Henry Rowland {Zer07}.epub","publisher":"CreateSpace Independent Publishing Platform","copywrite":"2015","description":"This book discusses AngularJS in detail. The first part of the book is an explanation ofwhat AngularJS is, its relationship to Javascript, and how it can be used. The book then guides you on how to set up the platform for programming in AngularJS. The various platforms which can be used for this purpose are discussed, and the MVC architecture offered by AngularJS to the programmers is explored. You will learn the various layers of your AngularJS application, and how data is passed between these layers. The concept of internationalization in AngularJS is explained, as well as how to internationalize attributes such as dates and currency in AngularJS. Ajax for AngularJS and how to work with this is presented. The \"$http\" property which is very useful in AngularJS is explained in detail. The book will also guide you on how to work with events in AngularJS and how to combine the Twitter Bootstrap with AngularJS for the purpose of development. The services \"$interval\" and \"$timeout\" are also explored, so that you will be in a position to apply timing in your applications .","tag_list":"javacript, angular"},{"title":"AngularJS: Novice to Ninja EPUB","author":"Sandeep Panda","image_url":"http://books.google.com/books/content?id=37CjBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"angularjs_novice_to_ninja.epub","publisher":"SitePoint","copywrite":"2014-09-29","description":"AngularJS: Novice to Ninja is your fast track route to mastering AngularJS, the superheroic JavaScript framework. AngularJS provides the fastest, most efficient way to build single page web applications. What will I learn? In this practical and fun-to-read book, you'll learn the fundamentals of AngularJS, such as scopes, modules and controllers. You'll then move on to more sophisticated techniques, including using directives, filters and expressions to build a full single page web application. Discover the power of AngularJS's two-way data binding Using AngularJS and TDD Get to grips with modules, scopes, and controllers Enhance your HTML with directives Build a complete working single page blog application as you learn And much more"},{"title":"AngularJS Directives Cookbook","author":"Fernando Monteiro","image_url":"http://books.google.com/books/content?id=RvOoCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"AngularJS Directives Cookbook - Fernando Monteiro.pdf","publisher":"Packt Publishing Ltd","copywrite":"2015-11-30","description":"Extend the capabilities of AngularJS and build dynamic web applications by creating customized directives with this selection of more than 30 recipes About This Book Learn how to extend HTML templates in new ways to build even better web applications with exceptional interface components Build reusable directives for large-scale AngularJS applications Create even sophisticated and impressive modern web apps with ease Who This Book Is For This book is for developers with AngularJS experience who want to extend their knowledge to create or customize directives in any type of AngularJS application. Some experience of modern tools such as Yeoman and Bower would be helpful, but is not a requirement. What You Will Learn Build and customize external HTML templates, and create simple, effective directives for common interface components Learn how to use Controller function and any Bootstrap UI directives to manipulate the DOM and how to transform any UI library into AngularJS directives Construct an AngularJS application to use shared components and validate your HTML5 Discover how to use jQuery events and manipulate the DOM using jQuery UI inside AngularJS applications Create custom directives for ongoing projects using Yeoman generators, and find out how to implement standalone directives Build reusable directives for Large AngularJS applications and extend directives to use dynamic templates Write unit test for directives using the Karma runner and Jasmine's behavior-driven development framework In Detail AngularJS directives are at the center of what makes it such an exciting – and important - web development framework. With directives, you can take greater control over HTML elements on your web pages – they 'direct' Angular's HTML compiler to behave in the way you want it to. It makes building modern web applications a much more expressive experience, and allows you to focus more closely on improving the way that user interaction impacts the DOM and the way your app manages data. If you're already using Angular, you probably recognize the power of directives to transform the way you understand and build your projects – but customizing and creating your own directives to harness AngularJS to its full potential can be more challenging. This cookbook shows you how to do just that – it's a valuable resource that demonstrates how to use directives at every stage in the workflow. Packed with an extensive range of solutions and tips that AngularJS developers shouldn't do without, you'll find out how to make the most of directives. You'll find recipes demonstrating how to build a number of different user interface components with directives, so you can take complete control over how users interact with your application. You'll also learn how directives can simplify the way you work by creating reusable directives – by customizing them with Yeoman you can be confident that you're application has the robust architecture that forms the bedrock of the best user experiences. You'll also find recipes that will help you learn how to unit test directives, so you can be confident in the reliability and performance of your application. Whether you're looking for guidance to dive deeper into AngularJS directives, or you want a reliable resource, relevant to today's web development challenges, AngularJS Directives Cookbook delivers everything you need in an easily accessible way. Style and approach This book easy-to-follow guide is packed with hands-on recipes to help you build modular AngularJS applications with custom directives. It presents tips on using the best tools and various ways to use these tools for front-end development."},{"title":"AngularJS in Action","author":"Brian Ford, Lukas Ruebbelke","image_url":"http://books.google.com/books/content?id=FBBenAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"AngularJS in Action.pdf","publisher":"Manning Publications Company","copywrite":"2015-05-01","description":"Summary AngularJS in Action covers everything you need to know to get started with the AngularJS framework. As you read, you'll explore all the individual components of the framework and learn how to customize and extend them. You'll discover the emerging patterns for web application architecture and tackle required tasks like communicating with a web server back-end. Along the way, you'll see AngularJS in action by building real world applications with thoroughly commented code. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications. About the Technology AngularJS is a JavaScript-based framework that extends HTML, so you can create dynamic, interactive web applications in the same way you create standard static pages. Out of the box, Angular provides most of the functionality you'll need for basic apps, but you won't want to stop there. Intuitive, easy to customize, and test-friendly, Angular practically begs you to build more interesting apps. About the Book AngularJS in Action teaches you everything you need to get started with AngularJS. As you read, you'll learn to build interactive single-page web interfaces, apply emerging patterns like MVVM, and tackle key tasks like communicating with back-end servers. All examples are supported by clear explanations and illustrations along with fully annotated code listings. This book assumes you know at least some JavaScript. No prior exposure to AngularJS is required. What's Inside Get started with AngularJS Write your own components Best practices for application architecture Progressively build a full-featured application Covers Angular JS 1.3 Sample application updated to the latest version of Angular About the Author Lukas Ruebbelke is a full-time web developer and an active contributor to the AngularJS community. Table of Contents PART 1 GET ACQUAINTED WITH ANGULARJS Hello AngularJS Structuring your AngularJS application PART 2 MAKE SOMETHING WITH ANGULARJS Views and controllers Models and services Directives Animations Structuring your site with routes Forms and validations APPENDIXES Setting up Karma Setting up a Node.js server Setting up a Firebase server Running the app"},{"title":"Apache ZooKeeper Essentials","author":"Saurav Haloi","image_url":"http://books.google.com/books/content?id=Ym9uBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Apache ZooKeeper Essentials (2015).pdf","publisher":"Packt Publishing Ltd","copywrite":"2015-01-28","description":"Whether you are a novice to ZooKeeper or already have some experience, you will be able to master the concepts of ZooKeeper and its usage with ease. This book assumes you to have some prior knowledge of distributed systems and high-level programming knowledge of C, Java, or Python, but no experience with Apache ZooKeeper is required.","tag_list":"cloud"},{"title":"AngularJS: Novice to Ninja","author":"Sandeep Panda","image_url":"http://books.google.com/books/content?id=37CjBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"angularjs_novice_to_ninja.pdf","publisher":"SitePoint","copywrite":"2014-09-29","description":"AngularJS: Novice to Ninja is your fast track route to mastering AngularJS, the superheroic JavaScript framework. AngularJS provides the fastest, most efficient way to build single page web applications. What will I learn? In this practical and fun-to-read book, you'll learn the fundamentals of AngularJS, such as scopes, modules and controllers. You'll then move on to more sophisticated techniques, including using directives, filters and expressions to build a full single page web application. Discover the power of AngularJS's two-way data binding Using AngularJS and TDD Get to grips with modules, scopes, and controllers Enhance your HTML with directives Build a complete working single page blog application as you learn And much more","tag_list":"angular"},{"title":"Basketball","author":"Hal Wissel","image_url":"http://books.google.com/books/content?id=B_ntl4MtvZ4C&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Basketball - Steps to Success - 3rd Edition (2011).pdf","publisher":"Human Kinetics 1","copywrite":"2004","description":"Basketball: Steps to Success provides in-depth, progressive instruction in techniques and tactics, including detailed tutoring on shooting and 111 drills featuring a scoring system to gauge your progress. As you build your skill base, you'll learn how to make all the right moves in game situations, whether it's executing the correct footwork when defending screens or making the right pass for a winning basket. Highly regarded coach, teacher, and clinician Hal Wissel will help you execute each technique proficiently and consistently on the court."},{"title":"Beginning Backbone.js","author":"James Sugrue","image_url":"http://books.google.com/books/content?id=3V1nAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Beginning Backbone.js.pdf","publisher":"Apress","copywrite":"2013-12-15","description":"Beginning Backbone.js is your step-by-step guide to learning and using the Backbone.js library in your web projects. Backbone.js is one of the most popular JavaScript libraries among web developers, used to create modular, single-page web apps. This book takes you from downloading Backbone.js and its dependencies all the way to using more advanced libraries to structure your application architecture, and everything in between. With a real-world, practical approach, you will learn how you can integrate Backbone.js into the center of your JavaScript stack, and create scalable applications. James Sugrue shows you how to implement all aspects of templating, work efficiently with RequireJS, and fully understand Grunt and all its plug-ins. Armed with this knowledge you'll be able to architect a continuous integration system that is key to real-world applications. With the explosion of JavaScript-based applications on the web, the need for more structured approaches to code management is more important than ever. Backbone.js helps create applications that separate models from views, enabling developers to avoid spaghetti code. Beginning Backbone.js will gently guide you into this amazingly powerful library, and help you ramp up to building professional applications. Integrate Backbone.js into your work today with this indispensable book. What you’ll learn Learn the importance of MVC approaches in software development Learn why Backbone.js is so popular and how to integrate it into your JavaScript stack Understand core Backbone.js concepts such as models, views, routers, and events Test your application using the latest JavaScript testing tools Create build scripts using Grunt.js to simplify your build and deployment workflow Use additional libraries to build on the power of Backbone.js Avoid common beginner errors and code using best practices Who this book is for Beginning Backbone.js is for the web developer who is already confident with JavaScript, but who is keen to build larger, single-page web apps. If you want to introduce more structure, quality, and process to your web application using Backbone.js, and other leading JavaScript technologies, this is the book for you. Table of Contents Chapter 1: An Introduction To Backbone.js Chapter 2: Getting Object-Oriented Chapter 3: Backbone.js Model, View, and Collections Chapter 4: Templating with Underscore, Handlebars, and Mustache Chapter 5: Backbone.js Routers and Events Chapter 6: Backbone.js Start To Finish: Twitter App Example Chapter 7: The Backbone Ecosystem Chapter 8: Testing Your Backbone.js Application Chapter 9: Using Grunt for Your Build Process Chapter 10: Extending Backbone.js with Marionnette Chapter 11: Best Practices With Backbone.js Chapter 12: Creating A Manageable JavaScript Codebase","tag_list":"javascript"},{"title":"Bootstrap Site Blueprints Volume II","author":"Matt Lambert","image_url":"http://books.google.com/books/content?id=VQQcDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Bootstrap Site Blueprints Volume II.pdf","publisher":"Packt Publishing Ltd","copywrite":"2016-01-06","description":"Maximize the potential of Bootstrap with a collection of real-world site projects for better, faster, more responsive web applications About This Book Build Bootstrap projects quickly and easily with Harp.js, Node, and Less Learn how to extend Bootstrap with the use of open source JavaScript and icon web font libraries Get acquainted with building complex social networking, wiki, and dashboard projects with Bootstrap Who This Book Is For Bootstrap Site Blueprints Volume II is geared for developers of all experience levels. It is written in a concise, easy-to-understand way. Each project follows a step-by-step process that anyone can understand. Some experience with Bootstrap beforehand would definitely be an asset but is not required. What You Will Learn Customize and extend existing Bootstrap JavaScript components Combine the Google Material Design look and feel with Bootstrap Use flexbox and other cutting-edge CSS3 techniques in Bootstrap Implement and customize open source JavaScript chart libraries in Bootstrap Optimize and implement an optimal user experience for all your projects Implement the Disqus commenting platform into your projects In Detail Bootstrap is the most popular open source project on GitHub today. With a little bit of know-how, this massively popular CSS framework can leveraged for any type of complex web application or website. Bootstrap Site Blueprints Volume II will teach you to build these types of projects in an easy-to-understand fashion. The key to any complex Bootstrap project is a strong development foundation for your project. The book will first teach you how to build a Bootstrap development environment using Harp.js, Node, and Less. In the next chapters, we'll build on this foundation by creating restaurant and mobile-first aggregator projects. Once you're warmed up, we'll move on to more complex projects such as a wiki, a new magazine, a dashboard, and finally a social networking website. Whether you are brand new to Bootstrap or a seasoned expert, this book will provide you with the skills you need to successfully create a number of popular web applications and websites. Style and approach This book takes a step-by-step approach to building each project, explained in a conversational and easy-to-follow style. We start by designing a development environment that will be used in all of the book's projects. The projects start from an easy-intermediate level and progress to advanced as the book goes on."},{"title":"Building Web Applications with Erlang","author":"Zachary Kessin","image_url":"http://books.google.com/books/content?id=SA1EtSL4SawC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Building Web Applications with Erlang.epub","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2012-06-07","description":"\"Working with REST and Web-Sockets on Yaws\"--Cover."},{"title":"Clojure Programming","author":"Chas Emerick, Brian Carper, Christophe Grand","image_url":"http://books.google.com/books/content?id=I8KdEKceCHAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Clojure Programming.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2012-03-30","description":"Clojure is a practical, general-purpose language that offers expressivity rivaling other dynamic languages like Ruby and Python, while seamlessly taking advantage of Java libraries, services, and all of the resources of the JVM ecosystem. This book helps you learn the fundamentals of Clojure with examples relating it to the languages you know already, in the domains and topics you work with every day. See how this JVM language can help eliminate unnecessary complexity from your programming practice and open up new options for solving the most challenging problems. Clojure Programming demonstrates the language’s flexibility by showing how it can be used for common tasks like web programming and working with databases, up through more demanding applications that require safe, effective concurrency and parallelism, data analysis, and more. This in-depth look helps tie together the full Clojure development experience, from how to organize your project and an introduction to Clojure build tooling, to a tutorial on how to make the most of Clojure’s REPL during development, and how to deploy your finished application in a cloud environment. Learn how to use Clojure while leveraging your investment in the Java platform Understand the advantages of Clojure as an efficient Lisp for the JVM See how Clojure is used today in several practical domains Discover how Clojure eliminates the need for many verbose and complicated design patterns Deploy large or small web applications to the cloud with Clojure"},{"title":"Building a PC in Easy Steps","author":"Stuart Yarnold","image_url":"http://books.google.com/books/content?id=85yO_sC5tj0C&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Building a PC in easy steps (4th edtion) Stuart Yarnold.pdf","publisher":"In Easy Steps","copywrite":"2011","description":"A guide to building a custom PC covers such topics as CPUs, memory, motherboards, system cases, video systems, monitors, hard drives, input devices, testing and setting up the system, and peripherals."},{"title":"CoffeeScript Mark Volkmann slides","author":"Mark Volkmann","image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":2,"url":"CoffeeScript Mark Volkmann slides.pdf"},{"title":"CoffeeScript Quick Reference","author":"","image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"CoffeeScript Quick Ref.pdf","publisher":"","copywrite":"2012","description":""},{"title":"Coffeescript Programming with Jquery, Rails, and Node. Js","author":"Michael Erasmus","image_url":"http://books.google.com/books/content?id=8-hGDdjkU9oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"CoffeeScript Programming with jQuery, Rails, and Node.js.pdf","publisher":"Packt Publishing Ltd","copywrite":"2012-12-13","description":"3. CoffeeScript and jQuery; Finding and changing elements; The function; Utility functions; Ajax methods; Using jQuery; Using CoffeeScript and jQuery in the browser; Compiling CoffeeScript; jQuery and CoffeeScript; Testing it all; Running a local web server; Our application; TodoMVC; Our initial HTML; Initializing our app; Adding a to-do item; Using localStorage; Displaying the to-do items; Showing the to-do items; Removing and completing items; Now, it's your turn!; Summary; 4. CoffeeScript and Rails; What makes Rails special?; Convention over configuration.","tag_list":"jQuery, Rails, Node.js, coffeescript"},{"title":"CoffeeScript The Good Parts","author":"Azat Mardan","image_url":"","category_id":10,"type_id":2,"url":"CoffeeScript-The-Good-Parts.pdf","publisher":"","copywrite":"2015","description":""},{"title":"Coffeescript: Accelerated JavaScript Development","author":"Trevor Burnham","image_url":"https://imagery.pragprog.com/products/219/tbcoffee_xlargecover.jpg?1304278335","category_id":10,"type_id":1,"url":"coffeescript-trevor-burnham.pdf","publisher":"Pragmatic Publishing","copywrite":"2011","description":"CoffeeScript: Accelerated JavaScript Development offers a thorough introduction to this new language, starting from the basics. You’ll learn to use time-saving features like list comprehensions and splats, organize your code into modules with extensible classes, and see how to deploy your work to multiple environments. Each chapter is example-driven and includes challenging exercises to push your CoffeeScript know-how further."},{"title":"CHECKOUT -- Bootstrap","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"Bootstrap.pdf"},{"title":"CoffeeScript Application Development Cookbook","author":"Mike Hatfield","image_url":"http://books.google.com/books/content?id=NjW9BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"CoffeeScript_Cookbook.pdf","publisher":"Packt Publishing Ltd","copywrite":"2015-03-31","description":"If you are interested in developing modern applications, this book will help you leverage the vast JavaScript ecosystem while using an elegant language, helping you avoid the shortcomings of JavaScript."},{"title":"Consumer Reports Room by Room Makeovers","author":"Consumer Reports","image_url":"http://books.google.com/books/content?id=Z5U0W6WPv2UC&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Consumer Reports - Room by Room Makeovers - November 2016.pdf","publisher":"Consumer Reports","copywrite":"2016","description":"Now you can get the wisdom of one full year of \"Consumer Reports\" in one place. We've assembled all twelve 2006 issues of \"Consumer Reports \"magazine and put them in a single bound collection. \"Consumer Reports \"magazine is the source you can trust for ratings and recommendations of consumer products and services. Whether you're buying a car, a TV, or a new cell phone plan, our unbiased reports will help you get the best value for your money."},{"title":"CHECKOUT: coffeescript tutorial","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"coffeescript_tutorial.pdf"},{"title":"Doctor Who: The Legends of Ashildr","author":"Justin Richards, James Goss, David Llewellyn, Jenny T. Colgan","image_url":"http://books.google.com/books/content?id=GoYFCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Doctor Who_ The Legends of Ashildr - Justin Richards.epub","publisher":"Random House","copywrite":"2015-12-10","description":"Ashildr, a young Viking girl, died helping the Doctor and Clara to save the village she loved. And for her heroism, the Doctor used alien technology to bring her back to life. Ashildr is now immortal – The Woman Who Lived. Since that day, Ashildr has kept journals to chronicle her extraordinary life. The Legends of Ashildr is a glimpse of some of those stories: the terrors she has faced, the battles she has won, and the treasures she has found. These are tales of a woman who lived longer than she should ever have lived – and lost more than she can even remember. An original novel featuring the Twelfth Doctor as played by Peter Capaldi, and Ashildr as played by Maisie Williams."},{"title":"Elgin Baylor","author":"Bijan C. Bayne","image_url":"http://books.google.com/books/content?id=w_c-CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Elgin_Baylor__The_Man_Who_Changed_Basketball__Bijan_C._Bayne.epub","publisher":"Rowman & Littlefield","copywrite":"2015-08-13","description":"NBA Hall of Fame player Elgin Baylor was an innovator in his sport, a civil rights trailblazer, and a true superstar. He influenced future NBA All Stars such as Michael Jordan and Kobe Bryant, and is considered by many to be one of the most important players in NBA history. A prolific scorer who baffled opponents with his twists and turns and inventive moves, Baylor was a force both on and off the court for the Minneapolis and Los Angeles Lakers. In Elgin Baylor: The Man Who Changed Basketball, Bijan C. Bayne tells the story of how a kid from the streets of segregated Washington, DC, who didn’t attend college until he was over twenty, revolutionized basketball and stood up for his rights. In a time when few nationally prominent black athletes spoke out about racial inequality in the United States, Baylor refused to tolerate discrimination. On the court, with his balletic moves and urban style of play, Elgin Baylor lifted the game of basketball off the floor and into the air. Elgin Baylor: The Man Who Changed Basketball includes personal reflections from Baylor’s old schoolyard companions, former teammates, players he coached in the NBA, and noted sports journalists, bringing to life his childhood, college career, and professional life with intimate detail. Basketball fans, historians, and those interested in the impact of sports on the Civil Rights Movement will all find this first-ever biography of Elgin Baylor both fascinating and inspirational."},{"title":"Ember.js in Action","author":"Joachim Haagen Skeie","image_url":"http://books.google.com/books/content?id=LYxRmwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ember.js in Action.pdf","publisher":"Manning Publications","copywrite":"2013-08-28","description":"Explains how to use Ember.js a JavaScript MVC framework that provides the patterns, components, and scaffolding needed to build web applications.","tag_list":"javascript"},{"title":"Emotional Agility","author":"Susan David","image_url":"http://books.google.com/books/content?id=yr62CgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Emotional Agility_ Get Unstuck, Embrace Change and Thrive in Work and Life (2016).epub","publisher":"Penguin","copywrite":"2016-09-06","description":"An Amazon Best Book of 2016 The counterintuitive approach to achieving your true potential, heralded by the Harvard Business Review as a groundbreaking idea of the year. The path to personal and professional fulfillment is rarely straight. Ask anyone who has achieved his or her biggest goals or whose relationships thrive and you’ll hear stories of many unexpected detours along the way. What separates those who master these challenges and those who get derailed? The answer is agility—emotional agility. Emotional agility is a revolutionary, science-based approach that allows us to navigate life’s twists and turns with self-acceptance, clear-sightedness, and an open mind. Renowned psychologist Susan David developed this concept after studying emotions, happiness, and achievement for more than twenty years. She found that no matter how intelligent or creative people are, or what type of personality they have, it is how they navigate their inner world—their thoughts, feelings, and self-talk—that ultimately determines how successful they will become. The way we respond to these internal experiences drives our actions, careers, relationships, happiness, health—everything that matters in our lives. As humans, we are all prone to common hooks—things like self-doubt, shame, sadness, fear, or anger—that can too easily steer us in the wrong direction. Emotionally agile people are not immune to stresses and setbacks. The key difference is that they know how to adapt, aligning their actions with their values and making small but powerful changes that lead to a lifetime of growth. Emotional agility is not about ignoring difficult emotions and thoughts; it’s about holding them loosely, facing them courageously and compassionately, and then moving past them to bring the best of yourself forward. Drawing on her deep research, decades of international consulting, and her own experience overcoming adversity after losing her father at a young age, David shows how anyone can thrive in an uncertain world by becoming more emotionally agile. To guide us, she shares four key concepts that allow us to acknowledge uncomfortable experiences while simultaneously detaching from them, thereby allowing us to embrace our core values and adjust our actions so they can move us where we truly want to go. Written with authority, wit, and empathy, Emotional Agility serves as a road map for real behavioral change—a new way of acting that will help you reach your full potential, whoever you are and whatever you face."},{"title":"Erlang Programming","author":"Francesco Cesarini, Simon Thompson","image_url":"http://books.google.com/books/content?id=Qr_WuvfTSpEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Erlang Programming.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2009-06-11","description":"This book is an in-depth introduction to Erlang, a programming language ideal for any situation where concurrency, fault tolerance, and fast response is essential. Erlang is gaining widespread adoption with the advent of multi-core processors and their new scalable approach to concurrency. With this guide you'll learn how to write complex concurrent programs in Erlang, regardless of your programming background or experience. Written by leaders of the international Erlang community -- and based on their training material -- Erlang Programming focuses on the language's syntax and semantics, and explains pattern matching, proper lists, recursion, debugging, networking, and concurrency. This book helps you: Understand the strengths of Erlang and why its designers included specific features Learn the concepts behind concurrency and Erlang's way of handling it Write efficient Erlang programs while keeping code neat and readable Discover how Erlang fills the requirements for distributed systems Add simple graphical user interfaces with little effort Learn Erlang's tracing mechanisms for debugging concurrent and distributed systems Use the built-in Mnesia database and other table storage features Erlang Programming provides exercises at the end of each chapter and simple examples throughout the book."},{"title":"Cracking the Coding Interview","author":"Gayle Laakmann McDowell","image_url":"http://books.google.com/books/content?id=anhAXwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Cracking the Coding Interview, 6th Edition 189 Programming Questions and Solutions.pdf","publisher":"CreateSpace","copywrite":"2011","description":"Now in the 5th edition, Cracking the Coding Interview gives you the interview preparation you need to get the top software developer jobs. This book provides: 150 Programming Interview Questions and Solutions: From binary trees to binary search, this list of 150 questions includes the most common and most useful questions in data structures, algorithms, and knowledge based questions. 5 Algorithm Approaches: Stop being blind-sided by tough algorithm questions, and learn these five approaches to tackle the trickiest problems. Behind the Scenes of the interview processes at Google, Amazon, Microsoft, Facebook, Yahoo, and Apple: Learn what really goes on during your interview day and how decisions get made. Ten Mistakes Candidates Make -- And How to Avoid Them: Don't lose your dream job by making these common mistakes. Learn what many candidates do wrong, and how to avoid these issues. Steps to Prepare for Behavioral and Technical Questions: Stop meandering through an endless set of questions, while missing some of the most important preparation techniques. Follow these steps to more thoroughly prepare in less time."},{"title":"Everything You Wanted to Know About Core Java","author":"Gooner","image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"Everything You Wanted to Know About Core Java (2016).pdf","publisher":"Unknown","copywrite":"2016","description":"E-book tutorial on Java, available mostly through torrent sites."},{"title":"Full Stack JavaScript Development With MEAN","author":"Colin J Ihrig, Adam Bretz","image_url":"http://books.google.com/books/content?id=XhajBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Full Stack JavaScript -dbw-.pdf","publisher":"SitePoint","copywrite":"2014-12-24","description":"With modern tools. it is possible to create a production grade, full-stack application using HTML, CSS, and JavaScript alone. The combination of MongoDB, Express, AngularJS, and Node.js has become so popular that it has earned the title MEAN stack -- the subject of this book. This book explores the MEAN stack in detail. We will begin by covering Node.js, as it will lay the groundwork for all of our server-side work. You will learn how to get Node running on your local machine as well as download modules using npm. The key aspects of the Node.js programming model will also be covered. From there, we will move on to MongoDB, where you'll learn how to interact with Mongo from a Node application. You will also learn how to create, retrieve, update, and delete data from a Mongo store. After you have a solid grasp on Node and Mongo, the book will move on to the Express web server. We'll cover the basics of Express applications via topics like routes and middleware. Building on previous chapters, we will cover the integration of Node, Mongo, and Express. Our coverage of the MEAN stack will wrap up with several chapters on AngularJS. These chapters will cover Angular fundamentals like data binding, directives, controllers, routing, and services. In an effort to explore competing technologies, a slight introduction to Ember.js will also be provided. Full stack JavaScript is not fully encompassed by the MEAN stack. There is an entire ecosystem of JavaScript tools to learn about, and this book will introduce a few of them. We will cover task runners Gulp.js and Grunt.js which are extremely useful for automating mundane, repetitive tasks. We'll also cover JSHint, a linting tool used to improve code quality. Linting tools analyze source code and report potentials issues - a feature that is especially useful in non-compiled languages like JavaScript."},{"title":"Essential Oils: The Ultimate Beginner's Guide to Uncovering the Healing Benefits of Aromatherapy","author":"Abigail Cruise","image_url":"https://images-na.ssl-images-amazon.com/images/I/51VZVt5L3dL._AC_UL115_.jpg","category_id":10,"type_id":1,"url":"Essential Oils - Abigail Cruise.epub","publisher":"CreateSpace Independent Publishing","copywrite":"2015","description":"You’re about to discover a whole new world of NATURAL healing that has become increasingly popular over the years. If you want to experience what others are talking about then look no further. I can show you to start using aromatherapy and essential oils to live a better life! The amazing truth is that essential oils can be used: -stress management -weight loss - as an effective antibacterial -as an antiviral -as an anti-fungal -as an anti-parasitic -to lower anxiety - as a pain relief -as immune system strengthening ehancer WHAT'S INSIDE THIS BOOK: Inside my book, you will learn everything you need to know about about Essential Oils and how you can properly use them to better your health and your life. Here Is A Preview Of What You'll Learn... • WHAT IS AROMATHERAPY AND ESSENTIAL OILS? • HOW DO ESSENTIAL OILS WORK? • THE CHEMISTRY OF ESSENTIAL OILS • ESSENTIAL OILS – METHODS OF EXTRACTION • THE GRADING SYSTEM • UNDERSTANDING PURITY AND QUALITY • USAGE GUIDELINES FOR ESSENTIAL OILS • DILUTING YOUR OILS • WHERE SHOULD YOU APPLY ESSENTIAL OILS? • HOW TO ADMINISTER ESSENTIAL OILS • MASSAGE AND AROMATHERAPY • BLENDING ESSENTIAL OILS • THE TOP TWELVE ESSENTIAL OILS FOR YOUR BODY AND MIND • THE TOP SEVEN CARRIER OILS • BLENDING YOUR OWN RECIPES • FREE BONUS GIFT"},{"title":"Ethernet: The Definitive Guide","author":"Charles E. Spurgeon","image_url":"http://books.google.com/books/content?id=MRChaUQr0Q0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ethernet_ The Definitive Guide.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2000-02-09","description":"Ethernet is a core networking technology used by every high tech business. While the basic protocols have changed little, new options such as Fast Ethernet and Gigabit Ethernet have increased the complexity of the topic. Ethernet has been the flavor of choice for networking administrators since the early 1980s because of its ease of use and scalability. Written by one of the foremost experts on Ethernet standards and configuration, Charles E. Spurgeon, Ethernet: The Definitive Guide includes everything you need to know to set up and maintain an Ethernet network. Ethernet: The Definitive Guide teaches you everything you need to know about the IEEE 802.3 Ethernet standard and its protocols. The book is logically separated into five parts: Introduction to Ethernet provides a tour of basic Ethernet theory and operation, including a description of Ethernet frames, operation of the Media Access Control (MAC) protocol, full-duplex mode and auto-negotiation. Ethernet Media Systems is the heart of the book. This sectionof Ethernet: The Definitive Guide shows you how to build media-specific Ethernet networks, from a basic 10BASE-T Ethernet offering 10 Mbps over twisted-pair cables, to an advanced 1000BASE-X Gigabit Ethernet, providing up to 1 Gbps of data transfer over fiber optic cables. Building Your Ethernet System teaches you how to build twisted-pair and fiber optic media segments, as well as how to build your Ethernet using repeaters and hubs. Performance and Troubleshooting is divided into two chapters. The first describes both the performance of a given Ethernet channel, as well as the performance of the entire network system. The second includes a tutorial on troubleshooting techniques and describes the kinds of problems network administrators are likely to encounter. The last part of the book includes a complete glossary of terms used throughout the book, a resource list, descriptions of thick and thin coax-based Ethernet systems, a guide to AUI equipment installation and configuration, and a listing of troubleshooting numbers. This book is the definitive guide for anyone wanting to build a scalable local area network (LAN) using Ethernet."},{"title":"Getting Started with Grunt: The JavaScript Task Runner","author":"Jaime Pillora","image_url":"http://books.google.com/books/content?id=bODhAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Getting Started with Grunt_ The JavaScript Task Runner.pdf","publisher":"Packt Publishing Ltd","copywrite":"2014-02-19","description":"A step-by-step, practical tutorial to help you transform into a Grunt power-user. This book is for JavaScript developers who want to get to grips with GruntJS and use it to build and test their JavaScript applications. The only requirement for this book is a basic understanding of objects and functions in JavaScript.","tag_list":"javascript, grunt"},{"title":"Functional Programming in JavaScript","author":"Dan Mantyla","image_url":"http://books.google.com/books/content?id=HuXuBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Functional Programming in JavaScript.pdf","publisher":"Packt Publishing Ltd","copywrite":"2015-03-25","description":"If you are a JavaScript developer interested in learning functional programming, looking for the quantum leap towards mastering the JavaScript language, or just want to become a better programmer in general, then this book is ideal for you. It is aimed at programmers involved in developing reactive frontend apps, server-side apps that wrangle with reliability and concurrency, and everything in between.","tag_list":"javascript"},{"title":"Getting Started with Meteor JavaScript Framework","author":"Isaac Strack","image_url":"http://books.google.com/books/content?id=PTn2QeLMRNcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Getting Started with Meteor.js JavaScript Framework.pdf","publisher":"Packt Publishing Ltd","copywrite":"2012-01-01","description":"Written in an engaging, easy-to-follow style, \"Getting Started with Meteor\" is a practical guide for developing modern web applications with Meteor. This book is for developers or students who have a working knowledge of JavaScript and HTML, and want to learn how to quickly develop web applications using pure JavaScript. A basic understanding of traditional web server development and database methodologies will be helpful, but not necessary. Readers are expected to know how to program basic HTML pages and JavaScript functions, and be familiar with Terminal (basic Shell) commands.","tag_list":"javascript"},{"title":"Getting Mean With Mongo, Express, Angular, and Node","author":"Simon Holmes","image_url":"http://books.google.com/books/content?id=GXzZoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"getting-mean-with-mongo-express-angular-and-node.epub","publisher":"Manning Publications Company","copywrite":"2015-05-01","description":"Traditional web dev stacks can require different programming languages for every layer, creating a complex mashup of code and frameworks. Together, the MongoDB database, the Express and AngularJS web application frameworks, and Node.js on the server-side constitute the MEAN stack, a powerful web development platform that uses JavaScript top to bottom. Developers love it because they need only one programming language for the whole stack. Business owners love it because the open source technologies in the MEAN stack are scalable and cost effective. Most importantly, end users love it because your web apps are fast and responsive. It's a win-win-win! Getting MEAN with Mongo, Express, Angular, and Node shows readers how to develop web applications end-to-end using the MEAN stack. It systematically discusses each technology in the MEAN stack helping to build up an application one layer at a time, just as in a real project. First, it tackles creating a skeleton of a static site in Express and Node, and pushing it up to a live web server. Next, it looks at the MongoDB database and how to build an API for an application. Finally, it rolls out Angular to handle data manipulation and application logic in the browser, demonstrating the payoff for organizing the back-end code properly. By the end of the book, readers will have all the skill—and code—needed to build a dynamic data-driven web application on the MEAN stack. Purchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.","tag_list":"mongo, express, angular"},{"title":"Google App Engine Java and GWT Application Development","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"Google_App_Engine_Java_and_GWT_Application_Development.pdf"},{"title":"getting mean with mongo express angular and node","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"getting-mean-with-mongo-express-angular-and-node.pdf"},{"title":"Head First Android Development","author":"Dawn Griffiths, David Griffiths","image_url":"http://books.google.com/books/content?id=8UvrCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Head First Android Development.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2015-06-17","description":"What will you learn from this book? If you have an idea for a killer Android app, this book will help you build your first working application in a jiffy. You’ll learn hands-on how to structure your app, design interfaces, create a database, make your app work on various smartphones and tablets, and much more. It’s like having an experienced Android developer sitting right next to you! All you need is some Java know-how to get started. Why does this book look so different? Based on the latest research in cognitive science and learning theory, Head First Android Development uses a visually rich format to engage your mind, rather than a text-heavy approach that puts you to sleep. Why waste your time struggling with new concepts? This multi-sensory learning experience is designed for the way your brain really works."},{"title":"Hacking VoIP","author":"Himanshu Dwivedi","image_url":"http://books.google.com/books/content?id=HrX9bWf4YD8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Hacking VoIP.epub","publisher":"No Starch Press","copywrite":"2009","description":"Voice over Internet Protocol (VoIP) networks, the technology used to place phone calls through the Internet, suffer from the same security holes as standard IP networks. This book reviews the many possible VoIP attacks, and discusses the best defenses against them."},{"title":"Head First C#","author":"Andrew Stellman, Jennifer Greene","image_url":"http://books.google.com/books/content?id=dewmNEwiv4sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Head First C#, 3rd Edition - Andrew Stellman, Jennifer Green.epub","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2010-05-18","description":"This book covers C♯ & .NET 4.0 and Visual Studio 2010, and teaches everything from inheritance to serialization.--[book cover]."},{"title":"Head First C#, 3rd Edition","author":"Andrew Stellman, Jennifer Greene","image_url":"http://books.google.com/books/content?id=dewmNEwiv4sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Head First C#, 3rd Edition - Andrew Stellman, Jennifer Green.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2010-05-18","description":"This book covers C♯ & .NET 4.0 and Visual Studio 2010, and teaches everything from inheritance to serialization.--[book cover]."},{"title":"Head First HTML and CSS","author":"Elisabeth Robson, Eric Freeman","image_url":"http://books.google.com/books/content?id=UPNsu2fMXzkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Head First HTML and CSS, 2nd Edition.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2012-08-16","description":"Tired of reading HTML books that only make sense after you're an expert? Then it's about time you picked up Head First HTML and really learned HTML. You want to learn HTML so you can finally create those web pages you've always wanted, so you can communicate more effectively with friends, family, fans, and fanatic customers. You also want to do it right so you can actually maintain and expand your web pages over time so they work in all browsers and mobile devices. Oh, and if you've never heard of CSS, that's okay--we won't tell anyone you're still partying like it's 1999--but if you're going to create web pages in the 21st century then you'll want to know and understand CSS. Learn the real secrets of creating web pages, and why everything your boss told you about HTML tables is probably wrong (and what to do instead). Most importantly, hold your own with your co-worker (and impress cocktail party guests) when he casually mentions how his HTML is now strict, and his CSS is in an external style sheet. With Head First HTML, you'll avoid the embarrassment of thinking web-safe colors still matter, and the foolishness of slipping a font tag into your pages. Best of all, you'll learn HTML and CSS in a way that won't put you to sleep. If you've read a Head First book, you know what to expect: a visually-rich format designed for the way your brain works. Using the latest research in neurobiology, cognitive science, and learning theory, this book will load HTML and CSS into your brain in a way that sticks. So what are you waiting for? Leave those other dusty books behind and come join us in Webville. Your tour is about to begin."},{"title":"Head First HTML5 Programming","author":"Eric Freeman, Elisabeth Robson","image_url":"http://books.google.com/books/content?id=xXMrAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Head First HTML5 Programming.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2011-10-06","description":"HTML has been on a wild ride. Sure, HTML started as a mere markup language, but more recently HTML’s put on some major muscle. Now we’ve got a language tuned for building web applications with Web storage, 2D drawing, offline support, sockets and threads, and more. And to speak this language you’ve got to go beyond HTML5 markup and into the world of the DOM, events, and JavaScript APIs. Now you probably already know all about HTML markup (otherwise known as structure) and you know all aboutCSS style (presentation), but what you’ve been missing is JavaScript (behavior). If all you know about are structure and presentation, you can create some great looking pages, but they’re still just pages. When you add behavior with JavaScript, you can create an interactive experience; even better, you can create full blown web applications. Head First HTML5 Programming is your ultimate tour guide to creating web applications with HTML5 and JavaScript, and we give you everything you need to know to build them, including: how to add interactivity to your pages, how to communicate with the world of Web services, and how to use the great new APIs being developed for HTML5. Here are just some of the things you’ll learn in Head First HTML5 Programing: Learn how to make your pages truly interactive by using the power of the DOM. Finally understand how JavaScript works and take yourself from novice to well-informed in just a few chapters. Learn how JavaScript APIs fit into the HTML5 ecosystem, and how to use any API in your web pages. Use the Geolocation API to know where your users are. Bring out your inner artist with Canvas, HTML5’s new 2D drawing surface. Go beyond just plugging a video into your pages, and create custom video experiences. Learn the secret to grabbing five megabytes of storage in every user’s browser. Improve your page’s responsiveness and performance with Web workers. And much more."},{"title":"Head First JavaScript","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"Head First JavaScript.pdf"},{"title":"High Performance JavaScript","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"High Performance JavaScript.pdf"},{"title":"HTML5 and JavaScript Web Apps","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"HTML5 and JavaScript Web Apps.pdf"},{"title":"HTML5 Cookbook","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"HTML5 Cookbook.pdf"},{"title":"HTML5 Canvas Cookbook","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"HTML5 Canvas Cookbook.pdf"},{"title":"HTML5 Programmer's Reference","author":"Jonathan Reid","image_url":"http://books.google.com/books/content?id=CU8nCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"HTML5 Programmer's Reference.pdf","publisher":"Apress","copywrite":"2015-07-10","description":"The HTML5 Programmer’s Reference aims to provide everything a programmer needs for understanding and using the new HTML5 family of standards. Previous HTML standards were focused on defining tags for marking up documents. The HTML5 family of standards not only includes new semantic tags but also defines exciting new JavaScript APIs that can be used to build rich, interactive web applications for both mobile and desktop platforms. The HTML5 Programmer’s Reference focuses on providing real-world non-trivial examples to demonstrate concepts. Chapters include both in-depth discussions and full references for all HTML5 features, as well as extras like how to find the standards, the history of their evolution, and other examples and helpful resources. With this book the reader will learn everything they need to know to build the next generation of web applications."},{"title":"Html5 Web Application Development by Example Beginner's Guide","author":"J. M. Gustafson","image_url":"http://books.google.com/books/content?id=ZB6tQPuw19oC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"HTML5 Web Application Development By Example.pdf","publisher":"Packt Publishing Ltd","copywrite":"2013-01-01","description":"The best way to learn anything is by doing. The author uses a friendly tone and fun examples to ensure that you learn the basics of application development. Once you have read this book, you should have the necessary skills to build your own applications.If you have no experience but want to learn how to create applications in HTML5, this book is the only help you'll need. Using practical examples, HTML5 Web Application Development by Example will develop your knowledge and confidence in application development."},{"title":"HTML5 Developer's Cookbook","author":"Chuck Hudson, Tom Leadbetter","image_url":"http://books.google.com/books/content?id=No4hLcrmvw8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"HTML5 Developer's Cookbook.pdf","publisher":"Addison-Wesley","copywrite":"2011-12-01","description":"2012 Jolt Productivity Award winner! Using HTML5, web developers can create standards-based browser applications with extraordinary richness and power, incorporating everything from drag-and-drop to native audio and video–all without any third-party plug-ins. Simply put, every web developer needs to master HTML5–and the sooner you do so, the greater advantage you’ll have. HTML5 Developer’s Cookbook provides all the expert advice and proven code you need to start building production-quality HTML5 applications right now. Authors Chuck Hudson and Tom Leadbetter present tested, modular recipes at beginner, intermediate, and advanced levels. You’ll learn exactly how to deliver state-of-the-art user experiences by integrating HTML5’s new and enhanced elements with CSS3, multimedia, and JavaScript APIs. Reflecting current standards, this book prioritizes HTML5 features with substantial browser support and identifies the level of browser support for each feature discussed. Coverage includes Understanding and using HTML5’s new structural elements Using grouping, text-level, and redefined semantics Managing browser-handling in HTML5 Leveraging new CSS3 layout and style techniques Maximizing interactivity with HTML5 Web Forms Embedding audio and video with HTML5 Drawing with the canvas Controlling browser histories Integrating location awareness with the Geolocation API Implementing client side storage Working with local files Managing communication and threading Optimizing the HTML5 browser experience Integrating device data Turn to HTML5 Developer’s Cookbook for expert answers, real solutions, and the code required to implement them. It’s all you need to jumpstart any HTML5 project and create rich, high-value web applications your users will love."},{"title":"Porn Star","author":"Zara Cox","image_url":"http://books.google.com/books/content?id=WiQADQAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"I, Porn Star - (I #1) - Zara Cox.epub","publisher":"Hachette UK","copywrite":"2016-09-13","description":"\"An exotically filthy, devastatingly beautiful story that will captivate and tease you long after the book is finished.\" -Audrey Carlan, New York Times bestselling author Previously published as I, Porn Star People call me many things: CEO, billionaire, bastard. Q. I love women. I love sex. I love money. I love hot, wild nights with no promise of a future, because a future is one thing I don't have. I'm twenty-eight years old. I won't live to see thirty, and I don't care. Or I didn't, until her. Nobody plans for a life like this. Some of us just end up here. They call me Lucky, though luck has never been on my side. Before I met Q, my life was a big, twisted mess. Never enough money, never anyone to trust. No way out. With Q, the shame and fear disappear. Instead I feel pure pleasure, and that's something I've never had before. But if what I've just learned is true, we'd better enjoy every second together while we can...before our time runs out."},{"title":"JavaScript Object Programming","author":"Martin Rinehart","image_url":"http://books.google.com/books/content?id=la9PCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"JavaScript Object Programming.pdf","publisher":"Apress","copywrite":"2015-12-30","description":"This brief book explains the advantages of the object model, inheritance, both classical and prototypical, and shows how these concepts can be implemented in JavaScript. It also shows how object programming (OP) opens a new world of design possibilities that go far beyond inheritance. This book will help the intermediate JavaScript programmer learn to use both types of inheritance. For classical inheritance, it is accompanied by a substantial online system (a windowing UI library) that shows classical inheritance at its best. The same system shows how OP \"capabilities\" can eliminate much of the need for inheritance. For experienced JavaScript programmers, this book shows why most of the old views of JavaScript's inheritance have not done it justice. JavaScript classes inherit from JavaScript's prototypes, a fact that makes JavaScript's prototypes, when used correctly, functional equivalents to C++ classes (not to prototypes in true prototypical languages, like Self). JavaScript's object programming (not inheritance) is what separates it from classical OOP languages like C++ and Java. Most important, basing inheritance on JavaScript's prototypal chain is possible, but is not the best choice for prototypal inheritance or classical inheritance. What You'll Learn What are objects, JavaScript objects and object programming What is and how to use inheritance and JavaScript inheritance as well as inheritance alternatives How to design for JavaScript What are and how to use OO principles in JavaScript How to use Constructors with JavaScript and more AudienceThis book is for both intermediate and advanced JavaScript and Web development programmers. However, any programmer will understand the concepts and any JavaScript programmer should understand all of the concepts in this book. The code there is shows examples of the concepts discussed.","tag_list":"javascript"},{"title":"JavaScript Cookbook","author":"Shelley Powers","image_url":"http://books.google.com/books/content?id=vXJpBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"JavaScript Cookbook.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"","description":"Problem solving with JavaScript is a lot trickier now that its use has expanded considerably in size, scope, and complexity. This cookbook has your back, with recipes for common tasks across the JavaScript world, whether you’re working in the browser, the server, or a mobile environment. Each recipe includes reusable code and practical advice for tackling JavaScript objects, Node, Ajax, JSON, data persistence, graphical and media applications, complex frameworks, modular JavaScript, APIs, and many related technologies. Aimed at people who have some experience with JavaScript, the first part covers traditional uses of JavaScript, along with new ideas and improved functionality. The second part dives into the server, mobile development, and a plethora of leading-edge tools. You’ll save time—and learn more about JavaScript in the process. Topics include: Classic JavaScript: Arrays, functions, and the JavaScript Object Accessing the user interface Testing and accessibility Creating and using JavaScript libraries Client-server communication with Ajax Rich, interactive web effects JavaScript, All Blown Up: New ECMAScript standard objects Using Node on the server Modularizing and managing JavaScript Complex JavaScript frameworks Advanced client-server communications Visualizations and client-server graphics Mobile application development"},{"title":"CHECKOUT: JavaScript Regular Expressions","author":"","image_url":"","category_id":10,"type_id":1,"url":"JavaScript Regular Expressions.pdf","publisher":"Unknown","copywrite":"","description":""},{"title":"CHECKOUT:  javascript1pdf","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"javascript1pdf.pdf"},{"title":"John Adams","author":"David McCullough","image_url":"http://books.google.com/books/content?id=s-sTrTHz8oMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"John Adams - David McCullough.epub","publisher":"Simon and Schuster","copywrite":"2012-12-11","description":"A huge bestseller in America, David McCullough's JOHN ADAMS tells the extraordinary story of the brilliant, fiercely independent, often irascible, always honest Yankee patriot -- 'the colossus of independence', as Thomas Jefferson called him -- who spared nothing in his zeal for the American Revolution and who rose to become the second President of the United States. Both a riveting portrait of an abundantly human man and a vivid evocation of his time, JOHN ADAMS has the sweep and vitality of a great novel, taking us from the Boston Massacre to Philadelphia in 1776 to the Versailles of Louis XVI, from Spain to Amsterdam to London, where Adams was the first American to stand before King George III as a representative of the new nation. This is history on a grand scale -- a book about politics and war, but also about human nature, love, faith, virtue, ambition, friendship and betrayal, and the far-reaching consequences of noble ideas. Above all, it is an enthralling, often surprising story of one of the most important and fascinating Americans who ever lived."},{"title":"Joomla! 1.5 Javascript Jquery","author":"Jose Argudo Blanco","image_url":"http://books.google.com/books/content?id=gTJdA3X04toC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Joomla! 1.5 JavaScript jQuery.pdf","publisher":"Packt Publishing Ltd","copywrite":"2010-07-26","description":"Enhance your Joomla! Sites with the power of jQuery extensions, plugins, and more."},{"title":"JQuery: Novice to Ninja","author":"Earle Castledine, Craig Sharkie","image_url":"http://books.google.com/books/content?id=n5kDwCotZ1QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"jQuery- Novice to Ninja.pdf","publisher":"SitePoint","copywrite":"2012","description":"Annotation This compilation of best practice jQuery solutions provides a cookbook of ready-to-go suggestions to help breathe life into any web page. It covers topics such as scrolling, animating, backgrounds, crossfaders, menus, buttons and how to write your own jQuery plug-ins.","tag_list":"jQuery, javascript"},{"title":"CHECKOUT:  Learning the Internet of Things","author":"","image_url":"","category_id":10,"type_id":1,"url":"Learning Internet of Things.pdf","publisher":"Unknown","copywrite":"","description":""},{"title":"CHECKOUT:  Learning JavaScript Design Patterns","author":"Addy Osmani","image_url":"http://books.google.com/books/content?id=JYPEgK-1bZoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Learning JavaScript.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2012-08-20","description":"An introduction to writing code with JavaScript using classical and modern design patterns, including modules, observers, facades, and mediators."},{"title":"Learning JQuery","author":"Jonathan Chaffer, Karl Swedberg","image_url":"http://books.google.com/books/content?id=d_6bPyc5QVcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Learning jQuery, 4th Edition.pdf","publisher":"Packt Publishing Ltd","copywrite":"2011-09-23","description":"Create better interaction, design, and web development with simple JavaScript techniques."},{"title":"HTTP: The Definitive Guide","author":"David Gourley, Brian Totty, Marjorie Sayer, Anshu Aggarwal, Sailu Reddy","image_url":"http://books.google.com/books/content?id=qEoOl9bcV_cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"HTTP_ The Definitive Guide.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2002-09-27","description":"Behind every web transaction lies the Hypertext Transfer Protocol (HTTP) --- the language of web browsers and servers, of portals and search engines, of e-commerce and web services. Understanding HTTP is essential for practically all web-based programming, design, analysis, and administration.While the basics of HTTP are elegantly simple, the protocol's advanced features are notoriously confusing, because they knit together complex technologies and terminology from many disciplines. This book clearly explains HTTP and these interrelated core technologies, in twenty-one logically organized chapters, backed up by hundreds of detailed illustrations and examples, and convenient reference appendices. HTTP: The Definitive Guide explains everything people need to use HTTP efficiently -- including the \"black arts\" and \"tricks of the trade\" -- in a concise and readable manner.In addition to explaining the basic HTTP features, syntax and guidelines, this book clarifies related, but often misunderstood topics, such as: TCP connection management, web proxy and cache architectures, web robots and robots.txt files, Basic and Digest authentication, secure HTTP transactions, entity body processing, internationalized content, and traffic redirection.Many technical professionals will benefit from this book. Internet architects and developers who need to design and develop software, IT professionals who need to understand Internet architectural components and interactions, multimedia designers who need to publish and host multimedia, performance engineers who need to optimize web performance, technical marketing professionals who need a clear picture of core web architectures and protocols, as well as untold numbers of students and hobbyists will all benefit from the knowledge packed in this volume.There are many books that explain how to use the Web, but this is the one that explains how the Web works. Written by experts with years of design and implementation experience, this book is the definitive technical bible that describes the \"why\" and the \"how\" of HTTP and web core technologies. HTTP: The Definitive Guide is an essential reference that no technically-inclined member of the Internet community should be without."},{"title":"CHECKOUT:  Learning Web Design","author":"Jennifer Niederst Robbins","image_url":"http://books.google.com/books/content?id=roaY-4eEWusC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Learning Responsive Web Design.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2007-06-15","description":"Everything you need to know to create professional web sites is right here. Learning Web Design starts from the beginning -- defining how the Web and web pages work -- and builds from there. By the end of the book, you'll have the skills to create multi-column CSS layouts with optimized graphic files, and you'll know how to get your pages up on the Web. This thoroughly revised edition teaches you how to build web sites according to modern design practices and professional standards. Learning Web Design explains: How to create a simple (X)HTML page, how to add links and images Everything you need to know about web standards -- (X)HTML, DTDs, and more Cascading Style Sheets -- formatting text, colors and backgrounds, using the box model, page layout, and more All about web graphics, and how to make them lean and mean through optimization The site development process, from start to finish Getting your pages on the Web -- hosting, domain names, and FTP The book includes exercises to help you to learn various techniques, and short quizzes to make sure you're up to speed with key concepts. If you're interested in web design, Learning Web Design is the place to start."},{"title":"CoffeeScript in Action","author":"Patrick Lee, Nick Marino","image_url":"https://images-na.ssl-images-amazon.com/images/I/41OfOvvm6yL._SX397_BO1,204,203,200_.jpg","category_id":10,"type_id":1,"url":"Manning.CoffeeScript.in.Action.May.2014.pdf","publisher":"Manning","copywrite":"2014","description":"JavaScript runs (almost) everywhere but it can be quirky and awkward. Its cousin CoffeeScript is easier to comprehend and compose. An expressive language, not unlike Ruby or Python, it compiles into standard JavaScript without modification and is a great choice for complex web applications. It runs in any JavaScript-enabled environment and is easy to use with Node.js and Rails.\n\nCoffeeScript in Action teaches you how, where, and why to use CoffeeScript. It immerses you in CoffeeScript's comfortable syntax before diving into the concepts and techniques you need in order to write elegant CoffeeScript programs. Throughout, you'll explore programming challenges that illustrate CoffeeScript's unique advantages. For language junkies, the book explains how CoffeeScript brings idioms from other languages into JavaScript."},{"title":"Maximum PC Specials Volume 2 2016","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"Maximum_PC_Specials_Volume_2_2016.pdf","copywrite":"2016"},{"title":"Maximum PC   PC How to Guide Volume 2 2016","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"Maximum PC - PC How-to Guide Volume 2 2016.pdf","copywrite":"2016"},{"title":"Mastering Responsive Web Design","author":"Ricardo Zea","image_url":"http://books.google.com/books/content?id=y-9wCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Mastering Responsive Web Design with HTML5 and CSS3.pdf","publisher":"Packt Publishing Ltd","copywrite":"2015-08-24","description":"Become a master in RWD with this practical, engaging guide About This Book Build responsive designs with solid yet simple HTML5 and CSS3 best practices Use CSS preprocessors (Sass) to speed up the creation of CSS Each chapter covers a different feature of RWD with carefully chosen, interesting examples, including the latest developments in responsive design Who This Book Is For If you already know some HTML and CSS and understand the principles of responsive web design, this book is for you. There's something here for you to learn regardless of if you're a web designer or web developer, or whether you're a seasoned expert web professional. What You Will Learn Install and use Sass with SCSS syntax to create your CSS Use HTML5 tags the right way for the right type of content Enhance the experience of users with assistive technology with ARIA roles Design with desktop-first approach but implement with mobile-first methodology For your layouts, either create and use your own scalable CSS grid, or use Flexbox Create three types of navigation for small screen devices Find the best way to serve the best type of image and how to make videos responsive Build custom responsive emails to ensure the message gets across regardless of the device In Detail Responsive web design is getting more complex day by day and without the necessary design and development skill sets, it's a matter of time before we're left behind. Building meaningful and accessible websites and apps using HTML5 and CSS3 is a must if we want to create memorable experiences for the users. In the ever-changing world of web designers and developers, being proficient in responsive web design is no longer an option, it is mandatory. Whether you're a web designer or web developer, or a seasoned expert web professional, this book will bolster your HTML and CSS skills to a master level. The book is designed in a way that each chapter will take you one step closer to becoming an expert in RWD. The book begins with introducing you to the power of CSS preprocessors, Sass in this case, to increase the speed of writing repetitive CSS tasks, then use simple but meaningful HTML examples; and add ARIA roles to increase accessibility. You will also understand why a mobile-first approach is ideal. Next, you will learn how to use an easily scalable CSS grid or if you prefer, use Flexbox instead. Create navigations for small screen devices using the “drawer navigation,” “off-canvas” or “toggle” navigation patterns, and also implement images and media in both responsive and responsible ways. Finally, you will build a solid and meaningful typographic scale and make sure your messages and communications display correctly with responsive emails. Style and approach Designing and developing for the web should be fun, and that's the tone used in the book. This book is written in a step-by-step format with clean-cut examples. You will also find tips and notes all over the book to help clarify those small and simple details most books and tutorials assume you already know."},{"title":"MongoDB Cookbook","author":"Amol Nayak","image_url":"http://books.google.com/books/content?id=l8OiBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"MongoDB Cookbook.pdf","publisher":"Packt Publishing Ltd","copywrite":"2014-11-28","description":"If you want a reference to show you practical solutions, or just want to satisfy your need for more knowledge of this fantastic NoSQL database, then this book is ideal for you. To get the most out of this book, you should know the basics of MongoDB."},{"title":"MongoDB Cookbook EPUB","author":"Amol Nayak","image_url":"http://books.google.com/books/content?id=l8OiBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"MongoDB Cookbook.epub","publisher":"Packt Publishing Ltd","copywrite":"2014-11-28","description":"If you want a reference to show you practical solutions, or just want to satisfy your need for more knowledge of this fantastic NoSQL database, then this book is ideal for you. To get the most out of this book, you should know the basics of MongoDB."},{"title":"CHECKOUT: nodejs1","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"nodejs1.pdf"},{"title":"NetBeans IDE 8 Cookbook","author":"David Salter, Rhawi Dantas","image_url":"http://books.google.com/books/content?id=kowZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"NetBeans IDE 8 Cookbook - David Salter.pdf","publisher":"Packt Publishing Ltd","copywrite":"2014-10-27","description":"If you’re a Java developer of any level using NetBeans and want to learn how to get the most out of NetBeans, then this book is for you. Learning how to utilize NetBeans will provide a firm foundation for your Java application development."},{"title":"OpenSSL Cookbook EPUB","author":"Ivan Ristic","image_url":"http://books.google.com/books/content?id=qeGcAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"OpenSSL Cookbook.epub","publisher":"Feisty Duck","copywrite":"2013-10-03","description":"A guide to the most frequently used OpenSSL features and commands, written by Ivan Ristic. Comprehensive coverage of OpenSSL installation, configuration, and key and certificate management Includes SSL/TLS Deployment Best Practices, a design and deployment guide Written by a well-known practitioner in the field and the author of SSL Labs and the SSL/TLS configuration assessment tool Available in a variety of digital formats (PDF, EPUB, Mobi/Kindle); no DRM Continuously updated OpenSSL Cookbook is built around one chapter from Bulletproof SSL/TLS and PKI, a larger work that provides complete coverage of SSL/TLS and PKI topics. To download your free copy in various formats, visit feistyduck.com/books/openssl-cookbook/"},{"title":"Practices of an Agile Developer","author":"Venkat Subramaniam, Andy Hunt","image_url":"http://books.google.com/books/content?id=FLpQAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Practices of an Agile Developer.pdf","copywrite":"2006","description":"\"In this book, we've collected the personal habits, ideas, and approaches of successful agile software developers and compiled them in a series of short, easy-to-digest tips. For each practice, we expose the evil demon's whisperings - the temptations or shortcuts he's trying to get you to take. And then we explain the agile practices that act as a guardian angel to protect your project and your career.\"--BOOK JACKET."},{"title":"OpenSSL Cookbook","author":"Ivan Ristic","image_url":"http://books.google.com/books/content?id=qeGcAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"OpenSSL Cookbook.pdf","publisher":"Feisty Duck","copywrite":"2013-10-03","description":"A guide to the most frequently used OpenSSL features and commands, written by Ivan Ristic. Comprehensive coverage of OpenSSL installation, configuration, and key and certificate management Includes SSL/TLS Deployment Best Practices, a design and deployment guide Written by a well-known practitioner in the field and the author of SSL Labs and the SSL/TLS configuration assessment tool Available in a variety of digital formats (PDF, EPUB, Mobi/Kindle); no DRM Continuously updated OpenSSL Cookbook is built around one chapter from Bulletproof SSL/TLS and PKI, a larger work that provides complete coverage of SSL/TLS and PKI topics. To download your free copy in various formats, visit feistyduck.com/books/openssl-cookbook/"},{"title":"Pragmatic Guide to Javascript","author":"Christophe Porteneuve","image_url":"https://imagery.pragprog.com/products/194/pg_js_xlargecover.jpg?1298589935","category_id":10,"type_id":1,"url":"Pragmatic Guide to JavaScript.pdf","publisher":"Pragmatic Publishing","copywrite":"2010","description":"JavaScript is everywhere. It’s a key component of today’s Web—a powerful, dynamic language with a rich ecosystem of professional-grade development tools, infrastructures, frameworks, and toolkits. This book will get you up to speed quickly and painlessly with the 35 key JavaScript tasks you need to know.","tag_list":"javascript"},{"title":"Pivot - The Art and Science of Reinventing Your Career and Life","author":"Adam Markel","image_url":"http://books.google.com/books/content?id=1lIJCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Pivot - The Art and Science of Reinventing Your Career and Life.epub","publisher":"Simon and Schuster","copywrite":"2016-04-19","description":"The successful CEO of the internationally renowned Peak Potentials—who has trained thousands of people to find new jobs, careers, and directions—shares his practical and inspirational program for reinventing yourself, whether you are out of work or want to change your professional trajectory. What would you do in your life if you knew you could not fail? That’s the question answered in Pivot, a roadmap for embracing your true potential without abandoning your responsibilities or risking your future. As a transformational teacher and the CEO of Peak Potentials, which has trained more than one million people worldwide, Adam Markel can help you leap out of your comfort zone and into the destiny you’ve always dreamed of. Whether you are transitioning your career, or have been downsized, or believe that your true potential has yet to be fully tapped, Pivot is a guide to reinvention for anyone, at any age. With clear-eyed compassion and frank assessments, Adam shares the secrets that will guide you away from fear and toward a powerful new vision for your life. The uplifting stories, introspective prompts, clear step-by-step exercises, and energizing calls to action throughout this remarkable book will guide you through the process of personal and career transformation, from creating a vision and clearing space for change to building a supportive environment and establishing daily rituals that will regenerate your soul. Success and personal fulfillment are within reach! Program your internal GPS to a destination of your wildest imagination—all it takes to change your path is one right turn."},{"title":"Pro JavaScript Design Patterns","author":"Dustin Diaz, Ross Harmes","image_url":"http://books.google.com/books/content?id=za3vlnlWxb0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Pro JavaScript Design Patterns 2007.pdf","publisher":"Apress","copywrite":"2008-03-11","description":"With Pro JavaScript Design Patterns, you’ll start with the basics of object-oriented programming in JavaScript applicable to design patterns, including making JavaScript more expressive, inheritance, encapsulation, information hiding, and more. The book then details how to implement and take advantage of several design patterns in JavaScript. Each chapter is packed with real-world examples of how the design patterns are best used and expert advice on writing better code, as well as what to watch out for. Along the way you’ll discover how to create your own libraries and APIs for even more efficient coding.","tag_list":"javascript"},{"title":"Programming Your Home","author":"Mike Riley","image_url":"http://books.google.com/books/content?id=Bs_RygAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Programming Your Home Automate with Arduino, Android, and Your Computer.pdf","publisher":"Pragmatic Publishing","copywrite":"2012","description":"Presents step-by-step instructions for a variety of home automation projects using Arduino, Android, and a computer, including opening locked doors with a smartphone, remotely monitoring home security, and opening and closing curtains."},{"title":"RESTful Web Services Cookbook","author":"Subbu Allamaraju","image_url":"http://books.google.com/books/content?id=ed5ml0T3zyIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"RESTful Web Services Cookbook.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2010-03-01","description":"Provides information on designing RESTful Web services for client and server applications, covering such topics as Web linking, content negotiation, Web caching, queries, security, and compatibility.","tag_list":"REST"},{"title":"Programming in CoffeeScript","author":"Mark Bates","image_url":"http://books.google.com/books/content?id=FaP-H_URQ2sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Programming in CoffeeScript.pdf","publisher":"Addison-Wesley Professional","copywrite":"2012","description":"Provides information on using CoffeeScript to build applications, covering such topics as syntax, functions, control structures, classes, and Jasmine."},{"title":"Rails, Angular, Postgres, and Bootstrap","author":"David Bryant Copeland","image_url":"https://imagery.pragprog.com/products/448/dcbang_xlargecover.jpg?1437680108","category_id":10,"type_id":1,"url":"Rails, Angular, Postgres, and Bootstrap Powerful, Effective, and Efficient Full-Stack Web Development [-PUNISHER-].pdf","publisher":"Pragmatic Publishing","copywrite":"2016","description":"As a Rails developer, you care about user experience and performance, but you also want simple and maintainable code. Achieve all that by embracing the full stack of web development, from styling with Bootstrap, building an interactive user interface with AngularJS, to storing data quickly and reliably in PostgreSQL. Take a holistic view of full-stack development to create usable, high-performing applications, and learn to use these technologies effectively in a Ruby on Rails environment","tag_list":"rails, angular, bootstrap"},{"title":"CHECKOUT:  Smooth CoffeeScript Web Optimized","author":"","image_url":"","category_id":10,"type_id":1,"url":"Smooth CoffeeScript Web Optimized.pdf","publisher":"Unknown","copywrite":"2012","description":"Free eBook \n\nExplains how to build web applications with CoffeeScript, demonstrates how CoffeeScript abstracts JavaScript, and teaches CoffeeScript's syntax and idioms step by step."},{"title":"Seven More Languages in Seven Weeks","author":"Bruce A. Tate, Ian Dees, Frederic Daoud, Jack Moffitt","image_url":"http://books.google.com/books/content?id=lc-foAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Seven More Languages in Seven Weeks.pdf","publisher":"Pragmatic Publishing","copywrite":"2014-11-29","description":"This book takes you on a step-by-step journey through seven exciting languages: Lua, Factor, Elixir, Elm, Julia, MiniKanren, and Idris. In each language, you'll solve a non-trivial problem, using the techniques that make that language special."},{"title":"SSH, The Secure Shell","author":"Daniel Barrett, Richard Silverman, Robert Byrnes","image_url":"http://books.google.com/books/content?id=3XzIFG3w8-YC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"SSH, The Secure Shell.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2005-05-10","description":"Are you serious about network security? Then check out SSH, the Secure Shell, which provides key-based authentication and transparent encryption for your network connections. It's reliable, robust, and reasonably easy to use, and both free and commercial implementations are widely available for most operating systems. While it doesn't solve every privacy and security problem, SSH eliminates several of them very effectively. Everything you want to know about SSH is in our second edition of SSH, The Secure Shell: The Definitive Guide. This updated book thoroughly covers the latest SSH-2 protocol for system administrators and end users interested in using this increasingly popular TCP/IP-based solution. How does it work? Whenever data is sent to the network, SSH automatically encrypts it. When data reaches its intended recipient, SSH decrypts it. The result is \"transparent\" encryption-users can work normally, unaware that their communications are already encrypted. SSH supports secure file transfer between computers, secure remote logins, and a unique \"tunneling\" capability that adds encryption to otherwise insecure network applications. With SSH, users can freely navigate the Internet, and system administrators can secure their networks or perform remote administration. Written for a wide, technical audience, SSH, The Secure Shell: The Definitive Guide covers several implementations of SSH for different operating systems and computing environments. Whether you're an individual running Linux machines at home, a corporate network administrator with thousands of users, or a PC/Mac owner who just wants a secure way to telnet or transfer files between machines, our indispensable guide has you covered. It starts with simple installation and use of SSH, and works its way to in-depth case studies on large, sensitive computer networks. No matter where or how you're shipping information, SSH, The Secure Shell: The Definitive Guide will show you how to do it securely."},{"title":"Google Hidden Tools","author":"WebUser","image_url":"https://images-na.ssl-images-amazon.com/images/I/61etJ1nYBAL._SX400_BO1,204,203,200_.jpg","category_id":10,"type_id":1,"url":"The Definitive Guide to Google Hidden Tools.pdf","publisher":"Robert Irvine","copywrite":"2014","description":"In The Definitive Guide to Google Hidden Tools, the experts at Web User and Computeractive lift the lid on Google s most popular tools to reveal more than 430 ways to make them even more efficient, useful and tailored to your needs. These include clever new add-ons for Chrome, amazing free apps for Android and stunning sights in Google Maps, as well as secret tips for Gmail, Drive, YouTube and many more. The wonderful thing about Google is that there are always new tricks to learn and, once you've discovered them, you'll use them every day."},{"title":"The Mindful Geek","author":"Michael Taft","image_url":"http://books.google.com/books/content?id=nDcqjgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"The Mindful Geek - Secular Meditation for Smart Skeptics - Michael W Taft - [N27].epub","publisher":"Cephalopod Rex","copywrite":"2015-09-14","description":"The Mindful Geek tells you how to derive the real world benefits of hardcore mindfulness meditation without drinking the metaphysical Kool-Aid. Meditation teacher, Michael W. Taft gives you step-by-step instructions in the powerful and reliable techniques of mindfulness meditation, and outlines the psychological and neuroscientific research underpinning these practices. By treating mindfulness as a scientifically-based, psychological technique, you can keep your atheistic or agnostic secular skepticism and still maintain a powerful, regular, and deeply effective meditation practice. That's because meditation doesn't require you to believe in it to work. Like any good technology, if you use it correctly, it will do the job reliably whether you believe in it or not. And-make no mistake-meditation is a kind of technology; a technology for hacking the human wetware in order to improve your life. This book is a practical, hands-on manual about how to make the most of that technology for yourself. If you are smart, skeptical, technically-inclined, and have a desire to see what meditation is really all about, this book is for you. Michael has taught a lot of meditation programs at tech corporations like Google, so this material has been field-tested on some world-class geeks."},{"title":"The Pornography Industry","author":"Shira Tarrant","image_url":"http://books.google.com/books/content?id=-4WICwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"The Pornography Industry - What Everyone Needs to Know (2016).pdf","publisher":"Oxford University Press","copywrite":"2016-03-01","description":"We may know pornography when we see it, but the business of pornography is a surprisingly elusive subject. Reliable figures about the industry are difficult to come by and widely disputed, but one matter that is hardly debatable is that pornography is a major and ubiquitous enterprise. Porn allegedly accounts for one-third of all internet traffic currently, though the data about actual consumption is unclear. Reports in recent years have suggested that 70 million individuals visit porn sites every week; that among viewers aged 18-24, women watch more porn than men; and that among middle-aged, white-collar workers, three-quarters of men and half of women have admitted to looking at pornography websites while at work. While debates and emotions around porn can run high, there is a crucial need for reliable information and rational conversation. In this book, Shira Tarrant parses the wide range of statistics that we have on the pornography industry, sorting myth from reality in an objective, fascinating and knowledgeable fashion. She looks at ongoing political controversies around the industry, the feminist porn wars, the views of the religious right, the history of pornography, landmark legal cases, and the latest in medical research. The Pornography Industry also explains the industry basics -who works in porn, why people become performers, how much they earn, and what happens on a porn set. It further delves into important questions such as: how many teenagers watch porn and should we worry about it? What is porn piracy and can it be stopped? What can the industry do about sexist and racist pornography? Does porn cause violence against women? Can people become addicted to porn? Is watching porn the same as infidelity? By presenting competing perspectives in an even-handed way, The Pornography Industry will enable readers to explore these provocative issues and make their own best decisions about the debates."},{"title":"The Social Media Job Search Workbook","author":"Joshua Waldman","image_url":"http://books.google.com/books/content?id=mXhLrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"The Social Media Job Search Workbook.epub","publisher":"CreateSpace","copywrite":"2015-02-16","description":"You've probably heard that social media can make or break your search for a job. But exactly how do you conduct an effective social media job search? Where do you turn for the best job search advice? What does it take to find a job today? Joshua Waldman knows. He wrote the popular book Job Searching with Social Media For Dummies. And now he has created this workbook, The Social Media Job Search Workbook. What can this workbook help you accomplish? - Get interviews faster - Attract recruiters - Increase your chances of finding meaningful work in record time Why a workbook? Because landing your dream job takes more than knowledge--it takes action. This workbook's friendly format helps you translate valuable knowledge into invaluable action based on your unique skills, interests, and appeal to employers. Waldman takes the worry out of the process as he guides you through the right steps in the right order, from positioning to polishing to publishing. He shares his proven process for crafting a job-attracting message that works for the online audience you want to reach. Waldman's tips on using today's tools--especially LinkedIn, Facebook, and Twitter--will give you the confidence and clarity you need to fine-tune your own powerful social media job search."},{"title":"CSS: The Ultimate Reference","author":"Tommy Olsson, Paul O'Brien","image_url":"https://images-eu.ssl-images-amazon.com/images/I/41B+Oo2jyeL._AC_US160_.jpg","category_id":10,"type_id":1,"url":"The Ultimate CSS Reference.pdf","publisher":"SitePoint","copywrite":"2008","description":"Stop wasting time doing Internet searches only to find inaccurate, out-of-date, or incomplete information. CSS: The Ultimate Reference includes all the ins-and-outs you need to know including compatability information for all major browsers, lists of useful hacks, known bugs in CSS, and much more - all presented in a beautiful, full color layout that will have you coming back over and over again.\n\nCoverage includes:\n\n\n•CSS 2.1 syntax and specifications, including features from current CSS 3 working drafts that are implemented in one or more major browsers (IE, Firefox, Safari, Opera), and useful browser-specific features\n•A clear and concise guide to the CSS cascade, including compatability information, known bugs and useful CSS hacks\n•A media type guide, with coverage of which media types apply in which user agents under what conditions.\n•A quick-reference guide to currently supported at-rules (@import, @media, etc.).\n•An alphabetical property reference","tag_list":"css, html"},{"title":"Tomcat: The Definitive Guide","author":"Jason Brittain, Ian F. Darwin","image_url":"http://books.google.com/books/content?id=iMD1j6GHgWsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Tomcat- The Definitive Guide, 2nd Edition.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2003-06-13","description":"Jakarta Tomcat is not only the most commonly used open source servlet engine today, it's become the de facto standard by which other servlet engines are measured. Powerful and flexible, it can be used as a stand-alone web server or in conjunction with another server, like Apache or IIS, to run servlets or JSPs. But mastery of Tomcat is not easy: because it's as complex as it is complete. Tomcat: The Definitive Guide answers vexing questions that users, administrators, and developers alike have been asking. This concise guide provides much needed information to help harness Tomcat's power and wealth of features.Tomcat: The Definitive Guide offers something for everyone who uses Tomcat. System and network administrators will find detailed instructions on installation, configuration, and maintenance. For users, it supplies insightful information on how to deploy Tomcat. And seasoned enterprise Java developers will have a complete reference to setting up, running, and using this powerful softwareThe book begins with an introduction to the Tomcat server and includes an overview of the three types of server configurations: stand-alone, in-process, and out-of-process. The authors show how directories are laid out, cover the initial setup, and describe how to set the environment variables and modify the configuration files, concluding with common errors, problems, and solutions. In subsequent chapters, they cover: The server.xml configuration file Java Security manager Authentication schemes and Tomcat users The Secure Socket Layer (SSL) Tomcat JDBC Realms Installing servlets and Java Server Pages Integrating Tomcat with Apache Advanced Tomcat configuration and much more.Tomcat: The Definitive Guide covers all major platforms, including Windows, Solaris, Linux, and Mac OS X, contains details on Tomcat configuration files, and has a quick-start guide to get developers up and running with Java servlets and JavaServer Pages. If you've struggled with this powerful yet demanding technology in the past, this book will provide the answers you need.","tag_list":"tomcat"},{"title":"Twitter API: Up and Running","author":"Kevin Makice","image_url":"http://books.google.com/books/content?id=kBXXZNcRCGcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Twitter API- Up and Running.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2009-03-17","description":"This groundbreaking book provides you with the skills and resources necessary to build web applications for Twitter. Perfect for new and casual programmers intrigued by the world of microblogging, Twitter API: Up and Running carefully explains how each part of Twitter's API works, with detailed examples that show you how to assemble those building blocks into practical and fun web applications. You'll also get a complete look at Twitter culture and learn how it has inspired programmers to build hundreds of tools and applications. With this book, you will: Explore every component of a Twitter application and learn how the API responds Get the PHP and MySQL code necessary to build your own applications, with explanations of how these ingredients work Learn from real-world Twitter applications created just for this book Discover the most interesting and useful Twitter programs--and get ideas for creating your own--with the book's Twitter application directory Twitter offers a new way to connect with people on the Internet, and Twitter API: Up and Running takes you right to the heart of this technology. \"Twitter API: Up and Running is a friendly, accessible introduction to the Twitter API. Even beginning web developers can have a working Twitter project before they know it. Sit down with this for a weekend and you're on your way to Twitter API mastery.\"--Alex Payne, Twitter API Lead \"Twitter API: Up and Running is a very comprehensive and useful resource--any developer will feel the urge to code a Twitter-related application right after finishing the book!\"--The Lollicode team, creators of Twitscoop"},{"title":"Ubuntu Hacks","author":"Jonathan Oxer, Kyle Rankin, Bill Childers","image_url":"http://books.google.com/books/content?id=HZ37FT3unW8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ubuntu Hacks.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2006-06-14","description":"Ubuntu Linux--the most popular Linux distribution on the planet--preserves the spirit embodied in the ancient African word ubuntu, which means both \"humanity to others\" and \"I am what I am because of who we all are.\" Ubuntu won the Linux Journal Reader's Choice Award for best Linux distribution and is consistently the top-ranked Linux variant on DistroWatch.com. The reason this distribution is so widely popular is that Ubuntu is designed to be useful, usable, customizable, and always available for free worldwide. Ubuntu Hacks is your one-stop source for all of the community knowledge you need to get the most out of Ubuntu: a collection of 100 tips and tools to help new and experienced Linux users install, configure, and customize Ubuntu. With this set of hacks, you can get Ubuntu Linux working exactly the way you need it to. Learn how to: Install and test-drive Ubuntu Linux. Keep your system running smoothly Turn Ubuntu into a multimedia powerhouse: rip and burn discs, watch videos, listen to music, and more Take Ubuntu on the road with Wi-Fi wireless networking, Bluetooth, etc. Hook up multiple displays and enable your video card's 3-D acceleration Run Ubuntu with virtualization technology such as Xen and VMware Tighten your system's security Set up an Ubuntu-powered server Ubuntu Hacks will not only show you how to get everything working just right, you will also have a great time doing it as you explore the powerful features lurking within Ubuntu. \"Put in a nutshell, this book is a collection of around 100 tips and tricks which the authors choose to call hacks, which explain how to accomplish various tasks in Ubuntu Linux. The so called hacks range from down right ordinary to the other end of the spectrum of doing specialised things...More over, each and every tip in this book has been tested by the authors on the latest version of Ubuntu (Dapper Drake) and is guaranteed to work. In writing this book, it is clear that the authors have put in a lot of hard work in covering all facets of configuring this popular Linux distribution which makes this book a worth while buy.\" -- Ravi Kumar, Slashdot.org","tag_list":"hacks"},{"title":"Web Development with Node and Express","author":"Ethan Brown","image_url":"http://books.google.com/books/content?id=HsLvAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Web Development with Node and Express - Ethan Brown.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2014-07-01","description":"Learn how to build dynamic web applications with Express, a key component of the Node/JavaScript development stack. In this hands-on guide, author Ethan Brown teaches you the fundamentals through the development of a fictional application that exposes a public website and a RESTful API. You’ll also learn web architecture best practices to help you build single-page, multi-page, and hybrid web apps with Express. Express strikes a balance between a robust framework and no framework at all, allowing you a free hand in your architecture choices. With this book, frontend and backend engineers familiar with JavaScript will discover new ways of looking at web development. Create webpage templating system for rendering dynamic data Dive into request and response objects, middleware, and URL routing Simulate a production environment for testing and development Focus on persistence with document databases, particularly MongoDB Make your resources available to other programs with RESTful APIs Build secure apps with authentication, authorization, and HTTPS Integrate with social media, geolocation, and other third-party services Implement a plan for launching and maintaining your app Learn critical debugging skills This book covers Express 4.0."},{"title":"RESTful Web Services","author":"Leonard Richardson, Sam Ruby","image_url":"http://books.google.com/books/content?id=XUaErakHsoAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"RESTful Web Services.pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2008-12-17","description":"\"Every developer working with the Web needs to read this book.\" -- David Heinemeier Hansson, creator of the Rails framework \"RESTful Web Services finally provides a practical roadmap for constructing services that embrace the Web, instead of trying to route around it.\" -- Adam Trachtenberg, PHP author and EBay Web Services Evangelist You've built web sites that can be used by humans. But can you also build web sites that are usable by machines? That's where the future lies, and that's what RESTful Web Services shows you how to do. The World Wide Web is the most popular distributed application in history, and Web services and mashups have turned it into a powerful distributed computing platform. But today's web service technologies have lost sight of the simplicity that made the Web successful. They don't work like the Web, and they're missing out on its advantages. This book puts the \"Web\" back into web services. It shows how you can connect to the programmable web with the technologies you already use every day. The key is REST, the architectural style that drives the Web. This book: Emphasizes the power of basic Web technologies -- the HTTP application protocol, the URI naming standard, and the XML markup language Introduces the Resource-Oriented Architecture (ROA), a common-sense set of rules for designing RESTful web services Shows how a RESTful design is simpler, more versatile, and more scalable than a design based on Remote Procedure Calls (RPC) Includes real-world examples of RESTful web services, like Amazon's Simple Storage Service and the Atom Publishing Protocol Discusses web service clients for popular programming languages Shows how to implement RESTful services in three popular frameworks -- Ruby on Rails, Restlet (for Java), and Django (for Python) Focuses on practical issues: how to design and implement RESTful web services and clients This is the first book that applies the REST design philosophy to real web services. It sets down the best practices you need to make your design a success, and the techniques you need to turn your design into working code. You can harness the power of the Web for programmable applications: you just have to work with the Web instead of against it. This book shows you how."},{"title":"Smashing CoffeeScript","author":"Alex Hudson","image_url":"http://books.google.com/books/content?id=eMpFqoIEMJEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Wiley.Smashing.CoffeeScript.Apr.2013.pdf","publisher":"John Wiley & Sons","copywrite":"2013-03-29"},{"title":"Beginning Spring","author":"Mert Caliskan,   Kenan Sevindik","image_url":"https://images-eu.ssl-images-amazon.com/images/I/51vyrFS3usL._AC_US160_.jpg","category_id":10,"type_id":1,"url":"Wrox.Beginning.Spring.1118892925.pdf","publisher":"Wrox","copywrite":"2015","description":"Beginning Spring is the complete beginner′s guide to Java′s most popular framework. Written with an eye toward real–world enterprises, the book covers all aspects of application development within the Spring Framework. Extensive samples within each chapter allow developers to get up to speed quickly by providing concrete references for experimentation, building a skillset that drives successful application development by exploiting the full capabilities of Java′s latest advances.\n\nSpring provides the exact toolset required to build an enterprise application, and has become the standard within the field. This book covers Spring 4.0, which contains support for Java 8 and Java EE 7. Readers begin with the basics of the framework, then go on to master the most commonly used tools and fundamental concepts inherent in any Spring project. The book emphasizes practicality and real–world application by addressing needs such as meeting customer demand and boosting productivity, and by providing actionable information that helps developers get the most out of the framework. Topics include:\n•Dependency Injection and Inversion of Control\n•Unit testing Spring enabled Web Applications \n•Data Access using Spring JDBC and ORM support along with Transaction Management\n•Building Web Applications and RESTful Web Services with Spring MVC\n•Securing Web Applications using Spring Security\n•Spring Expression Language with its Extensive Features\n•Aspect Oriented Programming Facilities Provided by Spring AOP\n•Caching with 3rd Party Cache Providers Support"},{"title":"The Rails Way","author":"Obie Fernandez","image_url":"http://books.google.com/books/content?id=vfZmmAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321445619 {77B5968B} The Rails Way [Fernandez 2007-11-26].pdf","publisher":"Addison-Wesley Professional","copywrite":"2007","description":"Provides information on the capabilities and subsystems of Rails for the design and development of production-quality software."},{"title":"Programming Ruby","author":"David Thomas, Andrew Hunt","image_url":"http://books.google.com/books/content?id=2LulngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0201710897 {E9969BE4} Programming Ruby_ The Pragmatic Programmer's Guide [Thomas & Hunt 2000-12-15].pdf","publisher":"Pragmatic Publishing","copywrite":"2000-12-15","description":"Classic Pick Axe book"},{"title":"Ruby on Rails Tutorial","author":"Michael Hartl","image_url":"http://books.google.com/books/content?id=pShDnvE6sJ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0134077709 {CB79A2AE} Ruby on Rails Tutorial_ Learn Web Development with Rails (3rd ed.) [Hartl 2015-05-11].pdf","publisher":"Addison-Wesley","copywrite":"2012-07-27","description":"“Ruby on Rails™ Tutorial by Michael Hartl has become a must-read for developers learning how to build Rails apps.” —Peter Cooper, Editor of Ruby Inside Using Rails, developers can build web applications of exceptional elegance and power. Although its remarkable capabilities have made Ruby on Rails one of the world’s most popular web development frameworks, it can be challenging to learn and use. Ruby on Rails™ Tutorial, Second Edition, is the solution. Best-selling author and leading Rails developer Michael Hartl teaches Rails by guiding you through the development of your own complete sample application using the latest techniques in Rails web development. The updates to this edition include all-new site design using Twitter’s Bootstrap; coverage of the new asset pipeline, including Sprockets and Sass; behavior-driven development (BDD) with Capybara and RSpec; better automated testing with Guard and Spork; roll your own authentication with has_secure_password; and an introduction to Gherkin and Cucumber. You’ll find integrated tutorials not only for Rails, but also for the essential Ruby, HTML, CSS, JavaScript, and SQL skills you’ll need when developing web applications. Hartl explains how each new technique solves a real-world problem, and he demonstrates this with bite-sized code that’s simple enough to understand, yet novel enough to be useful. Whatever your previous web development experience, this book will guide you to true Rails mastery. This book will help you Install and set up your Rails development environment Go beyond generated code to truly understand how to build Rails applications from scratch Learn test-driven development (TDD) with RSpec Effectively use the Model-View-Controller (MVC) pattern Structure applications using the REST architecture Build static pages and transform them into dynamic ones Master the Ruby programming skills all Rails developers need Define high-quality site layouts and data models Implement registration and authentication systems, including validation and secure passwords Update, display, and delete users Add social features and microblogging, including an introduction to Ajax Record version changes with Git and share code at GitHub Simplify application deployment with Heroku"},{"title":"Design Patterns in Ruby","author":"Russ Olsen","image_url":"http://books.google.com/books/content?id=QWOWqHANWoAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321490452 {1C5C690D} Design Patterns in Ruby [Olsen 2007-12-20].pdf","publisher":"Pearson Education","copywrite":"2007-12-10","description":"Praise for Design Patterns in Ruby \" Design Patterns in Ruby documents smart ways to resolve many problems that Ruby developers commonly encounter. Russ Olsen has done a great job of selecting classic patterns and augmenting these with newer patterns that have special relevance for Ruby. He clearly explains each idea, making a wealth of experience available to Ruby developers for their own daily work.\" —Steve Metsker, Managing Consultant with Dominion Digital, Inc. \"This book provides a great demonstration of the key 'Gang of Four' design patterns without resorting to overly technical explanations. Written in a precise, yet almost informal style, this book covers enough ground that even those without prior exposure to design patterns will soon feel confident applying them using Ruby. Olsen has done a great job to make a book about a classically 'dry' subject into such an engaging and even occasionally humorous read.\" —Peter Cooper \"This book renewed my interest in understanding patterns after a decade of good intentions. Russ picked the most useful patterns for Ruby and introduced them in a straightforward and logical manner, going beyond the GoF's patterns. This book has improved my use of Ruby, and encouraged me to blow off the dust covering the GoF book.\" —Mike Stok \" Design Patterns in Ruby is a great way for programmers from statically typed objectoriented languages to learn how design patterns appear in a more dynamic, flexible language like Ruby.\" —Rob Sanheim, Ruby Ninja, Relevance Most design pattern books are based on C++ and Java. But Ruby is different—and the language's unique qualities make design patterns easier to implement and use. In this book, Russ Olsen demonstrates how to combine Ruby's power and elegance with patterns, and write more sophisticated, effective software with far fewer lines of code. After reviewing the history, concepts, and goals of design patterns, Olsen offers a quick tour of the Ruby language—enough to allow any experienced software developer to immediately utilize patterns with Ruby. The book especially calls attention to Ruby features that simplify the use of patterns, including dynamic typing, code closures, and \"mixins\" for easier code reuse. Fourteen of the classic \"Gang of Four\" patterns are considered from the Ruby point of view, explaining what problems each pattern solves, discussing whether traditional implementations make sense in the Ruby environment, and introducing Ruby-specific improvements. You'll discover opportunities to implement patterns in just one or two lines of code, instead of the endlessly repeated boilerplate that conventional languages often require. Design Patterns in Ruby also identifies innovative new patterns that have emerged from the Ruby community. These include ways to create custom objects with metaprogramming, as well as the ambitious Rails-based \"Convention Over Configuration\" pattern, designed to help integrate entire applications and frameworks. Engaging, practical, and accessible, Design Patterns in Ruby will help you build better software while making your Ruby programming experience more rewarding."},{"title":"RailsSpace","author":"Michael Hartl, Aurelius Prochazka","image_url":"http://books.google.com/books/content?id=by4hRUMZzJgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321480791 {E5FB39D4} RailsSpace_ Building a Social Networking Website with Ruby on Rails [Hartl & Prochazka 2007-07-30].pdf","publisher":"Addison-Wesley Professional","copywrite":"2007-07-20","description":"Ruby on Rails is fast displacing PHP, ASP, and J2EE as the development framework of choice for discriminating programmers, thanks to its elegant design and emphasis on practical results. RailsSpace teaches you to build large-scale projects with Rails by developing a real-world application: a social networking website like MySpace, Facebook, or Friendster. Inside, the authors walk you step by step from the creation of the site's virtually static front page, through user registration and authentication, and into a highly dynamic site, complete with user profiles, image upload, email, blogs, full-text and geographical search, and a friendship request system. In the process, you learn how Rails helps you control code complexity with the model-view-controller (MVC) architecture, abstraction layers, automated testing, and code refactoring, allowing you to scale up to a large project even with a small number of developers. This essential introduction to Rails provides A tutorial approach that allows you to experience Rails as it is actually used A solid foundation for creating any login-based website in Rails Coverage of newer and more advanced Rails features, such as form generators, REST, and Ajax (including RJS) A thorough and integrated introduction to automated testing The book's companion website provides the application source code, a blog with follow-up articles, narrated screencasts, and a working version of the RailSpace social network."},{"title":"Eloquent Ruby","author":"Russ Olsen","image_url":"http://books.google.com/books/content?id=-s2xL0pVsLUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321584104 {F40D7DDB} Eloquent Ruby [Olsen 2011-02-21].pdf","publisher":"Addison-Wesley Professional","copywrite":"2011-02-07","description":"It’s easy to write correct Ruby code, but to gain the fluency needed to write great Ruby code, you must go beyond syntax and absorb the “Ruby way” of thinking and problem solving. In Eloquent Ruby, Russ Olsen helps you write Ruby like true Rubyists do–so you can leverage its immense, surprising power. Olsen draws on years of experience internalizing the Ruby culture and teaching Ruby to other programmers. He guides you to the “Ah Ha!” moments when it suddenly becomes clear why Ruby works the way it does, and how you can take advantage of this language’s elegance and expressiveness. Eloquent Ruby starts small, answering tactical questions focused on a single statement, method, test, or bug. You’ll learn how to write code that actually looks like Ruby (not Java or C#); why Ruby has so many control structures; how to use strings, expressions, and symbols; and what dynamic typing is really good for. Next, the book addresses bigger questions related to building methods and classes. You’ll discover why Ruby classes contain so many tiny methods, when to use operator overloading, and when to avoid it. Olsen explains how to write Ruby code that writes its own code–and why you’ll want to. He concludes with powerful project-level features and techniques ranging from gems to Domain Specific Languages. A part of the renowned Addison-Wesley Professional Ruby Series, Eloquent Ruby will help you “put on your Ruby-colored glasses” and get results that make you a true believer."},{"title":"Refactoring in Ruby","author":"William C. Wake, Kevin Rutherford","image_url":"http://books.google.com/books/content?id=WCgScbhKZYgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321545044 {90B869A0} Refactoring in Ruby [Wake & Rutherford 2009-10-25].pdf","publisher":"Pearson Education","copywrite":"2009-10-15","description":"The First Hands-On, Practical, All-Ruby Refactoring Workbook! Refactoring—the art of improving the design of existing code—has taken the world by storm. So has Ruby. Now, for the first time, there’s a refactoring workbook designed from the ground up for the dynamic Ruby language. Refactoring in Ruby gives you all the realistic, hands-on practice you need to refactor Ruby code quickly and effectively. You’ll discover how to recognize “code smells,” which signal opportunities for improvement, and then perfect your program’s design one small, safe step at a time. The book shows you when and how to refactor with both legacy code and during new test-driven development, and walks you through real-world refactoring in detail. The workbook concludes with several applications designed to help practice refactoring in realistic domains, plus a handy code review checklist you’ll refer to again and again. Along the way, you’ll learn powerful lessons about designing higher quality Ruby software—lessons that will enable you to experience the joy of writing consistently great code. Refactoring in Ruby will help you Recognize why poor code design occurs, so you can prevent it from occurring in your own code Master better design techniques that lead to more efficient, reliable, and maintainable software Fix code that’s too long, large, or difficult to follow Ferret out duplication, and express each idea “once and only once” Recognize missing or inadequately formed classes Simplify overly complex relationships between classes and their subclasses Achieve the right balance of responsibilities among objects Make your code easier to test and change Cope with incomplete library modules, and fix runaway dependencies Learn the next steps to take after you refactor"},{"title":"Ruby Visual Quickstart Guide","author":"Larry Ullman","image_url":"http://books.google.com/books/content?id=YCcLNFEfTbEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321553853 {FC9697D0} Ruby Visual Quickstart Guide [Ullman 2008-11-23].pdf","publisher":"Peachpit Press","copywrite":"2009-01-28","description":"This book is for those new to programming or that know other programming languages and would like to know Ruby. The book teaches the fundamentals of object-oriented programming and starts with creating a basic program. Everything is covered such as control structures and variables, taking input, and creating output. Moving from the basic to more advanced topics, a solid understanding of Ruby is taught in logical progression. The book ends with an overview of the Web development framework, Ruby on Rails."},{"title":"The Rails 3 Way","author":"Obed (Obie) Fernandez, Kevin Faustino","image_url":"http://books.google.com/books/content?id=GL2kAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321601661 {C488CB76} The Rails 3 Way (2nd ed.) [Fernandez 2010-12-20].pdf","publisher":"Addison-Wesley Professional","copywrite":"2010-12-20","description":"The “Bible” for Rails Development: Now Fully Updated for Rails 4.1 \"When I read The Rails Way for the first time, I felt like I truly understood Rails for the first time.” —From the Foreword by Steve Klabnik Ruby on Rails 4 is leaner, tighter, and even more valuable to professional web developers. More than ever, it helps you focus on what matters most: delivering business value via clean and maintainable code. The Rails™ 4 Way is the only comprehensive, authoritative guide to delivering production-quality code with Rails 4. Kevin Faustino joins pioneering Rails developer Obie Fernandez to illuminate the entire Rails 4 API, including its most powerful and modern idioms, design approaches, and libraries. They present extensive new and updated content on security, performance, caching, Haml, RSpec, Ajax, the Asset Pipeline, and more. Through detailed code examples, you’ll dive deep into the Rails 4 code base, discover why Rails is designed as it is, and learn how to make it do exactly what you want. Proven in dozens of production systems, this book’s techniques will maximize your productivity and help you build more successful solutions. You’ll want to keep this guide by your computer—you’ll refer to it constantly. This guide will help you Build powerful, scalable REST-compliant APIs Program complex program flows using Action Controller Represent models, relationships, CRUD operations, searches, validation, callbacks, and more Smoothly evolve application database schema via Migrations Apply advanced Active Record techniques: single-table inheritance, polymorphic models, and more Create visual elements with Action View and partials Optimize performance and scalability with view caching Master the highly productive Haml HTML templating engine Make the most of Rails’ approach to session management Secure your systems with Rails 4’s improved authentication and authorization Resist SQL Injection, XSS, XSRF, and other attacks Extend Rails with popular gems and plugins, and learn to write your own Integrate email services with Action Mailer Use Ajax via Rails 4 support for unobtrusive JavaScript Improve responsiveness with background processing Leverage Asset Pipeline to simplify development, improve perceived performance, and reduce server burdens Accelerate implementation and promote maintainability with RSpec"},{"title":"Refactoring, Ruby Edition","author":"Jay Fields, Shane Harvie, Martin Fowler, Kent Beck","image_url":"http://books.google.com/books/content?id=6jyOUrJBJHAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321603508 {5FABCCB8} Refactoring_ Ruby Edition [Fields, Harvie, Fowler & Beck 2009-10-25].pdf","publisher":"Pearson Education","copywrite":"2009-10-15","description":"The Definitive Refactoring Guide, Fully Revamped for Ruby With refactoring, programmers can transform even the most chaotic software into well-designed systems that are far easier to evolve and maintain. What’s more, they can do it one step at a time, through a series of simple, proven steps. Now, there’s an authoritative and extensively updated version of Martin Fowler’s classic refactoring book that utilizes Ruby examples and idioms throughout–not code adapted from Java or any other environment. The authors introduce a detailed catalog of more than 70 proven Ruby refactorings, with specific guidance on when to apply each of them, step-by-step instructions for using them, and example code illustrating how they work. Many of the authors’ refactorings use powerful Ruby-specific features, and all code samples are available for download. Leveraging Fowler’s original concepts, the authors show how to perform refactoring in a controlled, efficient, incremental manner, so you methodically improve your code’s structure without introducing new bugs. Whatever your role in writing or maintaining Ruby code, this book will be an indispensable resource. This book will help you Understand the core principles of refactoring and the reasons for doing it Recognize “bad smells” in your Ruby code Rework bad designs into well-designed code, one step at a time Build tests to make sure your refactorings work properly Understand the challenges of refactoring and how they can be overcome Compose methods to package code properly Move features between objects to place responsibilities where they fit best Organize data to make it easier to work with Simplify conditional expressions and make more effective use of polymorphism Create interfaces that are easier to understand and use Generalize more effectively Perform larger refactorings that transform entire software systems and may take months or years Successfully refactor Ruby on Rails code"},{"title":"Distributed Programming with Ruby","author":"Mark Bates","image_url":"http://books.google.com/books/content?id=GRD_S9OwsJ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321638360 {D6FF2E73} Distributed Programming with Ruby [Bates 2009-11-15].pdf","publisher":"Addison-Wesley Professional","copywrite":"2009-11-05","description":"Complete, Hands-On Guide to Building Advanced Distributed Applications with Ruby Distributed programming techniques make applications easier to scale, develop, and deploy—especially in emerging cloud computing environments. Now, one of the Ruby community’s leading experts has written the first definitive guide to distributed programming with Ruby. Mark Bates begins with a simple distributed application, and then walks through an increasingly complex series of examples, demonstrating solutions to the most common distributed programming problems. Bates presents the industry’s most useful coverage of Ruby’s standard distributed programming libraries, DRb and Rinda. Next, he introduces powerful third-party tools, frameworks, and libraries designed to simplify Ruby distributed programming, including his own Distribunaut. If you’re an experienced Ruby programmer or architect, this hands-on tutorial and practical reference will help you meet any distributed programming challenge, no matter how complex. Coverage includes Writing robust, secure, and interactive applications using DRb—and managing its drawbacks Using Rinda to build applications with improved flexibility, fault tolerance, and service discovery Simplifying DRb service management with RingyDingy Utilizing Starfish to facilitate communication between distributed programs and to write MapReduce functions for processin large data sets Using Politics to customize the processes running on individual server instances in a cloud computing environment Providing reliable distributed queuing with the low-overhead Starling messaging server Implementing comprehensive enterprise messaging with RabbitMQ and Advanced Message Queuing Protocol (AMQP) Offloading heavyweight tasks with BackgrounDRb and DelayedJob"},{"title":"Rails AntiPatterns","author":"Chad Pytel, Tammer Saleh","image_url":"http://books.google.com/books/content?id=i6mZ0HBDPzsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321604814 {26FE4E5B} Rails AntiPatterns_ Best Practice Ruby on Rails Refactoring [Pytel & Saleh 2010-11-19].pdf","publisher":"Addison-Wesley Professional","copywrite":"2010-11-09","description":"The Complete Guide to Avoiding and Fixing Common Rails 3 Code and Design Problems As developers worldwide have adopted the powerful Ruby on Rails web framework, many have fallen victim to common mistakes that reduce code quality, performance, reliability, stability, scalability, and maintainability. Rails™ AntiPatterns identifies these widespread Rails code and design problems, explains why they’re bad and why they happen—and shows exactly what to do instead. The book is organized into concise, modular chapters—each outlines a single common AntiPattern and offers detailed, cookbook-style code solutions that were previously difficult or impossible to find. Leading Rails developers Chad Pytel and Tammer Saleh also offer specific guidance for refactoring existing bad code or design to reflect sound object-oriented principles and established Rails best practices. With their help, developers, architects, and testers can dramatically improve new and existing applications, avoid future problems, and establish superior Rails coding standards throughout their organizations. This book will help you understand, avoid, and solve problems with Model layer code, from general object-oriented programming violations to complex SQL and excessive redundancy Domain modeling, including schema and database issues such as normalization and serialization View layer tools and conventions Controller-layer code, including RESTful code Service-related APIs, including timeouts, exceptions, backgrounding, and response codes Third-party code, including plug-ins and gems Testing, from test suites to test-driven development processes Scaling and deployment Database issues, including migrations and validations System design for “graceful degradation” in the real world"},{"title":"Service-Oriented Design with Ruby and Rails","author":"Paul Dix","image_url":"http://books.google.com/books/content?id=Q2DhEPqREYQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321659368 {D84F9B83} Service-Oriented Design with Ruby and Rails [Dix, Cashion, Helmkamp & Howerton 2010-08-27].pdf","publisher":"Addison-Wesley Professional","copywrite":"2010-08-17","description":"The Complete Guide to Building Highly Scalable, Services-Based Rails Applications Ruby on Rails deployments are growing, and Rails is increasingly being adopted in larger environments. Today, Rails developers and architects need better ways to interface with legacy systems, move into the cloud, and scale to handle higher volumes and greater complexity. In Service-Oriented Design with Ruby and Rails, Paul Dix introduces a powerful, services-based design approach geared toward overcoming all these challenges. Using Dix’s techniques, readers can leverage the full benefits of both Ruby and Rails, while overcoming the difficulties of working with larger codebases and teams. Dix demonstrates how to integrate multiple components within an enterprise application stack; create services that can easily grow and connect; and design systems that are easier to maintain and upgrade. Key concepts are explained with detailed Ruby code that was built using open source libraries such as ActiveRecord, Sinatra, Nokogiri, and Typhoeus. The book concludes with coverage of security, scaling, messaging, and interfacing with third-party services. Service-Oriented Design with Ruby and Rails will help you Build highly scalable, Ruby-based service architectures that operate smoothly in the cloud or with legacy systems Scale Rails systems to handle more requests, larger development teams, and more complex code bases Master new best practices for designing and creating services in Ruby Use Ruby to glue together services written in any language Use Ruby libraries to build and consume RESTful web services Use Ruby JSON parsers to quickly represent resources from HTTP services Write lightweight, well-designed API wrappers around internal or external services Discover powerful non-Rails frameworks that simplify Ruby service implementation Implement standards-based enterprise messaging with Advanced Message Queuing Protocol (AMQP) Optimize performance with load balancing and caching Provide for security and authentication"},{"title":"The Ruby Way","author":"Hal Edwin Fulton","image_url":"http://books.google.com/books/content?id=qbKtQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321714636 {3D86EDC2} The Ruby Way (3rd ed.) [Fulton & Arko 2015-03-13].pdf","publisher":"Addison-Wesley Professional","copywrite":"2015","description":"New edition that comes at a time when Ruby's new applications and frameworks such as Rails gain rapid success."},{"title":"Ruby on Rails 3 Tutorial","author":"Michael Hartl","image_url":"http://books.google.com/books/content?id=pShDnvE6sJ0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321743121 {029D428A} Ruby on Rails 3 Tutorial_ Learn Rails by Example [Hartl 2010-12-16].pdf","publisher":"Addison-Wesley","copywrite":"2010-12-16","description":"“Ruby on Rails™ Tutorial by Michael Hartl has become a must-read for developers learning how to build Rails apps.” —Peter Cooper, Editor of Ruby Inside Using Rails, developers can build web applications of exceptional elegance and power. Although its remarkable capabilities have made Ruby on Rails one of the world’s most popular web development frameworks, it can be challenging to learn and use. Ruby on Rails™ Tutorial, Second Edition, is the solution. Best-selling author and leading Rails developer Michael Hartl teaches Rails by guiding you through the development of your own complete sample application using the latest techniques in Rails web development. The updates to this edition include all-new site design using Twitter’s Bootstrap; coverage of the new asset pipeline, including Sprockets and Sass; behavior-driven development (BDD) with Capybara and RSpec; better automated testing with Guard and Spork; roll your own authentication with has_secure_password; and an introduction to Gherkin and Cucumber. You’ll find integrated tutorials not only for Rails, but also for the essential Ruby, HTML, CSS, JavaScript, and SQL skills you’ll need when developing web applications. Hartl explains how each new technique solves a real-world problem, and he demonstrates this with bite-sized code that’s simple enough to understand, yet novel enough to be useful. Whatever your previous web development experience, this book will guide you to true Rails mastery. This book will help you Install and set up your Rails development environment Go beyond generated code to truly understand how to build Rails applications from scratch Learn test-driven development (TDD) with RSpec Effectively use the Model-View-Controller (MVC) pattern Structure applications using the REST architecture Build static pages and transform them into dynamic ones Master the Ruby programming skills all Rails developers need Define high-quality site layouts and data models Implement registration and authentication systems, including validation and secure passwords Update, display, and delete users Add social features and microblogging, including an introduction to Ajax Record version changes with Git and share code at GitHub Simplify application deployment with Heroku"},{"title":"Practical Object-oriented Design in Ruby","author":"Sandi Metz","image_url":"http://books.google.com/books/content?id=rk9sAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321721330 {ACD8604A} Practical Object-Oriented Design in Ruby_ An Agile Primer [Metz 2012-09-15].pdf","publisher":"Pearson Education","copywrite":"2012","description":"Take Ruby development to the next level: leverage Ruby's full power to write more maintainable, manageable, and pleasing applications * *Master object-oriented Ruby techniques for building applications that are as easy to maintain and upgrade as they were to write! *Discover concrete solutions for common issues associated with poorly designed, hard-to-change Ruby applications. *Solves painful problems now facing many of the world's 1+ million Ruby developers, including programmers at all levels of experience. Years after the initial release of Ruby on Rails, the chickens are coming home to roost. Suddenly, anyone could write a web application -- and it seems like everyone did. The web is now awash in Ruby applications that were easy to write but are now virtually impossible to change, extend, or grow. This book solves that problem by teaching developers real-world object oriented design techniques specifically focused on Ruby. Writing for more than 1,000,000 Ruby developers at all levels of experience, Sandi Metz shares knowledge and concrete solutions for creating more extensible, more maintainable applications - and for fixing many of the poorly designed applications they must now manage. The first book to focus squarely on object-oriented Ruby application design, Practical Object Oriented Design in Ruby will guide developers to superior outcomes, even if their previous experience has been strictly limited to 'procedural' techniques. Metz distills a lifetime of conversations about object-oriented design and many years of whiteboard drawings into a set of specific Ruby practices and patterns that lead to more manageable and pleasing code. Novice Ruby programmers will find specific 'rules to live by'; intermediate Ruby programmers will find valuable principles they can flexibly interpret and apply; and advanced Ruby programmers will find a common language they can use to lead development and guide their colleagues."},{"title":"The Rails 4 Way","author":"Obed (Obie) Fernandez, Kevin Faustino","image_url":"http://books.google.com/books/content?id=GL2kAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0321944275 {CB161C55} The Rails 4 Way (3rd ed.) [Fernandez 2014-06-08].pdf","publisher":"Addison-Wesley","copywrite":"2015","description":"The “Bible” for Rails Development: Now Fully Updated for Rails 4.1 \"When I read The Rails Way for the first time, I felt like I truly understood Rails for the first time.” —From the Foreword by Steve Klabnik Ruby on Rails 4 is leaner, tighter, and even more valuable to professional web developers. More than ever, it helps you focus on what matters most: delivering business value via clean and maintainable code. The Rails™ 4 Way is the only comprehensive, authoritative guide to delivering production-quality code with Rails 4. Kevin Faustino joins pioneering Rails developer Obie Fernandez to illuminate the entire Rails 4 API, including its most powerful and modern idioms, design approaches, and libraries. They present extensive new and updated content on security, performance, caching, Haml, RSpec, Ajax, the Asset Pipeline, and more. Through detailed code examples, you’ll dive deep into the Rails 4 code base, discover why Rails is designed as it is, and learn how to make it do exactly what you want. Proven in dozens of production systems, this book’s techniques will maximize your productivity and help you build more successful solutions. You’ll want to keep this guide by your computer—you’ll refer to it constantly. This guide will help you Build powerful, scalable REST-compliant APIs Program complex program flows using Action Controller Represent models, relationships, CRUD operations, searches, validation, callbacks, and more Smoothly evolve application database schema via Migrations Apply advanced Active Record techniques: single-table inheritance, polymorphic models, and more Create visual elements with Action View and partials Optimize performance and scalability with view caching Master the highly productive Haml HTML templating engine Make the most of Rails’ approach to session management Secure your systems with Rails 4’s improved authentication and authorization Resist SQL Injection, XSS, XSRF, and other attacks Extend Rails with popular gems and plugins, and learn to write your own Integrate email services with Action Mailer Use Ajax via Rails 4 support for unobtrusive JavaScript Improve responsiveness with background processing Leverage Asset Pipeline to simplify development, improve perceived performance, and reduce server burdens Accelerate implementation and promote maintainability with RSpec"},{"title":"Ruby on Rails For Dummies","author":"Barry A. Burd","image_url":"http://books.google.com/books/content?id=CHx7Cb9a32cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0470081201 {37BB4D11} Ruby on Rails for Dummies [Burd 2007-01-10].pdf","publisher":"John Wiley & Sons","copywrite":"2011-05-09","description":"Quickly create Web sites with this poweful tool Use this free and easy programming language for e-commerce sites and blogs If you need to build Web and database applications quickly but you don't dream in computer code, take heart! Ruby on Rails was created for you, and this book will have you up and running in no time. The Ruby scripting language and the Rails framework let you create full-featured Web applications fast. It's even fun! Discover how to Install and run Ruby and Rails Use the RadRails IDE Create a blog with Ruby Connect your Web site to a database Build a shopping cart Explore Ruby's syntax"},{"title":"Beginning Ruby on Rails","author":"Steve Holzner, Ph.D.","image_url":"http://books.google.com/books/content?id=BaWayIR0CvkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0470069155 {C488ADA7} Beginning Ruby on Rails [Holzner 2006-11-29].pdf","publisher":"John Wiley & Sons","copywrite":"2006-11-29","description":"Ruby on Rails is the revolutionary online programming tool that makes creating functional e-commerce web sites faster and easier than ever. With the intuitive, straightforward nature of Ruby and the development platform provided by Rails, you can put together full-fledged web applications quickly, even if you're new to web programming. You will find a thorough introduction to both Ruby and Rails in this book. You'll get the easy instructions for acquiring and installing both; understand the nature of conditionals, loops, methods, and blocks; and become familiar with Ruby's classes and objects. You'll learn to build Rails applications, connect to databases, perform necessary testing, and put the whole thing together to create real-world applications such as shopping carts and online catalogs--apps you can actually use right away. What you will learn from this book * How to install and use Ruby and Rails * Object-oriented programming with Ruby * Rails fundamentals and how to create basic online applications * How to work with HTML controls, use models in Rails applications, and work with sessions * Details on working with databases and creating, editing, and deleting database records * Methods for handling cookies and filters and for caching pages * How to connect Rails with Ajax Who this book is for This book is for anyone who wants to develop online applications using Ruby and Rails. A basic understanding of programming is helpful; some knowledge of HTML is necessary. Wrox Beginning guides are crafted to make learning programming languages and technologies easier than you think, providing a structured, tutorial format that will guide you through all the techniques involved."},{"title":"The Art of Rails","author":"Edward Benson","image_url":"http://books.google.com/books/content?id=BaitKM5lPQUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0470189487 {0CDE3034} The Art of Rails [Benson 2008-05-05].pdf","publisher":"John Wiley & Sons","copywrite":"2008-07-28","description":"Ruby on Rails offers the ability to rapidly design and write high-quality code with elegance and maintainability. Written by an experienced web application developer, this book explains how to take good Rails code and turn it into beautiful Rails code: simple, effective, reusable, evolvable code. He discusses the very latest in design patterns, programming abstractions, and development methodologies that have emerged for the modern web. With each design technique, you?ll discover how to make your own additions to Rails and craft a development environment tailored to your specific needs."},{"title":"Professional Ruby on Rails","author":"Noel Rappin","image_url":"http://books.google.com/books/content?id=DmUlcuWkajAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/047022388X {B0302AE4} Professional Ruby on Rails [Rappin 2008-02-25].pdf","publisher":"John Wiley & Sons","copywrite":"2008-05-19","description":"Nothing less than a revolution in the way web applications are constructed,Ruby on Rails (RoR) boasts a straightforward and intuitive nature that avoids programming repetition and makes it infinitely easier to build for the web. This book captures the current best practices to show you the most efficient way to build a spectacular web application with RoR. You?ll learn everything you need to know in order to extend Rails so that you can take advantage of the many exciting and wonderful things that are being done by the diligent RoR programming community."},{"title":"Ruby On Rails Bible","author":"Timothy Fisher","image_url":"http://books.google.com/books/content?id=bLWi6l8BDuIC&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0470258225 {B9E9C467} Ruby on Rails Bible [Fisher 2008-10-06].pdf","publisher":"John Wiley & Sons","copywrite":"2008-11-10","description":"Ruby on Rails is a Web application framework written in Ruby, an object-oriented programming language. RoR has grown year over year in notoriety and popularity among developers because its ease of use and speed for which a Web developer can build and maintain Web sites and applications. One of its key principles is using less code for application development by avoiding redundancy and following Rails conventions, encouraging increased performance, but with less development time. Ruby on Rails Bible takes all that is key to this framework and programming language and details it in one concise guide for all user levels. Coverage includes an introduction and summary of the Ruby programming language, followed by complete in-depth coverage of the Ruby on Rails framework. In addition to chapters detailing all of the features of Rails, a separate section of the book will provide a walkthrough of the development of a complete Rails web application utilizing much of what is taught earlier in the book. Current hot development trends including Agile development, Web Services, Web 2.0, and Ajax will be covered from the Rails perspective too."},{"title":"Ruby on Rails for Microsoft Developers","author":"Antonio Cangiano","image_url":"http://books.google.com/books/content?id=0y0V8uXBH_gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0470374950 {144A5D95} Ruby on Rails for Microsoft Developers [Cangiano 2009-04-06] (incorrect cover).pdf","publisher":"John Wiley & Sons","copywrite":"2009-04-27","description":"This definitive guide examines how to take advantage of the new Agile methodologies offered when using Ruby on Rails (RoR). You’ll quickly grasp the RoR methodology by focusing on the RoR development from the point of view of the beginner- to intermediate-level Microsoft developer. Plus, you’ll get a reliable roadmap for migrating your applications, skill set, and development processes to the newer, more agile programming platform that RoR offers."},{"title":"Ruby in a Nutshell","author":"Yukihiro Matsumoto","image_url":"http://books.google.com/books/content?id=B3iA1LYwo8wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596002149 {D63B8B86} Ruby in a Nutshell [Matsumoto 2001-11].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2002","description":"Introduces Ruby's object-oriented programming capabilities, detailing command-line options, syntax, built-in variables, functions, commonly used classes and modules, environment variables, operators, methods, and security."},{"title":"Rails: Up and Running","author":"Bruce Tate, Lance Carlson, Curt Hibbs","image_url":"http://books.google.com/books/content?id=jBu8hv9SXPoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596101325 {2F1E01EA} Ruby on Rails_ Up and Running [Hibbs & Tate 2006-08-01].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2008-10-07","description":"In just a matter of days, you can develop powerful web applications with Rails that once took weeks or months to produce with other web frameworks. If that sounds too good to be true, it isn't. Find out for yourself with Rails: Up and Running, the concise and popular book that not only explains how Rails works, but guides you through a complete test drive. Perfect for beginning web developers, this thoroughly revised edition teaches you the basics of installing and using Rails 2.1 and the Ruby scripting language. While Rails is praised for its simplicity, there are still a few tricky steps to master along the way. Rails: Up and Running offers lots of examples and covers just about everything you need to build functional Rails applications right away. Learn how to: Create simple database-backed applications, and build dynamic user-centric web pages using Ajax and REST Exploit the Rails service frameworks to send emails and implement web services Map data to an imperfect table, traverse complex relationships, and build custom finders Use techniques to solve common database performance problems See how fast you can go on Rails, and how reliable it's become with the stability and power of version 2.1. With Rails: Up and Running, you'll discover why Rails is a remarkable new way to build database-driven web applications."},{"title":"Advanced Rails","author":"Brad Ediger","image_url":"http://books.google.com/books/content?id=0hJNW6wX3UEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596510322 {3F2EC3B1} Advanced Rails_ Building Industrial-Strength Web Apps in Record Time [Ediger 2008-01-11].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2007-12-21","description":"Ready to go to the next level with Rails? From examining the parts of Ruby that make this framework possible to deploying large Rails applications, Advanced Rails offers you an in-depth look at techniques for dealing with databases, security, performance, web services and much more. Chapters in this book help you understand not only the tricks and techniques used within the Rails framework itself, but also how to make use of ideas borrowed from other programming paradigms. Advanced Rails pays particular attention to building applications that scale -- whether \"scale\" means handling more users, or working with a bigger and more complex database. You'll find plenty of examples and code samples that explain: Aspects of Ruby that are often confusing or misunderstood Metaprogramming How to develop Rails plug-ins Different database management systems Advanced database features, including triggers, rules, and stored procedures How to connect to multiple databases When to use the Active Support library for generic, reusable functions Security principles for web application design, and security issues endemic to the Web When and when not to optimize performance Why version control and issue tracking systems are essential to any large or long-lived Rails project Advanced Rails also gives you a look at REST for developing web services, ways to incorporate and extend Rails, how to use internationalization, and many other topics. If you're just starting out with rails, or merely experimenting with the framework, this book is not for you. But if you want to improve your skills with Rails through advanced techniques, this book is essential."},{"title":"Ruby Pocket Reference","author":"Michael Fitzgerald","image_url":"http://books.google.com/books/content?id=rutVCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596514816 {2392ACF1} Ruby Pocket Reference_ A Quick Guide to Ruby [Fitzgerald 2007-07-28].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2015-08-10","description":"Updated for Ruby 2.2, this handy reference offers brief yet clear explanations of Ruby’s core elements—from operators to blocks to documentation creation—and highlights the key features you may work with every day. Need to know the correct syntax for a conditional? Forgot the name of that String method? This book is organized to help you find the facts fast. Ruby Pocket Reference, 2nd Edition is ideal for experienced programmers who are new to Ruby. Whether you’ve come to Ruby because of Rails, or you want to take advantage of this clean, powerful, and expressive language for other applications, this reference will help you easily pinpoint the information you need. You’ll find detailed reference material for: Keywords, operators, comments, numbers, and symbols Variables, pre-defined global variables, and regular expressions Conditional statements, method use, classes, and exception handling Methods for the BasicObject, Object, Kernel, String, Array, and Hash classes Time formatting directives New syntax since Ruby 1.9"},{"title":"Enterprise Rails","author":"Dan Chak","image_url":"http://books.google.com/books/content?id=thTju-4duY4C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596515200 {8D85C94F} Enterprise Rails_ Architecting for Success [Chak 2008-11-03].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2008-10-21","description":"What does it take to develop an enterprise application with Rails? Enterprise Rails introduces several time-tested software engineering principles to prepare you for the challenge of building a high-performance, scalable website with global reach. You'll learn how to design a solid architecture that ties the many parts of an enterprise website together, including the database, your servers and clients, and other services as well. Many Rails developers think that planning for scale is unnecessary. But there's nothing worse than an application that fails because it can't handle sudden success. Throughout this book, you'll work on an example enterprise project to learn first-hand what's involved in architecting serious web applications. With this book, you will: Tour an ideal enterprise systems layout: how Rails fits in, and which elements don't rely on Rails Learn to structure a Rails 2.0 application for complex websites Discover how plugins can support reusable code and improve application clarity Build a solid data model -- a fortress -- that protects your data from corruption Base an ActiveRecord model on a database view, and build support for multiple table inheritance Explore service-oriented architecture and web services with XML-RPC and REST See how caching can be a dependable way to improve performance Building for scale requires more work up front, but you'll have a flexible website that can be extended easily when your needs change. Enterprise Rails teaches you how to architect scalable Rails applications from the ground up. \"Enterprise Rails is indispensable for anyone planning to build enterprise web services. It's one thing to get your service off the ground with a framework like Rails, but quite another to construct a system that will hold up at enterprise scale. The secret is to make good architectural choices from the beginning. Chak shows you how to make those choices. Ignore his advice at your peril.\"-- Hal Abelson, Prof. of Computer Science and Engineering, MIT"},{"title":"Head First Rails","author":"David Griffiths","image_url":"http://books.google.com/books/content?id=9nmF5-7qH8sC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596515774 {0410FCF1} Head First Rails [Griffiths 2009-01-09].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2013-05-23","description":"Ready to transport your web applications into the Web 2.0 era? Head First Rails takes your programming -- and productivity -- to the max. You'll learn everything from the fundamentals of Rails scaffolding to building customized interactive web apps using Rails' rich set of tools and the MVC framework. By the time you're finished, you'll have learned more than just another web framework. You'll master database interactions, integration with Ajax and XML, rich content, and even dynamic graphing of your data -- all in a fraction of the time it takes to build the same apps with Java, PHP, ASP.NET, or Perl. You'll even get comfortable and familiar with Ruby, the language that underpins Rails. But you'll do it in the context of web programming, and not through boring exercises such as \"Hello, World!\" Your time is way too valuable to waste struggling with new concepts. Using the latest research in cognitive science and learning theory to craft a multi-sensory learning experience, Head First Rails uses a visually rich format designed to take advantage of the way your brain really works."},{"title":"The Ruby Programming Language","author":"David Flanagan, Yukihiro Matsumoto","image_url":"http://books.google.com/books/content?id=jcUbTcr5XWwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596516177 {4F49AB60} The Ruby Programming Language_ Everything You Need to Know [Flanagan & Matsumoto 2008-02-04].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2008-01-25","description":"The Ruby Programming Language is the authoritative guide to Ruby and provides comprehensive coverage of versions 1.8 and 1.9 of the language. It was written (and illustrated!) by an all-star team: David Flanagan, bestselling author of programming language \"bibles\" (including JavaScript: The Definitive Guide and Java in a Nutshell) and committer to the Ruby Subversion repository. Yukihiro \"Matz\" Matsumoto, creator, designer and lead developer of Ruby and author of Ruby in a Nutshell, which has been expanded and revised to become this book. why the lucky stiff, artist and Ruby programmer extraordinaire. This book begins with a quick-start tutorial to the language, and then explains the language in detail from the bottom up: from lexical and syntactic structure to datatypes to expressions and statements and on through methods, blocks, lambdas, closures, classes and modules. The book also includes a long and thorough introduction to the rich API of the Ruby platform, demonstrating -- with heavily-commented example code -- Ruby's facilities for text processing, numeric manipulation, collections, input/output, networking, and concurrency. An entire chapter is devoted to Ruby's metaprogramming capabilities. The Ruby Programming Language documents the Ruby language definitively but without the formality of a language specification. It is written for experienced programmers who are new to Ruby, and for current Ruby programmers who want to challenge their understanding and increase their mastery of the language."},{"title":"Learning Rails 3","author":"Simon St. Laurent, Edd Dumbill, Eric J Gruber","image_url":"http://books.google.com/books/content?id=WMKw7hGjIyAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596518773 {89FA4A9A} Learning Rails_ Rails from the Outside In [St. Laurent & Dumbill 2008-11-28].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2012-07-17","description":"If you’re a web developer or designer ready to learn Rails, this unique book is the ideal way to start. Rather than throw you into the middle of the framework’s Model-View-Controller architecture, Learning Rails 3 works from the outside in. You’ll begin with the foundations of the Web you already know, and learn how to create something visible with Rails’ view layer. Then you’ll tackle the more difficult inner layers: the database models and controller code. All you need to get started is HTML experience. Each chapter includes exercises and review questions to test your understanding as you go. Present content by building an application with a basic view and a simple controller Build forms and process their results, progressing from simple to more complex Connect forms to models by setting up a database, and create code that maps to database structures Use Rails scaffolding to build applications from a view-centric perspective Add common web application elements such as sessions, cookies, and authentication Build applications that combine data from multiple tables Send and receive email messages from your applications \"Learning Rails 3 feels like a brisk pair programming session with professionals who know how to use Ruby on Rails to get things done, and get them done well.\" -Alan Harris, author of Sinatra: Up and Running"},{"title":"Ruby Best Practices","author":"Gregory T Brown","image_url":"http://books.google.com/books/content?id=WOyuE3YYjiIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596523009 {3545A429} Ruby Best Practices_ Increase Your Productivity--Write Better Code [Brown 2009-06-26].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2009-06-11","description":"How do you write truly elegant code with Ruby? Ruby Best Practices is for programmers who want to use Ruby as experienced Rubyists do. Written by the developer of the Ruby project Prawn, this concise book explains how to design beautiful APIs and domain-specific languages with Ruby, as well as how to work with functional programming ideas and techniques that can simplify your code and make you more productive. You'll learn how to write code that's readable, expressive, and much more. Ruby Best Practices will help you: Understand the secret powers unlocked by Ruby's code blocks Learn how to bend Ruby code without breaking it, such as mixing in modules on the fly Discover the ins and outs of testing and debugging, and how to design for testability Learn to write faster code by keeping things simple Develop strategies for text processing and file management, including regular expressions Understand how and why things can go wrong Reduce cultural barriers by leveraging Ruby's multilingual capabilities This book also offers you comprehensive chapters on driving code through tests, designing APIs, and project maintenance. Learn how to make the most of this rich, beautiful language with Ruby Best Practices."},{"title":"Ruby Cookbook","author":"Lucas Carlson, Leonard Richardson","image_url":"http://books.google.com/books/content?id=xBmkBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596523696 {C6E7D32B} Ruby Cookbook_ Recipes for Object-Oriented Scripting [Carlson & Richardson 2006-07-29].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2015-03-24","description":"Why spend time on coding problems that others have already solved when you could be making real progress on your Ruby project? This updated cookbook provides more than 350 recipes for solving common problems, on topics ranging from basic data structures, classes, and objects, to web development, distributed programming, and multithreading. Revised for Ruby 2.1, each recipe includes a discussion on why and how the solution works. You’ll find recipes suitable for all skill levels, from Ruby newbies to experts who need an occasional reference. With Ruby Cookbook, you’ll not only save time, but keep your brain percolating with new ideas as well. Recipes cover: Data structures including strings, numbers, date and time, arrays, hashes, files and directories Using Ruby’s code blocks, also known as closures OOP features such as classes, methods, objects, and modules XML and HTML, databases and persistence, and graphics and other formats Web development with Rails and Sinatra Internet services, web services, and distributed programming Software testing, debugging, packaging, and distributing Multitasking, multithreading, and extending Ruby with other languages"},{"title":"Ajax on Rails","author":"Scott Raymond","image_url":"http://books.google.com/books/content?id=GfF27NZCWXoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596527446 {976D2D86} AJAX on Rails_ Build Dynamic Web Applications with Ruby [Raymond 2007-01-13].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2007-01-03","description":"Learn to build dynamic, interactive web applications using the two most important approaches to web development today: Ajax and the phenomenally efficient Ruby on Rails platform. This book teaches intermediate to advanced web developers how to use both Ajax and Rails to quickly build high-performance, scalable applications without being overwhelmed with thousands of lines of JavaScript code. More than just recipes, you also get a thorough, low-level understanding of what's happening under the hood. Ajax on Rails includes three fully worked out Rails/Ajax applications, and quick reference sections for Prototype and script.aculo.us. Testing lessons show you how to eliminate cross-browser JavaScript errors and DOM debugging nightmares using a combination of Firebug, and Venkman. Advanced material explains the most current design practices for Ajax usability. You'll learn to avoid user experience mistakes with proven design patterns. Beyond the how-to, Ajax on Rails helps you consider when Ajax is (and isn't) appropriate, and the trade-offs associated with it. For those new to Rails, this book provides a quick introduction, the big picture, a walk through the installation process, and some tips on getting started. If you've already started working with Rails and seek to deepen your skill set, you'll find dozens of examples drawn from real-world projects, exhaustive reference for every relevant feature, and expert advice on how to \"Ajaxify\" your applications."},{"title":"Web Services on Rails","author":"Kevin Marshall","image_url":"http://books.google.com/books/content?id=VEMmkC-gJSoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596527969 {A6791A42} Web Services on Rails [Marshall 2006].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2006-05-23","description":"This PDF will show you how your small business or enterprise can publish its APIs (application programming interface) to a developer community just like the behemoths of the Internet--Google, Yahoo!, eBay, and Amazon. These giants already offer their APIs to other programmers and allow for add-on services and mash-ups to develop from them--but until recently, the capability for most enterprises to do the same was limited by a myriad of competing standards and a lack of easy-to-use tools to accomplish the task. Ruby on Rails levels the playing field for companies by simplifying the process of building web services and documenting APIs. Now with Rails, enterprise-quality tools are available for all developers. In this document, we'll look at how Ruby on Rails makes building web service clients and servers simple and fun. Along the way, we'll give working examples and code details so you can see just how everything works."},{"title":"RESTful Web Services","author":"Leonard Richardson, Sam Ruby","image_url":"http://books.google.com/books/content?id=XUaErakHsoAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596529260 {3446BE8D} RESTful Web Services_ Web Services for the Real World [Richardson & Ruby 2007].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2008-12-17","description":"\"Every developer working with the Web needs to read this book.\" -- David Heinemeier Hansson, creator of the Rails framework \"RESTful Web Services finally provides a practical roadmap for constructing services that embrace the Web, instead of trying to route around it.\" -- Adam Trachtenberg, PHP author and EBay Web Services Evangelist You've built web sites that can be used by humans. But can you also build web sites that are usable by machines? That's where the future lies, and that's what RESTful Web Services shows you how to do. The World Wide Web is the most popular distributed application in history, and Web services and mashups have turned it into a powerful distributed computing platform. But today's web service technologies have lost sight of the simplicity that made the Web successful. They don't work like the Web, and they're missing out on its advantages. This book puts the \"Web\" back into web services. It shows how you can connect to the programmable web with the technologies you already use every day. The key is REST, the architectural style that drives the Web. This book: Emphasizes the power of basic Web technologies -- the HTTP application protocol, the URI naming standard, and the XML markup language Introduces the Resource-Oriented Architecture (ROA), a common-sense set of rules for designing RESTful web services Shows how a RESTful design is simpler, more versatile, and more scalable than a design based on Remote Procedure Calls (RPC) Includes real-world examples of RESTful web services, like Amazon's Simple Storage Service and the Atom Publishing Protocol Discusses web service clients for popular programming languages Shows how to implement RESTful services in three popular frameworks -- Ruby on Rails, Restlet (for Java), and Django (for Python) Focuses on practical issues: how to design and implement RESTful web services and clients This is the first book that applies the REST design philosophy to real web services. It sets down the best practices you need to make your design a success, and the techniques you need to turn your design into working code. You can harness the power of the Web for programmable applications: you just have to work with the Web instead of against it. This book shows you how."},{"title":"Learning Ruby","author":"Michael Fitzgerald","image_url":"http://books.google.com/books/content?id=pYS_Fm5LqUYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596529864 {926250D8} Learning Ruby_ The Language that Powers Rails [Fitzgerald 2007-05-24].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2007-05-14","description":"You don't have to know everything about a car to drive one, and you don't need to know everything about Ruby to start programming with it. Written for both experienced and new programmers alike, Learning Ruby is a just-get-in-and-drive book -- a hands-on tutorial that offers lots of Ruby programs and lets you know how and why they work, just enough to get you rolling down the road. Interest in Ruby stems from the popularity of Rails, the web development framework that's attracting new devotees and refugees from Java and PHP. But there are plenty of other uses for this versatile language. The best way to learn is to just try the code! You'll find examples on nearly every page of this book that you can imitate and hack. Briefly, this book: Outlines many of the most important features of Ruby Demonstrates how to use conditionals, and how to manipulate strings in Ruby. Includes a section on regular expressions Describes how to use operators, basic math, functions from the Math module, rational numbers, etc. Talks you through Ruby arrays, and demonstrates hashes in detail Explains how to process files with Ruby Discusses Ruby classes and modules (mixins) in detail, including a brief introduction to object-oriented programming (OOP) Introduces processing XML, the Tk toolkit, RubyGems, reflection, RDoc, embedded Ruby, metaprogramming, exception handling, and other topics Acquaints you with some of the essentials of Rails, and includes a short Rails tutorial. Each chapter concludes with a set of review questions, and appendices provide you with a glossary of terms related to Ruby programming, plus reference material from the book in one convenient location. If you want to take Ruby out for a drive, Learning Ruby holds the keys."},{"title":"Ruby Phrasebook","author":"Jason D. Clinton","image_url":"https://images-eu.ssl-images-amazon.com/images/I/5127APXn1QL._AC_US160_.jpg","category_id":10,"type_id":1,"url":"Ruby and Rails/0672328976 {BCEA80D2} Ruby Phrasebook_ Essential Code and Commands [Clinton 2008-09-04].pdf","publisher":"Addison Wesley","copywrite":"2008-09-04","description":"Ruby Phrasebook gives you the code you need to quickly and effectively work with Ruby, one of the fastest-growing languages in the world thanks to popular new Ruby technologies like Ruby on Rails"},{"title":"IronRuby Unleashed","author":"Shay Friedman","image_url":"http://books.google.com/books/content?id=zLCocO_9E5gC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0672330784 {DBDEEDC0} IronRuby Unleashed [Friedman 2010-02-21].pdf","publisher":"Sams Publishing","copywrite":"2010-02-11","description":"This is the eBook version of the printed book. If the print book includes a CD-ROM, this content is not included within the eBook version. Ruby has built an enormous following of developers attracted by its intuitiveness, flexibility, and simplicity. Meanwhile, Microsoft’s .NET has grown and matured into a platform of unparalleled power. IronRuby brings them together, enabling developers to write elegant, efficient Ruby code that seamlessly integrates with .NET objects and leverages .NET’s full capabilities. Now, in IronRuby Unleashed, one of IronRuby’s most respected early adopters demonstrates how to write outstanding production software with the brand new IronRuby 1.0. Writing for both Ruby and .NET developers, Shay Friedman covers every facet of IronRuby programming. Friedman begins by explaining how IronRuby leverages the new Dynamic Language Runtime (DLR) libraries to run atop the .NET Framework and access its resources. Next, he presents an in-depth IronRuby tutorial that ranges from basic syntax and object-oriented programming techniques through advanced concepts. Building on this foundation, you’ll learn how to make the most of a broad spectrum of .NET platform features. IronRuby Unleashed thoroughly illuminates the use of IronRuby and .NET with today’s most powerful frameworks and technologies, including WPF, ASP.NET MVC, Ruby on Rails, and Silverlight. You’ll also find detailed coverage of unit testing, as well as cutting-edge techniques for extending IronRuby with C# or VB.NET. Detailed information on how to... Install IronRuby and choose the right development environment for your needs Master IronRuby syntax, methods, blocks, classes, modules, libraries, and more Write code that takes advantage of IronRuby’s dynamic and metaprogramming features Utilize .NET services and frameworks to write more powerful Ruby code than ever before Incorporate efficient data access into your IronRuby applications Use IronRuby to build Windows software with both WinForms and WPF Rapidly build high-quality Web applications with IronRuby and Ruby on Rails Create rich Web 2.0 applications with IronRuby and Microsoft Silverlight Test .NET code with Ruby’s leading unit testing frameworks Run IronRuby code from other .NET code, and create .NET code libraries that fit well with IronRuby code"},{"title":"Programming Ruby Second Edition","author":"David Thomas, Chad Fowler, Andrew Hunt","image_url":"http://books.google.com/books/content?id=2LulngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0974514055 {F93B2B55} Programming Ruby (2nd ed.) [Thomas, Fowler & Hunt 2004-10-11].pdf","publisher":"Pragmatic Publishing","copywrite":"2004-10-11","description":"Summary: Ruby 1.9 was a major release of the language: it introduced multinationalization, new block syntax and scoping rules, a new, faster, virtual machine, and hundreds of new methods in dozens of new classes and modules. Ruby 2.0 is less radical--it has keyword arguments, a new regexp engine, and some library changes. This book describes it all. The first quarter of the book is a tutorial introduction that gets you up to speed with the Ruby language and the most important classes and libraries. Download and play with the hundreds of code samples as your experiment with the language. The second section looks at real-world Ruby, covering the Ruby environment, how to package, document, and distribute code, and how to work with encodings. The third part of the book is more advanced. In it, you'll find a full description of the language, an explanation of duck typing, and a detailed description of the Ruby object model and metaprogramming. The book ends with a reference section: comprehensive and detailed documentation of Ruby's libraries. You'll find descriptions and examples of more than 1,300 methods in 58 built-in classes and modules, along with brief descriptions of 97 standard libraries. Ruby makes your programming more productive; it makes coding fun again. And this book will get you up to speed with the very latest Ruby, quickly and enjoyably."},{"title":"Build Your Own Ruby on Rails Web Applications","author":"Patrick Lenz","image_url":"https://images-eu.ssl-images-amazon.com/images/I/51JHC8PUNZL._AC_US160_.jpg","category_id":10,"type_id":1,"url":"Ruby and Rails/0975841955 {EDA83849} Build Your Own Ruby on Rails Web Applications_ The Ultimate Beginner's Guide to Ruby on Rails [Lenz 2007-02-09].pdf","publisher":"SitePoint","copywrite":"2007-02-09","description":""},{"title":"RJS Templates for Rails","author":"Cody Fauser","image_url":"http://books.google.com/books/content?id=oM1AZ4PlaycC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0596528094 {ADFF88EA} RJS Templates for Rails [Fauser 2006].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2006-06-12","description":"RJS templates are an exciting and powerful new type of template added to Rails 1.1. Unlike conventional Rails templates that generate HTML or XML, RJS templates generate JavaScript code that is executed when it is returned to the browser. This JavaScript generation allows you to perform multiple page updates in-place without a page reload using Ajax. All the JavaScript you need is generated from simple templates written in Ruby. This document helps you get acquainted with how RJS templates fit into the Rails framework and gets you started with a few easy-to-follow examples."},{"title":"Learn to Program - Ruby","author":"Chris Pine","image_url":"http://books.google.com/books/content?id=eYohAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0976694042 {4B9FFE2C} Learn to Program (2nd ed.) (Ruby) [Pine 2006-01-23].pdf","publisher":"Pragmatic Publishing","copywrite":"2005","description":"Provides instructions for writing programs using the Ruby programming language."},{"title":"Best of Ruby Quiz","author":"James Edward Gray","image_url":"http://books.google.com/books/content?id=bMggAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0976694077 {96F97A2E} Best of Ruby Quiz [Gray 2006-03-23].pdf","publisher":"Pragmatic Publishing","copywrite":"2006","description":"Solve these twenty-five popular programming puzzles, and sharpen your programming skills as you craft solutions. You'll find interesting and challenging programming puzzles including: 800 Numbers Crosswords Cryptograms Knight's Tour Paper, Rock, Scissors Tic-Tac-Toe Texas Hold-Em ...and more. Learning to program can be quite a challenge. Classes and books can get you so far, but at some point you have to sit down and start playing with some code. Only by reading and writing real code, with real problems, can you learn. The Ruby Quiz was built to fill exactly this need for Ruby programmers. Challenges, solutions, and discussions combine to make Ruby Quiz a powerful way to learn Ruby tricks. See how algorithms translate to Ruby code, get exposure to Ruby's libraries, and learn how other programmers use Ruby to solve problems quickly and efficiently."},{"title":"Enterprise Integration with Ruby","author":"Maik Schmidt","image_url":"http://books.google.com/books/content?id=6qdQAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0976694069 {1F31B794} Enterprise Integration with Ruby [Schmidt 2006-05-05].pdf","copywrite":"2006","description":"Following this book's tips and techniques, readers learn how to glue disparate enterprise-class systems together using Enterprise Integration."},{"title":"Rails Recipes","author":"Chad Fowler","image_url":"http://books.google.com/books/content?id=1wCVuAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0977616606 {572EAD29} Rails Recipes [Fowler 2006-06-19].pdf","publisher":"Pragmatic Publishing","copywrite":"2012","description":"Provides information on creating Web-based applications using Ruby."},{"title":"From Java to Ruby","author":"Bruce Tate","image_url":"http://books.google.com/books/content?id=0hrAygAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0976694093 {5CEF3BDE} From Java to Ruby_ Things Every Manager Should Know [Tate 2006-07-01].pdf","copywrite":"2006","description":"Based on a decision tree, this guide stays above the low-level technical debate to examine the real benefits and risks to adoption of Ruby. Packed with interviews of Ruby customers and developers, it addresses risk and fitness of purpose, and walks readers through the whole lifecycle of prototype, ramp up, and production and deployment."},{"title":"Everyday Scripting with Ruby","author":"Brian Marick","image_url":"http://books.google.com/books/content?id=1vKBQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0977616614 {06AE90F9} Everyday Scripting with Ruby_ for Teams, Testers, and You [Marick 2007-02-02].pdf","publisher":"Pragmatic Bookshelf","copywrite":"2006","description":"Provides information on the basics of the Ruby scripting language and how to create scripts using test-driven design."},{"title":"Deploying Rails Applications","author":"Ezra Zygmuntowicz, Bruce Tate, Clinton Begin","image_url":"http://books.google.com/books/content?id=N63-NwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0978739205 {C40A2D54} Deploying Rails Applications_ A Step-by-Step Guide [Zygmuntowicz, Tate & Begin 2008-05-17].pdf","copywrite":"2008","description":"Provides information on optimizing Rails applications, covering such topics as working with source controls, setting up a Rails/nginx/Mongrel cluster, and depolying applications to multiple production servers."},{"title":"Advanced Rails Recipes","author":"Mike Clark, Chad Fowler, Rails Community","image_url":"http://books.google.com/books/content?id=6a1cAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/0978739221 {9D73EC81} Advanced Rails Recipes [Clark 2008-05-15].pdf","publisher":"Pragmatic Bookshelf","copywrite":"2008","description":"From the author of the indispensable \"Rails Recipes,\" and with the help of a new master Rails chef in the kitchen, here are 72 new ways to kick one's Ruby on Rails apps up a notch--a collection of practical recipes for dressing up one's Wzeb application with little fuss."},{"title":"Ruby Programming for the Absolute Beginner","author":"Jerry Lee Ford","image_url":"http://books.google.com/books/content?id=_0YaSjsLDvkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1111222371 {D254D1F3} Ruby Programming [Ford 2010-10-22].pdf","publisher":"Course Technology PTR","copywrite":"2007","description":"A guide to Ruby programming covers such topics as working with objects, strings, and variables; implementing conditional logic; working with Regular Expressions; object-oriented programming; and debugging."},{"title":"Foundation Rails 2","author":"Eldon Alameda","image_url":"http://books.google.com/books/content?id=_NJ3ZhYcQcMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1430210397 {9477E116} Foundation Rails 2 [Alameda 2008-10-23].pdf","publisher":"Apress","copywrite":"2008-11-23","description":"You've heard about this amazing web framework called Ruby on Rails that's taken the world by storm, but thought it was way too complex for you? Think again. Foundation Rails 2 takes you through your first steps in Rails, explaining in plain English how to start building dynamic web applications. And there's never been a better time to jump in to the Rails world, as the release of Rails 2 was a major evolutionary leap forward from previous versions. Unlike other Rails books, this book doesn't throw you into the deep end right away in the hopes that you'll learn to swim. Instead, we'll start out with the basics and continually expand your knowledge until, by the end of the book, we're building a Rails application with dynamic features such as user registration, geocoding, filtering results with AJAX, RSS feeds, and an XML interface. Meanwhile, we'll talk about the important issues that other books often leave out such as testing your application's code, securing your application from hackers, optimizing your code for the best performance, and of course, deploying your application. This book takes a focused approach to guiding you through understanding how the pieces of Rails work individually and how they fit together. Instead of emphasizing boring theoretical discussions, Foundation Rails 2 lets you get your hands dirty with the framework and learn the hows and whys of Rails faster than ever. We start with a tour of what makes Rails special and why you need to learn it, move into a gentle introduction to the high points of programming in Ruby, and then take a tour of a sample Rails application. Next, we dig deeper into the core components of Rails before building a complete Rails application together. By the end of this book, not only will you know how to build Rails applications but you'll understand the reasons behind what you do."},{"title":"Simply Rails 2","author":"Patric Lenz","image_url":"https://images-eu.ssl-images-amazon.com/images/I/513Zq2ILiOL._AC_US160_.jpg","category_id":10,"type_id":1,"url":"Ruby and Rails/0980455200 {9CB85AAD} Simply Rails 2 [Lenz 2008-05-17].pdf","publisher":"SitePoint","copywrite":"2008-05-17","description":"Want to learn all about Ruby on Rails 2.0, the web application framework that is inspiring developers around the world?\n\nThe second edition of this practical, hands on book will:\n•show you how to install Ruby on Rails on Windows, Mac, or Linux\n•walk you, step by step, through the development of a Web 2.0 social news application, just like digg.com\n•show you how to test, debug, benchmark, and deploy your Rails application\nUnlike other Rails books, this book doesn't assume that you are an experienced web developer, or that you've used Ruby before. An entire chapter is devoted to learning Ruby in a fun way, using the interactive Ruby console, so you can follow along at home. You'll be an accomplished Ruby programmer in no time!\nThe example application that the book builds - a user-generated news web site - is built upon with each following chapter, and concepts such as sessions, cookies and basic AJAX usage are gradually introduced. Different aspects of Rails, such as user authentication, session cookies, and automated testing are explored with each feature that is added to the application.\n\nThe book finishes with chapters on debugging, benchmarking and deployment to a live web server.\n\nBy the end of the book, you'll have built a fully-featured Web 2.0 application and deployed it to the Web. And all code is up-to-date for Rails 2.0, so you can begin coding immediately with the latest version of Rails."},{"title":"NetBeans Ruby and Rails IDE with JRuby","author":"Chris Kutler, Brian Leonard","image_url":"http://books.google.com/books/content?id=mdoPbJriSC8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1430216360 {11244412} NetBeans Ruby and Rails IDE with JRuby [Kutler & Leonard 2008-12-16].pdf","publisher":"Apress","copywrite":"2009-02-26","description":"As Ruby and Rails continues to grow, and more and more jobs are coming online that require you to effectively develop Ruby and Rails in the web tier. Beyond the Rails framework, there are still very few proven tools and IDEs to get the job done, at least until now. The NetBeans Ruby and Rails IDE, according to some, is by far the best and proven IDE in Ruby and Rails. Who would've thought a Java IDE could do Ruby and Rails? Published with the developer in mind, firstPress technical briefs explore emerging technologies that have the potential to be critical for tomorrow's industry. Apress keeps developers one step ahead by presenting key information as early as possible in a PDF of 150 pages or less. Explore the future through Apress with NetBeansTM Ruby and Rails IDE with JRuby, an officially endorsed NetBeans project book, which is for Ruby and Rails programmers who want to take advantage of the NetBeans IDE to facilitate their Ruby and/or Rails web application development. Shows you how to use the NetBeans IDE 6.5 in the Ruby and Rails development processes Gives you in–depth information to help you configure the working environment for your specific Ruby interpreter, application server, and database server Showcases the NetBeans features that enhance your productivity from project creation, to editing, debugging, and testing Authors Chris Kutler and Brian Leonard work closely with both the developers of the NetBeans Ruby and Rails IDE project and the user community. The authors' in–depth knowledge of the numerous product features, in addition to an understanding of how the community uses the product to meet their development practices, enables them to present you the essential information necessary to efficiently and effectively use the tools of this IDE."},{"title":"Beginning Ruby From Novice to Professional","author":"Peter Cooper","image_url":"http://books.google.com/books/content?id=MiGpDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1430223634 {F96D429D} Beginning Ruby_ From Novice to Professional (2nd ed.) [Cooper 2009-07-19].pdf","publisher":"Apress","copywrite":"2016-07-11","description":"Learn the principles behind object-oriented programming and within a few chapters create a fully functional Ruby application. You'll also gain a basic understanding of many ancillary technologies such as databases, XML, web frameworks, and networking - some of which are needed as part of a fully functioning Ruby application. Based on the bestselling first and second editions, Beginning Ruby, Third Edition is a leading guide to learn Ruby from the ground up. The new edition of this book provides the same excellent introduction to Ruby as the previous editions plus updates for the newest version of Ruby 2.3. This book can also be used as a textbook or companion to a textbook on beginning Ruby programming. The light and agile Ruby programming language remains a very popular open source scripting option for developers building today's web and even some enterprise applications. And, now, Ruby also has applications using the Raspberry Pi, popular among hobbyists and makers. Many former Java developers still use Ruby on Rails today, the most popular framework for building Ruby applications. What You'll Learn Discover the fundamentals of Ruby and its object-oriented building blocks Use the Ruby libraries, gems, and documentation Work with files and databases Write and deploy Ruby applications Harness the various Ruby web frameworks and how to use them Do network programming with Ruby Who This Book Is For Beginning programmers, programmers new to Ruby, and web developers interested in learning and knowing the foundations of the Ruby programming language."},{"title":"Beginning Rails 3","author":"Adam Gamble, Cloves Carneiro Jr, Rida Al Barazi","image_url":"http://books.google.com/books/content?id=mdnTAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1430224339 {A0C8EC40} Beginning Rails 3 [Carneiro & Barazi 2010-08-30].pdf","publisher":"Apress","copywrite":"2010-08-30","description":"Beginning Rails 4 is a book that will guide you from never having programmed with Ruby, to having a Rails application built and deployed to the web. You’ll learn how to combine all the components of Rails to develop your own web applications. You will use test driven development to make sure your application works exactly like you expect. You will learn how to use Git for source control and best practice techniques to create applications like a pro. Essential, and often-missed, information on testing and learning to program with Ruby are also covered. This book is well suited for someone with little to no Ruby or Rails experience, or possibly even someone with no experience developing web applications at all. Beginning Rails 4 does assume a basic familiarity with the web and typical web terms, but doesn’t require you to be an expert of these. This book will springboard your journey into web application development, and show you how much fun building web applications with Ruby on Rails can be. Learn to create Rails applications from the bottom up Learn the basics of the Ruby programming language Completely updated for Rails 4, including new information on turbo links, etc. Beginning Rails 4 gently guides you through designing your application, writing tests for the application, and then writing the code to make your application work as expected."},{"title":"Beginning Rails 4","author":"Adam Gamble, Cloves Carneiro Jr, Rida Al Barazi","image_url":"http://books.google.com/books/content?id=mdnTAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1430260343 {B150251D} Beginning Rails 4 (3rd ed.) [Gamble, Carneiro & Barazi 2013-09-10].pdf","publisher":"Apress","copywrite":"2014-01-20","description":"Beginning Rails 4 is a book that will guide you from never having programmed with Ruby, to having a Rails application built and deployed to the web. You’ll learn how to combine all the components of Rails to develop your own web applications. You will use test driven development to make sure your application works exactly like you expect. You will learn how to use Git for source control and best practice techniques to create applications like a pro. Essential, and often-missed, information on testing and learning to program with Ruby are also covered. This book is well suited for someone with little to no Ruby or Rails experience, or possibly even someone with no experience developing web applications at all. Beginning Rails 4 does assume a basic familiarity with the web and typical web terms, but doesn’t require you to be an expert of these. This book will springboard your journey into web application development, and show you how much fun building web applications with Ruby on Rails can be. Learn to create Rails applications from the bottom up Learn the basics of the Ruby programming language Completely updated for Rails 4, including new information on turbo links, etc. Beginning Rails 4 gently guides you through designing your application, writing tests for the application, and then writing the code to make your application work as expected."},{"title":"Ruby Quick Syntax Reference","author":"Matt Clements","image_url":"http://books.google.com/books/content?id=WVEnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/143026568X {A6211834} Ruby Quick Syntax Reference [Clements 2014-12-03].pdf","publisher":"Apress","copywrite":"2014-12-01","description":"Ruby Quick Syntax Reference is a condensed code and syntax reference to the Ruby scripting language. It presents the essential Ruby syntax in a well-organized format that can be used as a handy reference. You won't find any technical jargon, bloated samples, drawn out history lessons, or witty stories in this book. What you will find is a language reference that is concise, to the point and highly accessible. The book is packed with useful information and is a must-have for any Ruby programmer. In Ruby Quick Syntax Reference, you will find: A concise reference to the Ruby language syntax. Short, simple, and focused code examples. A well laid out table of contents and a comprehensive index, allowing easy review."},{"title":"Automation through Chef Opscode","author":"Navin Sabharwal, Manak Wadhwa","image_url":"http://books.google.com/books/content?id=umwLBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1430262958 {6E0DBFA1} Automation through Chef Opscode_ A Hands-on Approach to Chef [Sabharwal & Wadhwa 2014-07-16].pdf","publisher":"Apress","copywrite":"2014-07-17","description":"Automation through Chef Opscode provides an in-depth understanding of Chef, which is written in Ruby and Erlang for configuration management, cloud infrastructure management, system administration, and network management. Targeted at administrators, consultants, and architect, the book guides them through the advanced features of the tool which are necessary for infrastructure automation, devops automation, and reporting. The book presumes knowledge of Ruby and Erlang which are used as reference languages for creating recipes and cookbooks and as a refresher on them to help the reader get on speed with the flow of book. The book provides step by step instructions on installation and configuration of Chef, usage scenarios of Chef, in infrastructure automation by providing common scenarios like virtual machine provisioning, OS configuration for Windows, Linux, and Unix, provisioning and configuration of web servers like Apache along with popular databases like MySQL. It further elaborates on the creation of recipes, and cookbooks, which help in deployment of servers and applications to any physical, virtual, or cloud location, no matter the size of the infrastructure. The books covers advanced features like LWRPs and Knife and also contains several illustrative sample cookbooks on MySQL, Apache, and CouchDB deployment using a step by step approach.","tag_list":"cloud"},{"title":"Computer Science Programming Basics in Ruby","author":"Ophir Frieder, Gideon Frieder, David Grossman","image_url":"http://books.google.com/books/content?id=T84ocHBqvEUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1449355978 {EBC03C1D} Computer Science Programming Basics in Ruby_ Exploring Concepts and Curriculum with Ruby [Frieder, Frieder & Grossman 2013-05-04].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2013-04-18","description":"If you know basic high-school math, you can quickly learn and apply the core concepts of computer science with this concise, hands-on book. Led by a team of experts, you’ll quickly understand the difference between computer science and computer programming, and you’ll learn how algorithms help you solve computing problems. Each chapter builds on material introduced earlier in the book, so you can master one core building block before moving on to the next. You’ll explore fundamental topics such as loops, arrays, objects, and classes, using the easy-to-learn Ruby programming language. Then you’ll put everything together in the last chapter by programming a simple game of tic-tac-toe. Learn how to write algorithms to solve real-world problems Understand the basics of computer architecture Examine the basic tools of a programming language Explore sequential, conditional, and loop programming structures Understand how the array data structure organizes storage Use searching techniques and comparison-based sorting algorithms Learn about objects, including how to build your own Discover how objects can be created from other objects Manipulate files and use their data in your software"},{"title":"Ruby Cookbook","author":"Lucas Carlson, Leonard Richardson","image_url":"http://books.google.com/books/content?id=xBmkBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1449373712 {75A73967} Ruby Cookbook_ Recipes for Object-Oriented Scripting (2nd ed.) [Carlson & Richardson 2015-03-25].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2015-03-24","description":"Why spend time on coding problems that others have already solved when you could be making real progress on your Ruby project? This updated cookbook provides more than 350 recipes for solving common problems, on topics ranging from basic data structures, classes, and objects, to web development, distributed programming, and multithreading. Revised for Ruby 2.1, each recipe includes a discussion on why and how the solution works. You’ll find recipes suitable for all skill levels, from Ruby newbies to experts who need an occasional reference. With Ruby Cookbook, you’ll not only save time, but keep your brain percolating with new ideas as well. Recipes cover: Data structures including strings, numbers, date and time, arrays, hashes, files and directories Using Ruby’s code blocks, also known as closures OOP features such as classes, methods, objects, and modules XML and HTML, databases and persistence, and graphics and other formats Web development with Rails and Sinatra Internet services, web services, and distributed programming Software testing, debugging, packaging, and distributing Multitasking, multithreading, and extending Ruby with other languages"},{"title":"Customizing Chef","author":"Jon Cowie","image_url":"http://books.google.com/books/content?id=XOBdBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/149194935X {71022E4E} Customizing Chef_ Getting the Most out of Your Infrastructure Automation [Cowie 2014-09-19].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2014-08-28","description":"Take advantage of Chef’s highly customizable design to tackle specific automation issues that you can’t solve by simply using Chef’s tools, resources, and services out of the box. With this practical guide, you’ll examine the internal structure of this configuration management technology and learn where, how, and why to add custom code. Author Jon Cowie not only provides code snippets and practical advice for customizing Chef, but also helps you determine case by case whether it’s in your best interests to customize at all. If you have intermediate-to-advanced Chef experience, this book is indispensable. Explore Chef’s typical setups and why you’d want to customize them Learn the Ruby concepts needed to write customizations Customize the Chef run process and explore Chef’s internal classes Gain more insight into your Chef runs through handlers and Chef’s event stream Level up your Chef recipes by writing your own resources and providers Create and extend plugins for Knife—Chef’s command-line tool Interact with the Chef API to write scripts and reports Learn how to contribute customizations to the Chef community","tag_list":"cloud"},{"title":"Learning MCollective","author":"Jo Rhett","image_url":"http://books.google.com/books/content?id=JdxFBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1491945672 {7782C3BF} Learning MCollective_ Parallel Server Management in Puppet and Chef [Rhett 2014-08-31].pdf","publisher":"\"O'Reilly Media, Inc.\"","copywrite":"2014-08-13","description":"Orchestrate change across server clusters in near realtime with MCollective, the framework that works in concert with Puppet, Chef, and other configuration management tools. Ideal for system administrators and operations or DevOps engineers at any level, this hands-on guide teaches you how to build and test a real installation of MCollective servers and clients in your environment. Learn how to build an entire installation by hand, know where every configuration file lives, and understand every configuration parameter and what it means. Whether you manage a small environment or one that’s immense in scale, this book shows you how to orchestrate specific actions faster and better than you do now. Tour MCollective’s architecture, backbone, transport, and security controls Configure MCollective components to match your production environment Create and use collectives to handle thousands of remote MCollective agents Use ActiveMQ Network of Brokers to resolve multi-site or redundancy requirements Learn how to use community-built client and agent plugins, with concrete examples Create your own server and client plugins to perform a variety of actions Learn recommended best practices for using MCollective","tag_list":"cloud"},{"title":"Beginning Ruby on Rails E-Commerce","author":"Jarkko Laine, Christian Hellsten","image_url":"http://books.google.com/books/content?id=o0JuxK5_1esC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590597362 {BA1BC9AB} Beginning Ruby on Rails E-Commerce_ From Novice to Professional [Hellsten & Laine 2006-11-09].pdf","publisher":"Apress","copywrite":"2007-04-30","description":"Ruby on Rails offers developers the opportunity to create fully-featured web applications in double-quick time. Rails and e-commerce are a match made in heaven and Beginning Ruby on Rails E-Commerce is the first book to directly target this market. The book explains, via real-life scenarios, how to use Rails to create every aspect of an online store – from creating a product catalog, to building a reliable shopping cart system, all the way to features and functions like customer feedback forums. This combination of high sophistication and broad focus makes this an essential working reference – the book all developers are calling for."},{"title":"Rails Solutions","author":"Justin Williams","image_url":"http://books.google.com/books/content?id=0MEn8moAsYQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590597524 {58606924} Rails Solutions_ Ruby on Rails Made Easy [Williams 2007-01-24].pdf","publisher":"Apress","copywrite":"2007-04-01","description":"Standing out from other Rails references, this book meets the needs of designers who are not advanced programmers: sophisticated users who may find reams of code intimidating. Rails Solutions gives readers the tools to assemble dynamic sites quickly and easily. After a gentle introduction, the book walks the reader through setting up the development environment and the basics of Ruby syntax. Next, the book details the construction of real-world applications including a message posting system with data authentication, a file uploader, Ajax enhancements, and more. Coverage includes as customizing views, Rails helpers, add-ons and plugins, and Rails deployment tips."},{"title":"Practical Rails Projects","author":"Eldon Alameda","image_url":"http://books.google.com/books/content?id=87YaAtJn5BQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590597818 {26A691F5} Practical Rails Projects [Alameda 2007-10-29].pdf","publisher":"Apress","copywrite":"2007-12-27","description":"This book provides intermediate Rails users with an essential learning aid to take them to higher level, teaching them countless real world techniques via a series of practical project-based chapters. Each chapter takes the reader through the complete process of building up a full-functional Rails web application. Projects taught in the book include a blog, a REST-based task manager, an online IT help desk, a web comic (including image upload facilities,) Wiki, and much more. Techniques learned include speeding up development with plugins, engines and Ruby Gems, styling with CSS libraries, and adding dynamism using Ajax."},{"title":"Beginning Google Maps Applications with Rails and Ajax","author":"Andre Lewis, Cameron Turner, Jeffrey Sambells, Michael Purvis","image_url":"http://books.google.com/books/content?id=lUAnCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590597877 {2A59501E} Beginning Google Maps Applications with Rails and AJAX_ From Novice to Professional [Lewis, Purvis, Sambells & Turner 2008-02-19].pdf","publisher":"Apress","copywrite":"2007-05-02","description":"The Google Maps API is a showcase example of the Web 2.0 development paradigm, designed to be invitingly simple for developers to incorporate dynamic mapping services into Web applications. Beginning Google Maps Applications with Rails and Ajax takes a developer’s perspective, showing how to integrate mapping features into their Rails-driven Web applications. The book shows how to draw on data sources such as the U.S. Census Bureau’s TIGER/Line data and Google's own geocoding feature to build comprehensive geocoding services. The book includes guided examples demonstrating how to encourage user interaction such as pinpointing map locations, adding comments, and building community-driven maps.","tag_list":"google maps"},{"title":"Practical Ruby Gems","author":"David Berube","image_url":"http://books.google.com/books/content?id=QC0rgGTmeNAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590598113 {3C4B2068} Practical Ruby Gems [Berube 2007-04-15].pdf","publisher":"Apress","copywrite":"2007-09-09","description":"This book is a comprehensive guide to utilizing and creating Ruby Gems. Coverage provides an enormous code library that will help developers improve their projects. It details 34 of the best and most useful Gems, including ones to speed up web applications, process credit card payments, produce PDF documents, read and update RSS feeds, and acquire real-time shipping prices from FedEx and UPS. Each of these also comes complete with actual use cases and code examples that readers can immediately use in their own projects. In addition, the book describes how readers can package and distribute their own Ruby Gems."},{"title":"Practical Ruby for System Administration","author":"Andre Ben-Hamou","image_url":"http://books.google.com/books/content?id=8vVEYUwGWHgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590598210 {E27410C1} Ruby for System Administration [Hamou 2007-06-27].pdf","publisher":"Apress","copywrite":"2007-10-15","description":"Within the pages of Practical Ruby for System Administration, you'll learn the Ruby way to construct files, tap into clouds of data, build domain-specific languages, perform network traffic analysis, and more. Coverage places equal emphasis on fundamental Ruby concepts as well as practical how-tos. Based on author André Ben Hamou's own experiences working as a system administrator, this book will help you pick up practical tips on Ruby coding style, learn how to analyze and improve script performance, and make use of no-nonsense advice on scripting workflow, including testing, documentation, and version control."},{"title":"Pro Active Record","author":"Chad Pytel, Jonathan Yurek, Kevin Marshall","image_url":"http://books.google.com/books/content?id=ZABbAAgtR2cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590598474 {DB268305} Pro Active Record_ Databases with Ruby and Rails [Marshall, Pytel & Yurek 2007-09-14].pdf","publisher":"Apress","copywrite":"2007-11-15","description":"Pro ActiveRecord for Ruby helps you take advantage of the full power of your database engine from within your Ruby programs and Rails applications. It walks you through every step from the basics of getting and installing the ActiveRecord library to working with legacy schema to using features specific to each of today's most popular database engines, including Oracle, MS SQL, and MySQL. You'll come to a deep understanding of ActiveRecord that will enable you to truly exploit all that Ruby, Rails, and your chosen database platform have to offer."},{"title":"Practical JRuby on Rails Web 2.0 Projects","author":"Ola Bini","image_url":"http://books.google.com/books/content?id=Kodt7rpt9b0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590598814 {16C08B77} Practical JRuby on Rails Web 2.0 Projects_ Bringing Ruby on Rails to the Java Platform [Bini 2007-09-26].pdf","publisher":"Apress","copywrite":"2007-12-01","description":"In this book, JRuby core developer Ola Bini covers everything you need to know to take full advantage of what JRuby has to offer. It provides complete coverage on how to use JRuby to create web applications faster and more efficiently, while continuing to take advantage of the vast power of the Java platform. The book also provides several real-world projects that illustrate the crucial specifics you need to know about the interaction of Java and Ruby. In addition, it offers helpful, practical instruction and discussion on how web applications can be deployed using a variety of popular servers such as Apache and Mongrel."},{"title":"Practical Rails Social Networking Sites","author":"Alan Bradburne","image_url":"http://books.google.com/books/content?id=kglPH-IpjpcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590598415 {3292D1BF} Practical Rails Social Networking Sites [Bradburne 2007-06-27].pdf","publisher":"Apress","copywrite":"2007-10-17","description":"Practical Ruby on Rails Social Networking Sites shows you the complete development cycle of a social networking community web site. You will learn how to make the best use of the Ruby on Rails framework within a large project and how to implement and adapt features specific to a community. The book offers practical advice and tips for developing and testing, along with guidance on how to take your site live, as well as optimize and maintain it. It also explores how to integrate with other community sites and how to make good use of Rails' Ajax features. You will also learn how to optimize and adapt your site to work well on mobile browsers."},{"title":"Practical Reporting with Ruby and Rails","author":"David Berube","image_url":"http://books.google.com/books/content?id=H1yi3htEAZgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590599330 {548678FE} Practical Reporting with Ruby and Rails [Berube 2008-02-03].pdf","publisher":"Apress","copywrite":"2008-03-30","description":"Business intelligence and real-time reporting mechanisms play a major role in any of today’s forward-looking business plans. With many of these solutions being moved to the Web, the popular Rails framework and its underlying Ruby language are playing a major role alongside web services in building the reporting solutions of tomorrow. This book offers a comprehensive introduction to this popular framework. It shows you how the Ruby language and Rails framework can create truly compelling reporting services by plugging into popular third-party applications and services such as Google AdWords, UPS.com, iTunes, and SalesForce.com."},{"title":"Practical Ruby Projects","author":"Christopher Cyll","image_url":"http://books.google.com/books/content?id=93y-8DRUAz8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/159059911X {EF161B70} Practical Ruby Projects_ Ideas for the Eclectic Programmer [Cyll 2007-12-18].pdf","publisher":"Apress","copywrite":"2008-03-11","description":"Revitalized by Ruby on Rails, the Ruby language continues to grow in popularity. Books like this are necessary to fill the demand. Here is a classic of its kind; required reading for Ruby programmers who have already mastered the basics and want to learn higher level techniques. Practical Ruby Projects presents nine diverse projects that will teach new and innovative techniques in a learn-by-example fashion. They include a turn-based adventure game and a generative music creator. While there are many other Ruby titles, none of them take this unique project-based approach to teaching."},{"title":"Ruby by Example","author":"Kevin C. Baird","image_url":"http://books.google.com/books/content?id=kq2dBNdAl3IC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1593271484 {6FA9F890} Ruby by Example_ Concepts and Code [Baird 2007-06-08].pdf","publisher":"No Starch Press","copywrite":"2007","description":"Presents an analysis of Ruby scripts, examining how the code works, the concepts of the code, and ways to modify it."},{"title":"Practical REST on Rails 2 Projects","author":"Ben Scofield","image_url":"http://books.google.com/books/content?id=en9Uy9JNQl0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1590599942 {FAB46472} Practical Rest on Rails 2 Projects [Scofield 2008-04-28].pdf","publisher":"Apress","copywrite":"2008-04-29","description":"Practical REST on Rails 2 Projects is a guide to joining the burgeoning world of open web applications. It argues that opening up your application can provide significant benefits and involves you in the entire process—from setting up your application, to creating clients for it, to handling success and all its attendant problems. This book is the essential resource for anyone who wants to make their web application a full participant in the new Internet This book is intended for intermediate–to–advanced Rails developers—people who use Rails regularly for sites and applications more complicated than the prototypical roll–your–own blog In particular, it’s targeted at Rails developers who want to be good Web 2.0 citizens—sharing the functionality of their app with other sites to the betterment of everyone Application projects include iPhone, Facebook, and REST for the enterprise What you’ll learn Develop REST web services in Rails 2 Framework Build from the server–side perspective and integrate with PHP Build from the client side using a JavaScript widget Develop RESTful application on Rails for the Apple iPhone Create a Facebook application using REST on Rails Examine REST on Rails for the Enterprise Who this book is for This book is intended for intermediate–to–advanced Rails developers—people who use Rails regularly for sites and applications more complicated than the prototypical roll–your–own blog."},{"title":"The Book of Ruby","author":"Huw Collingbourne","image_url":"http://books.google.com/books/content?id=ZDBbG41-BA8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1593272944 {DED0B922} The Book of Ruby_ A Hands-on Guide for the Adventurous [Collingbourne 2011-07-16].pdf","publisher":"No Starch Press","copywrite":"2011","description":"Covers the features of Ruby, including such topics as strings, class hierarchies, arrays and hashes, loops, methods, exception handling, symbols, YAML, and debugging."},{"title":"Ruby Under a Microscope","author":"Pat Shaughnessy","image_url":"http://books.google.com/books/content?id=P7AdAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1593275277 {9F0810A5} Ruby Under a Microscope_ An Illustrated Guide to Ruby Internals [Shaughnessy 2013-11-22].pdf","publisher":"No Starch Press","copywrite":"2013","description":"\"An under-the-hood look at how the Ruby programming language runs code. Extensively illustrated with complete explanations and hands-on experiments. Covers Ruby 2.x\"--"},{"title":"Ruby Wizardry","author":"Eric Weinstein","image_url":"http://books.google.com/books/content?id=oEvDBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1593275668 {0042FC0F} Ruby Wizardry_ An Introduction to Programming for Kids [Weinstein 2014-12-18].pdf","publisher":"No Starch Press","copywrite":"2014-12-14","description":"Ruby Wizardry is a playful, illustrated tale that will teach you how to program in Ruby by taking you on a fantastical journey. As you follow the adventures of young heroes Ruben and Scarlet, you’ll learn real programming skills, like how to: Use fundamental concepts like variables, symbols, arrays, and stringsWork with Ruby hashes to create a programmable breakfast menuControl program flow with loops and conditionals to help the Royal PlumberTest your wild and crazy ideas in IRB and save your programs as scriptsCreate a class of mini-wizards, each with their own superpower!Organize and reuse your code with methods and listsWrite your own amazing interactive stories using Ruby Along the way, you’ll meet colorful characters from around the kingdom, like the hacker Queen, the Off-White Knight, and Wherefore the minstrel. Ruby Wizardry will have you (or your little wizard) hooked on programming in no time. For ages 10+ (and their parents!)"},{"title":"Rails Crash Course","author":"Anthony Lewis","image_url":"http://books.google.com/books/content?id=niMBBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1593275722 {F4CD4FC6} Rails Crash Course_ A No-Nonsense Guide to Rails Development [Lewis 2014-10-16].pdf","publisher":"No Starch Press","copywrite":"2014-10-08","description":"Rails is a robust, flexible development platform that lets you build complex websites quickly. Major websites like GitHub, Hulu, and Twitter have run Rails under the hood, and if you know just enough HTML and CSS to be dangerous, Rails Crash Course will teach you to harness Rails for your own projects and create web applications that are fast, stable, and secure. In Part I, you’ll learn Ruby and Rails fundamentals and then dive straight into models, controllers, views, and deployment. As you work through the basics, you’ll learn how to: * Craft persistent models with Active Record * Build view templates with Embedded Ruby * Use Git to roll back to previous versions of your code base * Deploy applications to Heroku In Part II, you’ll take your skills to the next level as you build a social networking app with more advanced Ruby tools, such as modules and metaprogramming, and advanced data modeling techniques within Rails’s Active Record. You’ll learn how to: * Implement an authentication system to identify authorized users * Write your own automated tests and refactor your code with confidence * Maximize performance with the asset pipeline and turbolinks * Secure your app against SQL injection and cross-site scripting * Set up a server and deploy applications with Capistrano Each chapter is packed with hands-on examples and exercises to reinforce what you’ve learned. Whether you’re completely new to Ruby or you’ve been mucking around for a bit, Rails Crash Course will take you from the basics to shipping your first Rails application, fast."},{"title":"Rails 4 in Action","author":"Ryan Bigg, Yehuda Katz","image_url":"http://books.google.com/books/content?id=WFyeZwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1617291099 {D1666B06} Rails 4 in Action (2nd ed.) [Bigg, Katz & Klabnik 2015-01-31].pdf","publisher":"Manning Publications Company","copywrite":"2015-01-31","description":"Rails makes getting an application up and running easy, but how can a developer ensure that it continues to function well? The answer is Test and Behavior-Driven Development. These Agile approaches, combined with the advantages of the latest software version, make Rails 3 a powerful development framework. Rails 3 in Actioncovers developing a Rails 3.0 application from the ground-up using the industry's best practices in an Agile development fashion, tackling one feature at a time in order to build a solid, maintainable and scalable application. A comprehensive and hands-on guide, the authors show readers how to get the most out of Rails, including tips on leveraging the treasure-trove of community-provided code available."},{"title":"Learning Devise for Rails","author":"Hafiz Barie Lubis, Nia Mutiara, Giovanni Sakti","image_url":"http://books.google.com/books/content?id=kQy8AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1782167048 {72805FC4} Learning Devise for Rails [Hafiz, Mutiara & Sakti 2013-10-25].pdf","publisher":"Packt Publishing Ltd","copywrite":"2013-10-25","description":"A hands-on, step-by-step guide to using Devise for authentication in Rails.If you are a web developer who is getting started with Rails and you are looking for authentication solutions, then this is the book for you. If you are a current Rails developer who is looking to extend your authentication implementation with capabilities such as authorization and remote authentication, this book will also be great for you."},{"title":"Shopify Application Development","author":"Michael Larkin","image_url":"http://books.google.com/books/content?id=cKmkAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1783281057 {FC8CCBA7} Shopify Application Development_ Build Highly Effective Shopify Apps using the Powerful Ruby on Rails Framework [Larkin 2014-06-24].pdf","publisher":"Packt Publishing Ltd","copywrite":"2014-05-26","description":"This is an easy-to follow manual that will guide you through the entire process of application development with Shopify, beginning with the installation and configuration of your local development environment for your app to the deployment of the app to Heroku. If you are a web developer or a designer who wants to extend Shopify stores by building apps, then this book is for you. A basic understanding of programming concepts and some familiarity with Shopify is all that is required to get started with Shopify app development."},{"title":"Mastering Chef","author":"Mayank Joshi","image_url":"http://books.google.com/books/content?id=6vwKCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1783981563 {FBC52A02} Mastering Chef [Joshi 2015-03-31].pdf","publisher":"Packt Publishing Ltd","copywrite":"2015-06-29","description":"Chef is a configuration management tool that turns IT infrastructure into code. Chef provides tools to manage systems at scale. This book will take you through the Chef code, tools, and components to manage your environments using the Chef server efficiently. The book starts with an introduction to the Chef ecosystem, taking you through the terminologies used in Chef, the anatomy of a chef-client run, and Chef solo. You will learn how to use Knife and its associated plugins to accomplish daily routine tasks in a more efficient way. You will also learn how to speed this up by using Ruby with Chef, which will allow you to write more efficient infrastructure code. This book then introduces you to cookbooks and how to extend chef-client through the use of Lightweight Resource/Provider. It tells you how to keep all kind of configurations in key-value pair efficiently, by introducing you to data bags and templates. Then you will get a walkthrough of Chef's wonderful APIs and the extended functionalities of Chef. By the end of the book you will be so well-versed with Chef that you'll be able to explore some fun uses of Chef, which will allow for better productivity.","tag_list":"cloud"},{"title":"Learning Chef","author":"Rishabh Sharma, Mitesh Soni","image_url":"http://books.google.com/books/content?id=jeXuBwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1783285214 {3CB15470} Learning Chef [Sharma & Soni 2015-02-08].pdf","publisher":"Packt Publishing Ltd","copywrite":"2015-03-25","description":"If you are a system administrator, Linux administrator, cloud developer, cloud administrator, or someone who just wants to learn and apply Chef automation to your existing or new infrastructure, this book is for you. Some real-time understanding of IT processes and familiarity with Linux systems, Ruby, and JSON is essential.","tag_list":"cloud"},{"title":"Configuration Management with Chef-Solo","author":"Naveed ur Rahman","image_url":"http://books.google.com/books/content?id=20_lAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1783982462 {C12012F7} Configuration Management with Chef-Solo [ur Rahman 2014-07-15].pdf","publisher":"Packt Publishing Ltd","copywrite":"2014-06-25","description":"This is a step-by-step guide, full of hands-on examples of real-world deployment tasks. Each topic is explained and placed in context, while also pointing out the key details of the concepts used. This book is aimed at system administrators and system engineers who have an understanding of configuration management tools and infrastructure. For novice administrators, it contains easy-to-use application recipes to get started immediately.","tag_list":"cloud"},{"title":"Rails 4 Application Development HOTSHOT","author":"Saurabh Bhatia","image_url":"http://books.google.com/books/content?id=_etUAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1783286296 {891DE9E2} Rails 4 Application Development Hotshot [Bhatia 2014-04-14].pdf","publisher":"Packt Publishing Ltd","copywrite":"2014-04-10","description":"Attractive practical projects to polish your application building skills, through a straightforward, highly focused and interesting approach towards application development. If you are a developer who is already familiar with the basics of the Rails framework and have previously worked with Rails 3.2 or earlier, then this is the ideal book for you. It is assumed that you have some prior experience with the development of applications. This book will help you to upgrade your existing knowledge and also ensure its applicability. You will be expected to setup Rails, MySQL / PostgreSQL, Mongodb and required dependencies themselves."},{"title":"Bootstrap for Rails","author":"Syed Fazle Rahman","image_url":"http://books.google.com/books/content?id=gqDNBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/178398726X {F9726479} Bootstrap for Rails [Rahman 2015-02-25].pdf","publisher":"Packt Publishing Ltd","copywrite":"2015-02-24","description":"If you are a web developer who has a basic understanding of Ruby on Rails, this is the book for you. You should definitely have previous knowledge about HTML and how it works. However, CSS and JavaScript knowledge is optional for this book."},{"title":"Chef Essentials","author":"John Ewart","image_url":"http://books.google.com/books/content?id=p5efBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1783983043 {18CBE1E3} Chef Essentials [Ewart 2014-09-22].pdf","publisher":"Packt Publishing Ltd","copywrite":"2014-09-25","description":"If you have some understanding of IT infrastructure principles and are ready to find out what Chef is all about, then this guide will show you all you need to know. In order to get the most out of this book, some experience of programming or scripting languages would be useful.","tag_list":"cloud"},{"title":"Ruby on Rails Enterprise Application Development","author":"Elliot Smith, Rob Nichols","image_url":"http://books.google.com/books/content?id=WHZVAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1847190855 {BD251CC7} Ruby on Rails Enterprise Application Development_ Plan, Program, Extend [Smith & Nichols 2007-10-22].pdf","publisher":"Packt Publishing Ltd","copywrite":"2007-10-11","description":"The book aims to speed up the reader in Java EE 5 development. All major Java EE 5 APIs and the details of the GlassFish server are covered followed by examples of its use. This book is aimed at Java developers wishing to become proficient with Java EE 5, who are expected to have some experience with Java and to have developed and deployed applications in the past, but need no previous knowledge of Java EE or J2EE. It teaches the reader how to use GlassFish to develop and deploy applications."},{"title":"Ruby on Rails Web Mashup Projects","author":"Chang Sau Sheong","image_url":"http://books.google.com/books/content?id=pcOFfHNKt5cC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1847193935 {3D0835AA} Ruby on Rails_ Web Mashup Projects [Sheong 2008-04-24].pdf","publisher":"Packt Publishing Ltd","copywrite":"2008-04-24","description":"A step-by-step tutorial to building web mashups."},{"title":"Ruby and MongoDB Web Development Beginner's Guide","author":"Gautam Rege","image_url":"http://books.google.com/books/content?id=wUuBgNMG0F0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1849515026 {7E92DF4D} Ruby and MongoDB Web Development Beginner's Guide [Rege 2012-07-25].pdf","publisher":"Packt Publishing Ltd","copywrite":"2012-07-25","description":"Create dynamic web applications by combining the power of Ruby and MongoDB with this book and ebook."},{"title":"Ruby in Practice","author":"Jeremy McAnally, Assaf Arkin","image_url":"http://books.google.com/books/content?id=9fsoAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1933988479 {09133B71} Ruby in Practice [McAnally, Arkin, Katz, Black, Brown, Cooper & Melia 2009-04-07].pdf","publisher":"Manning Publications","copywrite":"2009","description":"A guide to Ruby programming covers such topics as scripting, Web services, asynchronous messaging, structured documents, and searching and indexing."},{"title":"Ruby for Rails","author":"David A. Black, David Heinemeier Hansson","image_url":"http://books.google.com/books/content?id=sC9vQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1932394699 {C67830AD} Ruby for Rails_ Ruby Techniques for Rails Developers [Black 2006-05-11].pdf","publisher":"Manning Publications","copywrite":"2006","description":"Provides information on creating Web-based applications using Ruby."},{"title":"Ruby Developer's Guide","author":"Robert Feldt","image_url":"https://images-eu.ssl-images-amazon.com/images/I/4173CCjBZBL._AC_US160_.jpg","category_id":10,"type_id":1,"url":"Ruby and Rails/1928994644 {51F58F15} Ruby Developer's Guide [Feldt, Johnson & Neumann 2002-01-18].pdf","publisher":"Syngress","copywrite":"2002-01-18","description":"Ruby Developers Guide A guide to Ruby, a popular Object-Oriented Programming Language. It is designed for programmers and developer's looking to embrace the object-oriented features and functionality of this robust programming language. It helps readers learn how to develop, implement, organize and deploy applications using Ruby."},{"title":"Building Dynamic Web 2.0 Websites with Ruby on Rails","author":"A. P Rajshekhar","image_url":"http://books.google.com/books/content?id=YLIBOsn66XEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1847193412 {301E1DAD} Building Dynamic Web 2.0 Websites with Ruby on Rails [Rajshekhar 2008-03-28].pdf","publisher":"Packt Publishing Ltd","copywrite":"2008-03-28","description":"Create database-driven dynamic websites with this open-source web application framework."},{"title":"FXRuby","author":"Lyle Johnson","image_url":"https://images-eu.ssl-images-amazon.com/images/I/41L2onMVXNL._AC_US160_.jpg","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356077 {8D9A4F0D} FXRuby_ Create Lean and Mean GUIs with Ruby [Johnson 2008-04-14].pdf","publisher":"Pragmatic Publishing","copywrite":"2008-04-14","description":"FXRuby is a highly object-oriented toolkit for building lean, mean, cross-platform graphical user interfaces in Ruby. Since its initial release in 2001, FXRuby has become one of the most popular GUI choices for Ruby developers. This book is your best resource for rapidly learning how to develop powerful, sophisticated GUIs in your favorite programming language.\n\nIf you're a newcomer to GUI programming, this book will introduce you to the basics of FXRuby programming by leading you through building a GUI application with FXRuby from start to finish. If you're an experienced software developer who just needs to get up to speed on FXRuby and what it can do for you, this book will help you put FXRuby to work in your Ruby-based applications. Along the way, you'll learn how to leverage FXRuby's vast collection of user interface elements to build visually rich user interfaces. You'll see how FXRuby uses the concept of sending messages between objects to implement event-driven applications, and how you can most effectively use layout managers to construct flexible user interfaces"},{"title":"Flexible Rails Flex 3 on Rails 2","author":"Peter Armstrong","image_url":"https://images-eu.ssl-images-amazon.com/images/I/51ea8TCMSFL._AC_US160_.jpg","category_id":10,"type_id":1,"url":"Ruby and Rails/1933988509 {922C0AC0} Flexible Rails_ Flex 3 on Rails 2 [Armstrong 2008-02-02].pdf","publisher":"Manning Publications","copywrite":"2009-11-01","description":"Flex 4 is an open-source tool that allows developers to easily add life to Web applications with dynamic user features, colorful transitions, and eye-catching animations."},{"title":"Programming Ruby 1.9 & 2.0","author":"David Thomas, Chad Fowler, Andrew Hunt","image_url":"http://books.google.com/books/content?id=2LulngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356085 {D4CA5C24} Programming Ruby 1.9 (3rd ed.) [Thomas, Fowler & Hunt 2009-04-28].pdf","copywrite":"2013","description":"Summary: Ruby 1.9 was a major release of the language: it introduced multinationalization, new block syntax and scoping rules, a new, faster, virtual machine, and hundreds of new methods in dozens of new classes and modules. Ruby 2.0 is less radical--it has keyword arguments, a new regexp engine, and some library changes. This book describes it all. The first quarter of the book is a tutorial introduction that gets you up to speed with the Ruby language and the most important classes and libraries. Download and play with the hundreds of code samples as your experiment with the language. The second section looks at real-world Ruby, covering the Ruby environment, how to package, document, and distribute code, and how to work with encodings. The third part of the book is more advanced. In it, you'll find a full description of the language, an explanation of duck typing, and a detailed description of the Ruby object model and metaprogramming. The book ends with a reference section: comprehensive and detailed documentation of Ruby's libraries. You'll find descriptions and examples of more than 1,300 methods in 58 built-in classes and modules, along with brief descriptions of 97 standard libraries. Ruby makes your programming more productive; it makes coding fun again. And this book will get you up to speed with the very latest Ruby, quickly and enjoyably."},{"title":"Developing Facebook Platform Applications with Rails","author":"Michael J. Mangino","image_url":"http://books.google.com/books/content?id=l09uLAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356123 {17CD4373} Facebook Platform Development with Rails [Mangino 2008-11-07].pdf","publisher":"Pragmatic Bookshelf","copywrite":"2008","description":"Internet."},{"title":"Scripted GUI Testing with Ruby","author":"Ian Dees","image_url":"http://books.google.com/books/content?id=WIUFPQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356182 {3E2FF82A} Scripted GUI Testing with Ruby [Dees 2008-08-15].pdf","copywrite":"2008","description":"Scripted GUI Testing with Ruby is a practical, quick-moving tutorial based on real life, and real-world GUI applications. Right out of the gate you'll start working with code to drive a desktop GUI. You'll discover the kinds of gotchas and edge cases that don't exist in simple, toy programs. As you add more tests, you'll learn how to organize your test code and write lucid examples. The result is a series of \"smoke tests\" team will run on Continuous Integration servers. Next, we'll explore a variety of different testing tips and tricks. You'll employ a series of increasingly random and punishing test monkeys to try to crash programs. Table-driven techniques will show you how to check dozens of different input combinations. See how to use longer acceptance tests (in the form of stories) to represent the way a typical customer would use your program. The book uses examples from Windows, OS X, and cross-platform Java desktop programs as well as Web applications. You'll develop test scripts in Ruby; you don't need to be a Ruby expert, but basic comfort with the language will be helpful."},{"title":"Programming Cocoa with Ruby","author":"Brian Marick","image_url":"https://images-na.ssl-images-amazon.com/images/I/51BDzZ1WJsL._AC_US160_.jpg","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356190 {25F2D3C3} Programming Cocoa with Ruby_ Create Compelling Mac Apps using RubyCocoa [Marick 2009-08-17].pdf","publisher":"Pragmatic Publishing","copywrite":"2009-08-17","description":"This is a book for the Ruby programmer who's never written a Mac app before. Through this hands-on tutorial, you'll learn all about the Cocoa framework for programming on Mac OS X. Join the author's journey as this experienced Ruby programmer delves into the Cocoa framework right from the beginning, answering the same questions and solving the same problems that you'll face."},{"title":"Security on Rails","author":"Ben Poweski, David Raphael","image_url":"http://books.google.com/books/content?id=krOuPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356484 {F9B36EE7} Security on Rails [Poweski & Raphael 2009-12-29].pdf","copywrite":"2009","description":"Provides information on ways to defend Rails applications from attacks."},{"title":"Crafting Rails 4 Applications","author":"José Valim","image_url":"http://books.google.com/books/content?id=SmtGnQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356735 {BC32D6FA} Crafting Rails Applications_ Everyday Practices for Everyday Rails Development [Valim 2011-04-14].pdf","publisher":"Pragmatic Bookshelf","copywrite":"2013","description":"Summary: Get ready to see Rails as you've never seen it before. Learn how to extend the framework, change its behavior, and replace whole components to bend it to your will. Eight different test-driven tutorials will help you understand Rails' inner workings and prepare you to tackle complicated projects. This second edition has been updated to Rails 4 and discusses new topics such as streaming, mountable engines, and thread safety."},{"title":"The Rails View","author":"Bruce Williams and John Athayde","image_url":"https://images-na.ssl-images-amazon.com/images/I/51Zg4DnuKcL._AC_US160_.jpg","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356875 {BAFE7C2A} The Rails View_ Create a Beautiful and Maintainable User Experience [Athayde & Williams 2012-04-03].pdf","publisher":"Pragmatic Publishing","copywrite":"2012-04-03","description":"Working in the View layer requires a breadth of knowledge and attention to detail unlike anywhere else in Rails. One wrong move can result in brittle, complex views that stop future development in its tracks. This book will help you break free from tangles of logic and markup in your views as you pick up the practical skills you need to implement your user interface cleanly and maintainably.\n\n You'll discover how to build up solid, sustainable layouts and popular interface elements with semantic HTML5 and CSS3, and when you can responsibly generate markup and use advanced presenters... all without leaving the designers on your team out in the cold. Widen your appeal with responsive design, and discover how new progressive enhancement techniques can take you beyond the \"weakest link\" approach of the past. Master the asset pipeline introduced in Rails 3.1 and use Sass and Coffeescript to make your interface code shorter and more enjoyable.\n\n You'll create elegant, well-structured views that are a joy to build on. You'll appreciate its comprehensive, objective guidance in a realm full of subjective opinions."},{"title":"Build Awesome Command-line Applications in Ruby","author":"David B. Copeland","image_url":"http://books.google.com/books/content?id=yXXpygAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356913 {2F28C4E5} Build Awesome Command-Line Applications in Ruby_ Control Your Computer, Simplify Your Life [Copeland 2012-03-22].pdf","copywrite":"2012","description":"Provides information on using Ruby to build command-line applications."},{"title":"Deploying Rails","author":"Anthony Burns, Tom Copeland","image_url":"http://books.google.com/books/content?id=XA1_uAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356956 {73C99FF4} Deploying Rails_ Automate, Deploy, Scale, Maintain, and Sleep at Night [Burns & Copeland 2012-07-31].pdf","copywrite":"2012","description":"Today's modern Rails applications have lots of moving parts. Make sure your next production deployment goes smoothly with this hands-on book, which guides you through the entire production process. You'll set up scripts to install and configure all the software your servers need, including your application code. Once you're in production, you'll learn how to set up systems to monitor your application's health, gather metrics so you can stop problems before they start, and fix things when they go wrong. Deploying Rails takes you on a expertly guided tour of the current best practices in Rails deployment and management. You'll find in-depth explanations on effectively running a Rails app by leveraging popular open source tools such as Puppet, Capistrano, and Vagrant. Then you'll go beyond deployment and learn how to use Ganglia and Nagios to monitor your application's health and gather metrics so you can head off problems before they happen. You'll start out by building your own virtual environment by writing scripts to provision a production server with Vagrant and Puppet. Then you'll leverage the popular Rails deployment tool Capistrano to deploy an application into this infrastructure. Once the app is live, you'll monitor your application's health with Nagios, and configure Ganglia to collect system metrics. Finally, you'll see how to keep your data backed up, recover data when things go wrong, tame your log files, and use Puppet to automate everything along the way. Whether you're a Rails developer who wants a better understanding of the needs of a production Rails system, if you're a system administrator who wants to manage a Rails application, or if you're bridging the gap between development and operations, this book will be your roadmap to successful production deployment and maintenance, whether your application has ten users or ten million users. What You Need: The exercises and examples are most suited to a computer running some Unix variant, such as Mac OS X or Linux. But a Windows machine running Linux in a VirtualBox virtual machine is also sufficient. We'll show you how to set up a local virtual machine for your deployments; you won't need a dedicated server to hone your deployment skills. We expect you to have a basic familiarity with the Ruby programming language, the Ruby on Rails framework, and the Unix command line."},{"title":"Rails Test Prescriptions","author":"Noel Rappin","image_url":"http://books.google.com/books/content?id=3wqISQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1934356646 {34B04E31} Rails Test Prescriptions_ Keeping Your Application Healthy [Rappin 2011-03-10].pdf","copywrite":"2010","description":"Provides information on testing procedures and tools for Rails 2 and Rails 3."},{"title":"Agile Web Development with Rails 4","author":"Sam Ruby, David Thomas, David Heinemeier Hansson","image_url":"http://books.google.com/books/content?id=ymiqnAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1937785564 {06847506} Agile Web Development with Rails 4 [Ruby, Thomas & Hansson 2013-10-11].pdf","copywrite":"2013","description":"Provides information on creating Web-based applications with Rails 4 and Ruby 2, covering such topics as HTTP authentication, validation and unit testing, cart creation, Ajax, caching, migrations, and plugins."},{"title":"Metaprogramming Ruby  Program Like the Ruby Pros (2nd ed ) [Perrotta 2014 08 18]","author":null,"image_url":"http://localhost:3000/assets/document.gif","category_id":10,"type_id":1,"url":"Ruby and Rails/1941222129 {6B75CBE3} Metaprogramming Ruby_ Program Like the Ruby Pros (2nd ed.) [Perrotta 2014-08-18].pdf"},{"title":"Metaprogramming Ruby 2","author":"Paolo Perrotta","image_url":"http://books.google.com/books/content?id=V0iToAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/1941222129 {E532F6FC} Metaprogramming Ruby_ Program Like the Ruby Pros (2nd ed.) [Perrotta 2014-08-18].pdf","copywrite":"2014-08-18","description":"Annotation Everyone in the Ruby world seems to be talking about metaprogramming--how you can use it to remove duplication in your code and write elegant, beautiful programs. Now you can get in on the action as well.This book describes metaprogramming as an essential component of Ruby. Once you understand the principles of Ruby, including the object model, scopes, and eigenclasses, you're on your way to applying metaprogramming both in your daily work and in your fun, after-hours projects.Learning metaprogramming doesn't have to be difficult or boring. By taking you on a Monday-through-Friday workweek adventure with a pair of programmers, Paolo Perrotta helps make mastering the art of metaprogramming both straightforward and entertaining.The book is packed with: Pragmatic examples of metaprogramming in action, many of which come straight from popular libraries or frameworks, such as Rails.Programming challenges that let you experiment and play with some of the most fun, \"out-there\" metaprogramming concepts.Metaprogramming \"spells\"--34 practical recipes and idioms that you can study and apply right now, to write code that is sure to impress.Whether you're a Ruby apprentice on the path to mastering the language or a Ruby wiz in search of new tips, this book is for you."},{"title":"JRuby Rails Web Application Development","author":"Deepak Vohra","image_url":"http://books.google.com/books/content?id=Z4XBBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/3319039334 {0061D9D2} JRuby Rails Web Application Development [Vohra 2014-01-06].pdf","publisher":"Springer Science & Business Media","copywrite":"2014-01-06","description":"This SpringerBrief explains how to create a Rails web application with JRuby, a 100% Java implementation for Ruby. This brief demonstrates how Oracle® WebLogic servers and JBoss® application servers deploy the JRuby application, how JRuby runs on the Java® Virtual Machine, and how JRuby is the basis for popular websites including LinkedIn, Oracle Mix, and Mingle. The Oracle® database and Oracle® MySQL database are used as the basis for the JRuby Rails application. Chapters also cover enabling Flash, developing the JRuby application using Ruby syntax, and deploying applications through Java EE WAR. Hands-on and practical, this SpringerBrief is designed for web developers and researchers interested in JRuby. It is also a useful guide for advanced-level students interested in creating a new web application."},{"title":"Ruby on Rails for PHP and Java Developers","author":"Deepak Vohra","image_url":"http://books.google.com/books/content?id=Tqi9EIfi6skC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","category_id":10,"type_id":1,"url":"Ruby and Rails/354073144X {EB4E8279} Ruby on Rails for PHP and Java Developers [Vohra 2007-09-10].pdf","publisher":"Springer Science & Business Media","copywrite":"2007-08-01","description":"This book covers developing web applications with Ruby on Rails. It discusses Ajax, directory services, and web services. The book details the configuration of Ruby on Rails with different databases such as MySQL, Oracle and SQL Server 2005. In addition, it makes a comparison with PHP, the most commonly used scripting language for developing web applications. The book also provides example applications that may be modified to suit a developer’s application."}]